{
	"BR": "Bem-vindo ao nosso serviço Wi-Fi (o \"Serviço\"). Ao aceder e utilizar este Serviço, o utilizador declara e reconhece que é maior de idade e que leu e concorda em ficar vinculado aos seguintes termos e condições:\n1 Acesso ao serviço\n1.1 O Serviço é fornecido pela loja (a \"Loja\") para uso pessoal do utilizador. A Loja reserva para si própria o direito de alterar ou terminar o Serviço ou alterar os presentes Termos e Condições em qualquer altura. O utilizador é responsável por rever estes Termos e Condições sempre que utilizar o Serviço.\n1.2 O acesso ao Serviço pode ser bloqueado, suspenso ou terminado em qualquer altura e por qualquer motivo, incluindo, entre outros, a violação destes Termos e Condições ou da legislação aplicável.\n1.3 A Loja não garante a disponibilidade da Internet, as velocidades mínimas de ligação à Internet na rede ou que o Serviço será estável, sem falhas, atempado, fiável, operacional ou adequado para suportar a utilização pretendida pelo utilizador.\n1.4 A Loja não garante a qualidade das informações na Internet. É da responsabilidade do utilizador determinar a validade, a qualidade e a relevância das informações obtidas.\n1.5 O Serviço é fornecido numa base aberta e pública e a Loja não pode garantir a segurança do serviço Wi-Fi. O utilizador reconhece e aceita que existem riscos de segurança inerentes associados à utilização do Serviço e que o faz exclusivamente por sua própria conta e risco.\n2 Restrições\nO utilizador reconhece e concorda que, ao utilizar o Serviço, deve cumprir todas as leis aplicáveis e que não deve:\na. utilizar o Serviço para fins comerciais;\nb. utilizar o Serviço para enviar e-mails não solicitados em massa;\nc. revelar ou publicar informações exclusivas ou confidenciais;\nd. violar os direitos de propriedade intelectual de qualquer pessoa;\ne. recolher ou reunir quaisquer informações ou dados do Serviço ou dos servidores utilizados para fornecer o Serviço;\nf. tentar intercetar, interferir ou decifrar qualquer transmissão de ou para os servidores utilizados para fornecer o Serviço;\ng. ligar a redes de partilha de ficheiros \"Peer to Peer\", transferir ficheiros grandes ou executar quaisquer programas, serviços, sistemas, processos ou servidores que possam degradar substancialmente o desempenho ou a acessibilidade da rede;\nh. utilizar o Serviço para transmitir, enviar, carregar, receber, descarregar, publicar, divulgar, distribuir, disseminar, estimular ou solicitar a receção de qualquer material que seja abusivo, difamatório, agressivo, indecente, ofensivo, obsceno, intimidatório, racista, pornográfico, ameaçador, ilegal ou que viole qualquer direito de qualquer pessoa;\ni. utilizar o Serviço para transmitir, armazenar, publicar ou carregar qualquer material eletrónico, como vírus, malware, \"cavalos de Tróia\", \"worms\" ou \"bombas-relógio\", que possam ou sejam susceptíveis de causar danos, destruir ou limitar a funcionalidade de qualquer computador, software, hardware, dispositivo eletrónico ou equipamento de telecomunicações;\nj. obter acesso não autorizado ao computador, conta de e-mail, conta bancária, rede ou equipamento informático de qualquer outra pessoa; ou\nk. utilizar o Serviço para invadir a privacidade de outra pessoa ou para causar incómodo, inconveniência ou ansiedade a outra pessoa.\n3 Privacidade\nO utilizador reconhece e concorda que o Serviço irá captar e processar informações sobre o tipo de navegador de internet e/ou informações do sistema operativo utilizadas pelo dispositivo ativado para determinar os meios mais eficazes e/ou personalizados de apresentar o website solicitado no seu dispositivo. E a Loja irá recolher o endereço IP e MAC do dispositivo ativado que acedeu ao serviço Wi-Fi, depois de aceites os Termos e Condições.\n4 Dispensa e Indemnização\n4.1 A Loja não é responsável pela perda de dados devido a atrasos ou interrupções do serviço ou por qualquer tipo de perda ou danos que o utilizador possa sofrer como resultado da utilização do Serviço.\n4.2 O utilizador liberta e dispensa a Loja de qualquer responsabilidade que possa surgir da sua utilização do Serviço, incluindo a responsabilidade em relação a material difamatório ou ofensivo ou qualquer violação de direitos de autor que possa ocorrer.\n4.3 O utilizador concorda em indemnizar e deve defender e isentar a Loja, os seus funcionários e agentes, de e contra todas as perdas, danos, responsabilidades, encargos, despesas (incluindo, mas não se limitando a honorários de advogados) de qualquer natureza ou tipo decorrentes da violação dos presentes Termos e Condições.",
	"CN": "欢迎使用我们的 Wi-Fi 服务（以下简称\"本服务\"）。通过访问和使用本服务，您声明并承认您已达到法定年龄，且您已阅读并同意受以下条款和条件的约束：\n1 访问本服务\n1.1 本服务由店铺（\"店铺\"）提供，供您个人使用。本店铺保留随时更改或终止本服务或更改本条款和条件的权利。您有责任在每次使用本服务时查看本条款和条件。\n1.2 对服务的访问可能会因任何原因而被阻止、暂停或终止，包括但不限于违反本条款与条件或适用法律的情况。\n1.3 本店铺不保证互联网的可用性、网络的最低互联网连接速度，也不保证服务的稳定性、无故障、及时性、可靠性、可操作性或可支持您的预期用途。\n1.4 本商店不保证互联网信息的质量。您有责任确定所获得信息的有效性、质量和相关性。\n1.5 本服务是以开放和公开的方式提供的，店铺无法保证 Wi-Fi 服务的安全性。您承认并同意使用该服务存在固有的安全风险，您自行承担使用该服务的风险。\n2 限制条款\n您确认并同意，在使用本服务时，您将遵守所有适用法律，并且您将不会\na. 将服务用于商业目的；\nb. 使用本服务发送未经请求的大量电子邮件；\nc. 泄露或公布专有或机密信息；\nd. 侵犯任何人的知识产权；\ne. 从\"服务\"或用于提供\"服务\"的服务器收集或获取任何信息或数据；\nf. 试图拦截、干扰或破译与用于提供\"服务\"的服务器之间的任何传输；\ng. 连接到\"点对点\"文件共享网络，下载大文件，或运行任何可能严重影响网络性能或可访问性的程序、服务、系统、进程或服务器；\nh. 使用本服务传输、发送、上传、接收、下载、发布、张贴、分发、传播、鼓励或招揽接收任何辱骂、诽谤、骚扰、不雅、攻击性、淫秽、威胁性、种族主义、色情、威胁性、非法或侵犯任何人任何权利的材料；\ni. 使用本服务传输、存储、发布或上传任何电子材料，如病毒、恶意软件、特洛伊木马、蠕虫或定时炸弹，这些材料将或可能对任何计算机、软件、硬件、电子设备或电信设备造成损害，或者破坏或限制其功能；\nj. 未经授权访问任何他人的计算机、电子邮件帐户、银行帐户、计算机网络或设备；或\nk. 使用本服务侵犯他人隐私或对他人造成烦扰、不便或焦虑。\n3 隐私权\n您承认并同意，本服务将捕获并处理有关启用设备所使用的网络浏览器类型和/或操作系统信息，以确定以更有效和/或定制的方式在您的设备上显示所请求的网站。一旦同意本條款及条件，本店铺將收集已接入 Wi-Fi 服务的设备的 IP 及 MAC 地址。\n4 免责与赔偿\n4.1 由于服务延迟、中断所导致的任何数据丢失或使用该服务而蒙受的损失或损害，本店铺不承担责任。\n4.2 您免除并解除本店铺因您使用本服务而可能产生的任何责任，包括与诽谤性或攻击性材料有关的责任或可能发生的任何版权侵犯行为。\n4.3 您同意赔偿并且必须为本店铺、其员工和代理人辩护和使其免受所有因您违反这些条款与条件而产生的任何性质或类型的损失、损害、责任、费用（包括但不限于律师费）。",
	"CZ": "Vítá vás služba Wi-Fi (dále jen \"služba\"). Přístupem a používáním této služby potvrzujete, že jste dosáhli zákonné zletilosti, přečetli jste si následující podmínky a ujednání a souhlasíte s  nimi:\n1 Přístup ke službě\n1.1 Službu nabízí obchod (dále jen \"obchod\") pro osobní účely. Obchod si vyhrazuje právo kdykoli tuto službu změnit či ukončit nebo změnit tyto podmínky a ujednání. Kdykoli tuto službu používáte, měli byste si tyto podmínky a ujednání přečíst.\n1.2 Přístup ke službě může být kdykoli a z jakéhokoli důvodu zablokován, pozastaven nebo ukončen, včetně mimo jiné porušení těchto podmínek a ujednání nebo platných zákonů.\n1.3 Obchod nezaručuje dostupnost internetu, minimální hodnoty rychlosti připojení k internetu v síti nebo stabilitu, bezvadnost, včasnost, provozní spolehlivost nebo vhodnost k zamýšlenému účelu.\n1.4 Obchod nezaručuje kvalitu informací na internetu. Za ověření platnosti, kvality a vhodnosti získaných informací odpovídáte vy.\n1.5 Služba je poskytována na otevřeném a veřejném základě a obchod nemůže zaručit bezpečnost služby Wi-Fi; souhlasíte s tím, že používání služby může být spojeno s bezpečnostními riziky a činíte tak na vlastní odpovědnost.\n2 Omezení\nPotvrzujete, že při používání služby budete dodržovat všechny platné zákony a že nebudete\na. používat službu ke komerčním účelům,\nb. používat službu pro odesílání nevyžádaných hromadných e-mailů,\nc. zveřejňovat nebo publikovat vlastnické nebo důvěrné údaje,\nd. porušovat práva k duševnímu vlastnictví jakékoli osoby,\ne. shromažďovat nebo získávat údaje nebo data ze služby nebo serverů používaných pro poskytování služby,\nf. se pokoušet zachytit, narušovat nebo dešifrovat jakýkoli přenos ze serverů používaných pro poskytování služby a na tyto servery,\ng. připojovat sítě pro vzájemné sdílení souborů, stahovat velké soubory nebo spouštět programy, služby, systémy, procesy nebo servery, které mohou významně zhoršovat výkon sítě nebo přístupnost,\nh. používat službu pro přenos, odesílání, nahrávání, příjem, stahování, publikování, zveřejňování, rozšiřování, motivace nebo podpora příjmu jakéhokoli materiálu, který je nevhodný, pomlouvačný, obtěžující, neslušný, urážlivý, obscénní, hrozivý, rasistický, pornografický, výhružný, protiprávní nebo porušující práva třetí osoby,\ni. používat službu pro přenos, ukládání, zveřejňování nebo nahrávání elektronického materiálu, jako jsou viry, malware, trojské koně, červi nebo časované bomby, které mohou poškodit, zničit nebo omezit funkčnost jakéhokoli počítače, softwaru, hardwaru, elektronického zařízení nebo telekomunikačního vybavení,\nj. získat neoprávněný přístup k počítači, e-mailovému účtu, bankovnímu účtu, počítačové síti nebo vybavení jakékoli osoby,\nk. používat službu pro narušení soukromí jiné osoby nebo způsobit jiné osobě újmu, nepohodlí či obavy.\n3 Ochrana osobních údajů\nSouhlasíte s tím, že služba bude zachycovat a zpracovávat informace o typu webového prohlížeče a/nebo operačním systému používaného aktivovaným zařízením pro určení efektivnějšího a/nebo individualizovaného způsobu zobrazení požadované webové stránky na vašem zařízení. Obchod bude shromažďovat IP adresu a adresu MAC aktivovaného zařízení s přístupem ke službě Wi-Fi, jakmile vyjádříte souhlas s podmínkami a ujednáními.\n4 Odmítnutí odpovědnosti a náhrada škody\n4.1 Obchod neodpovídá za ztrátu dat z důvodu prodlev nebo narušení služby ani za jakékoli ztráty či poškození vyplývající z používání služby.\n4.2 Obchod zbavujete odpovědnosti vyplývající z používání služby, včetně odpovědnosti v souvislosti s pomlouvačným nebo urážlivým materiálem nebo porušením autorského práva.\n4.3 Souhlasíte s tím, že obchod, jeho zaměstnance a zástupce budete chránit před jakýmikoli ztrátami, poškozením, odpovědností, sazby, náklady (včetně mimo jiné poplatků za právní zastoupení) jakéhokoli druhu nebo typu vyplývajícími z porušení podmínek a ujednání.",
	"DA": "Velkommen til vores Wi-Fi-tjeneste (\"Tjenesten\"). Ved at få adgang til og bruge denne Tjeneste erklærer og accepterer du, at du ar myndig, og at du har læst og accepterer at være bundet af følgende vilkår og betingelser:\n1 Adgang til Tjenesten\n1.1 Tjenesten leveres fra butikken (\"Butik\") til din personlige brug. Butikken forbeholder sig ret til at ændre eller afslutte Tjenesten eller ændre disse Vilkår og betingelser på et hvilket som helst tidspunkt. Du har ansvaret for at gennemgå disse Vilkår og betingelser hver gang, du bruger Tjenesten.\n1.2 Adgang til Tjenesten kan blive blokeret eller ophøre på et hvilket som helst tidspunkt af en hvilken som helst årsag, men ikke begrænset til overtrædelse af disse Vilkår og betingelser eller gældende lovgivning.\n1.3 Butikken garanterer ikke tilgængelighed til internettet, minimumhastigheden for internettet på netværket, eller at Tjenesten vil ære stabil, uden fejl, til tiden, driftsbar eller egnet til at understøtte din tilsigtede brug.\n1.4 Butikken garanterer ikke kvaliteten af oplysningerne på internettet. Det er dit ansvar at fastlægge gyldigheden, kvaliteten og relevansen af de hentede oplysninger.\n1.5 Tjenesten ydes på åbent og offentligt grundlag, og Butikken kan ikke garantere sikkerheden af Wi-Fi-tjenesten. Du anerkender og accepterer, at der er indbyggede sikkerhedsrisici ved brugen af Tjenesten, og at du anvender den alene på din egen risiko.\n2 Begrænsninger\nDu anerkender og accepterer, at du ved at bruge Tjenesten vil overholde alle gældende love og ikke;\na. bruge Tjenesten til kommercielle formål;\nb. bruge Tjenesten til at sende uopfordrede masse-e-mails;\nc. afsløre eller offentliggøre ejendomsretslige eller fortrolige oplysninger;\nd. overtræde de intellektuelle ejendomsrettigheder for nogen person;\ne. indsamle eller høste oplysninger eller data fra Tjenesten eller serverne, der bruges til at yde Tjenesten;\nf. forsøge at opfange, forstyrre eller afkode enhver overførsel til eller fra de servere, som bruges til at yde Tjenesten;\ng. tilslutte til \"Peer-to-Peer\"-fildelingsnetværk, downloade store filer eller køre nogen programmer, tjenester, systemer, processer eller servere, som kan degradere netværksydelsen eller -adgangen betragteligt;\nh. bruge Tjenesten til at overføre, sende, uploade, modtage, downloade, offentliggøre, opslå, distribuere, sprede, opfordre til eller anmode om modtagelse af noget materiale, som er groft, ærekrænkende, mobbende, anstødelige, fornærmende, obskøne, truende, racistiske, pornografiske, truende, ulovlige eller overtræder rettigheder for nogen person;\ni. bruge Tjenesten til at overføre, lagre, offentliggøre eller uploade elektronisk materiale, såsom virusser, malware, trojanske heste, orme eller tidsbomber, som vil og sandsynligvis medføre skade på eller ødelægge eller begrænse funktionen af en computer, software, hardware, elektroniske enheder eller telekommunikationsudstyr;\nj. opnå uautoriseret adgang til nogen anden persons computer, e-mailkonto, bankkonto, computernetværk eller udstyr eller;\nk. bruge Tjenesten til at trænge ind på andre personers privatliv eller forårsage irritation, gene eller angst hos en anden person.\n3 Privatliv\nDu anerkender og accepterer, at Tjenesten vil optage og behandle oplysninger om den webbrowsertype og/eller oplysninger om styresystem, der anvendes af den aktivere enhed for at fastlægge den mest effektive og/eller tilpassede måde at vise det anmodede websted på din enhed. Og Butikken vil indsamle IP- og MAC-adressen for den aktiverede enhed, som har fået adgang til Wi-Fi-tjenesten, når Vilkår og betingelser er accepteret.\n4 Frigørelse og skadeserstatning\n4.1 Butikken har ikke ansvar for tab af data pga. tjenesteforsinkelser eller afbrydelser af nogen art eller tab eller skader, som du måtte påføre dig som et resultat af brugen af Tjenesten.\n4.2 Du frigør og fraskriver Butikken fra ethvert ansvar, som måtte opstå ved din brug af Tjenesten, herunder ansvar i forhold til ærekrænkende eller stødende materiale eller et brud på copyright, som kan opstå.\n4.3 Du accepterer at erstatte og at skulle forsvare eller skadesløsholde Butikken, dens medarbejdere og agenter fra og mod alt tab, skade, ansvar, omkostning, udgift (herunder, men ikke begrænset til advokatsalærer) af nogen art eller slags, der måtte opstå ved dit brud på disse Vilkår og betingelser.",
	"DE": "Willkommen bei unserem WLAN-Service (der \"Service\"). Indem Sie auf diesen Service zugreifen und diesen verwenden, bestätigen Sie und stimmen Sie zu, dass Sie volljährig sind und die folgenden Geschäftsbedingungen gelesen haben und sich an diese halten werden.\n1 Auf den Service zugreifen\n1.1 Der Service wird vom Store (der \"Store\") für Ihre persönliche Nutzung bereitgestellt. Der Store behält sich das Recht vor, den Service zu ändern oder zu beenden oder diese Geschäftsbedingungen jederzeit zu ändern. Sie sind dafür verantwortlich, diese Geschäftsbedingungen jedes Mal zu überprüfen, wenn Sie den Service nutzen.\n1.2 Der Zugriff auf den Service kann jederzeit aus beliebigen Gründen blockiert, ausgesetzt oder beendet werden, einschließlich, aber nicht beschränkt auf Ihre Verletzung dieser Geschäftsbedingungen oder geltender Gesetze.\n1.3 Der Store übernimmt keine Garantie für die Verfügbarkeit des Internets, die Mindestgeschwindigkeiten der Internetverbindung im Netzwerk oder dafür, dass der Service stabil, fehlerfrei, rechtzeitig, zuverlässig, betriebsbereit oder für die Unterstützung der von Ihnen beabsichtigten Nutzung geeignet sein wird.\n1.4 Der Store übernimmt keine Garantie für die Qualität der Informationen im Internet. Es liegt in Ihrer Verantwortung, die Gültigkeit, Qualität und Relevanz der erhaltenen Informationen zu überprüfen.\n1.5 Der Service wird auf einer offenen und öffentlichen Basis bereitgestellt und der Store kann die Sicherheit des WLAN-Service nicht garantieren. Sie erkennen an und stimmen zu, dass mit der Nutzung des Service inhärente Sicherheitsrisiken verbunden sind und dass Sie dies ausschließlich auf eigenes Risiko tun.\n2 Einschränkungen\nSie erkennen an und erklären sich damit einverstanden, dass Sie bei der Nutzung des Service alle anwendbaren Gesetze einhalten werden und dass Sie:\na. den Service nicht für kommerzielle Zwecke nutzen werden;\nb. den Service nicht zum Versenden von nicht angefragten Massen-E-Mails verwenden;\nc. keine firmeneigenen oder vertraulichen Informationen veröffentlichen werden;\nd. die Rechte am geistigen Eigentum einer Person nicht verletzen;\ne. keine Informationen oder Daten von dem Service oder den Servern, die zur Bereitstellung des Service verwendet werden, sammeln oder erfassen;\nf. nicht versuchen, Übertragungen zu oder von den Servern, die zur Bereitstellung des Service verwendet werden, abzufangen, zu stören oder zu entschlüsseln;\ng. keine Verbindung zu \"Peer-to-Peer\"-Filesharing-Netzwerken herstellen, große Dateien herunterladen oder Programme, Services, Systeme, Prozesse oder Server ausführen, die die Leistung oder Zugänglichkeit des Netzwerks erheblich beeinträchtigen können;\nh. den Service nicht nutzen werden, um beleidigendes, verleumderisches, belästigendes, unanständiges, beleidigendes, obszönes, bedrohliches, rassistisches, pornografisches, bedrohendes, ungesetzliches oder die Rechte einer Person verletzendes Material zu übermitteln, zu senden, hochzuladen, zu empfangen, herunterzuladen, zu veröffentlichen, zu posten, zu verteilen, zu verbreiten, zu ermutigen oder zum Erhalt von Material aufzufordern;\ni. den Service nicht nutzen werden, um elektronisches Material wie Viren, Malware, Trojanische Pferde, Würmer oder Zeitbomben zu übertragen, zu speichern, zu veröffentlichen oder hochzuladen, die Schäden an Computern, Software, Hardware, elektronischen Geräten oder Telekommunikationseinrichtungen verursachen oder deren Funktionalität einschränken oder zerstören können;\nj. sich keinen unbefugten Zugang zum Computer, E-Mail-Konto, Bankkonto, Computernetzwerk oder zur Ausrüstung einer anderen Person verschaffen werden; bzw.\nk. den Service nicht nutzen werden, um in die Privatsphäre einer anderen Person einzudringen oder einer anderen Person Ärger, Unannehmlichkeiten oder Angst zu bereiten.\n3 Datenschutz\nSie nehmen zur Kenntnis und erklären sich damit einverstanden, dass der Service Informationen über den Typ des Webbrowsers und/oder des Betriebssystems, das von dem aktivierten Gerät verwendet wird, erfasst und verarbeitet, um die effektivere und/oder individuellere Methode zur Anzeige der angeforderten Website auf Ihrem Gerät zu bestimmen. Und der Store erfasst die IP- und MAC-Adresse des aktivierten Geräts, das auf den WLAN-Service zugegriffen hat, sobald die Geschäftsbedingungen akzeptiert worden sind.\n4 Freistellung und Entschädigung\n4.1 Der Store haftet nicht für Datenverluste aufgrund von Serviceverzögerungen oder -unterbrechungen oder für jegliche Art von Verlusten oder Schäden, die Sie infolge Ihrer Nutzung des Service erleiden könnten.\n4.2 Sie entbinden den Store von jeglicher Haftung, die sich aus Ihrer Nutzung des Service ergeben könnte, einschließlich der Haftung in Bezug auf verleumderisches oder beleidigendes Material oder jegliche Verletzung des Urheberrechts, die auftreten könnte.\n4.3 Sie erklären sich damit einverstanden, den Store, seine Mitarbeiter und Vertreter von allen Verlusten, Schäden, Haftungen, Gebühren und Kosten (einschließlich, aber nicht beschränkt auf Anwaltskosten) jeglicher Art zu entschädigen und schadlos zu halten, die sich aus Ihrem Verstoß gegen diese Geschäftsbedingungen ergeben.",
	"EN": "Welcome to our Wi-Fi service (the \"Service\"). By accessing and using this Service, you represent and acknowledge that you are of legal age, and you have read and agree to be bound by the following terms and conditions:\n1 Accessing the Service\n1.1 The Service is provided by the store (the \"Store\") for your personal use. The Store reserves the right to change or terminate the Service or change this Terms and Conditions at any time. You are responsible for reviewing this Terms and Conditions each time you use the Service.\n1.2 Access to the Service may be blocked, suspended or terminated at any time for any reason including but not limited to your violation of this Terms and Conditions or applicable laws.\n1.3 The Store does not guarantee availability to the Internet, the minimum Internet connection speeds on the network, or that the Service will be stable, fault-free, timely, reliable, operational or suitable for supporting your intended use.\n1.4 The Store does not guarantee the quality of the information on the internet. It is your responsibility to determine the validity, quality, and relevance of the information obtained.\n1.5 The Service is provided on an open and public basis and the Store cannot guarantee the security of the Wi-Fi service, you acknowledge and agree that there are inherent security risks associated with using the Service and that you do so solely at your own risk.\n2 Restrictions\nYou acknowledge and agree that when using the Service you will comply with all applicable laws and that you will not;\na. use the Service for commercial purposes;\nb. use the Service to send unsolicited bulk emails;\nc. reveal or publish proprietary or confidential information;\nd. infringe the intellectual property rights of any person;\ne. collect or harvest any information or data from the Service or the servers used to provide the Service;\nf. attempt to intercept, interfere with or decipher any transmission to or from the servers used to provide the Service;\ng. connect to \"Peer to Peer\" file sharing networks, download large files, or run any programs, services, systems, processes, or servers that may substantially degrade network performance or accessibility;\nh. use the Service to transmit, send, upload, receive, download, publish, post, distribute, disseminate, encourage or solicit receipt of any material which is abusive, defamatory, harassing, indecent, offensive, obscene, menacing, racist, pornographic, threatening, unlawful or in breach of any right of any person;\ni. use the Service to transmit, store, publish or upload any electronic material, such as viruses, malware, Trojan horses, worms ,or time bombs, which will or are likely to cause damage to, or to destroy or limit the functionality of, any computer, software, hardware, electronic device or telecommunications equipment;\nj. obtain unauthorised access to any other person's computer, email account, bank account, computer network or equipment; or\nk. use the Service to invade the privacy of another person or to cause annoyance, inconvenience or anxiety to another person.\n3 Privacy\nYou acknowledge and agree that the Service will capture and process information about the web browser type and/or operating system information used by the enabled device to determine the more effective and/or customized means of displaying the requested website on your device. And the Store will collect the IP and MAC address of the enabled device that has accessed the Wi-Fi service, once the Terms and Conditions have been agreed to.\n4 Release and Indemnity\n4.1 The Store is not liable for loss of data due to service delays or interruptions or any kind of loss or damages you may sustain as a result of your use of the Service.\n4.2 You release and discharge the Store from any liability which might arise from your use of the Service, including liability in relation to defamatory or offensive material or any breach of copyright which may occur.\n4.3 You agree to indemnify and must defend and hold harmless the Store, its employees and agents, from and against all loss, damage, liability, charge, expense (including but not limited to attorneys' fees) of any nature or kind arising from your breach of these Terms and Conditions.",
	"ES": "Bienvenido a nuestro servicio Wi-Fi (el \"Servicio\"). Al acceder a este Servicio y utilizarlo, usted declara y reconoce que es mayor de edad y que ha leído y acepta estar sujeto a los siguientes términos y condiciones:\n1 Acceso al Servicio\n1.1 El Servicio es proporcionado por la tienda (la \"Tienda\") para su uso personal. La Tienda se reserva el derecho de cambiar o cancelar el Servicio o de cambiar estos Términos y Condiciones en cualquier momento. Usted es responsable de revisar estos Términos y condiciones cada vez que utilice el Servicio.\n1.2 El acceso al Servicio puede bloquearse, suspenderse o cancelarse en cualquier momento por cualquier motivo, incluido, entre otros, su infracción de estos Términos y condiciones o de la legislación vigente.\n1.3 La Tienda no garantiza la disponibilidad de Internet, las velocidades mínimas de conexión a Internet en la red o que el Servicio sea estable, sin fallos, oportuno, confiable, operativo o adecuado para permitir su uso previsto.\n1.4 La Tienda no garantiza la calidad de la información en Internet. Es su responsabilidad determinar la validez, calidad y relevancia de la información obtenida.\n1.5 El Servicio se proporciona de forma abierta y pública y la Tienda no puede garantizar la seguridad del servicio Wi-Fi; usted reconoce y acepta que existen riesgos de seguridad inherentes asociados con el uso del Servicio y que lo hace únicamente bajo su propio riesgo.\n2 Restricciones\nUsted reconoce y acepta que al usar el Servicio cumplirá con todas las leyes aplicables y que no hará lo siguiente;\na. utilizar el Servicio con fines comerciales;\nb. utilizar el Servicio para enviar correos electrónicos masivos no solicitados;\nc. revelar o publicar información privada o confidencial;\nd. infringir los derechos de propiedad intelectual de cualquier persona;\ne. recopilar cualquier información o datos del Servicio o de los servidores utilizados para proporcionar el Servicio;\nf. intentar interceptar, interferir o descifrar cualquier transmisión hacia o desde los servidores utilizados para proporcionar el Servicio;\ng. conectarse a redes de intercambio de archivos \"Peer to Peer\" (Entre iguales), descargar archivos de gran tamaño o ejecutar cualquier programa, servicio, sistema, proceso o servidor que pueda reducir sustancialmente el rendimiento o la accesibilidad de la red;\nh. utilizar el Servicio para transmitir, enviar, cargar, recibir, descargar, publicar, distribuir, diseminar, alentar o solicitar la recepción de cualquier material que sea abusivo, difamatorio, acosador, indecente, ofensivo, obsceno, amenazante, racista, pornográfico, ilegal o que infrinja los derechos de las personas;\ni. usar el Servicio para transmitir, almacenar, publicar o cargar cualquier material electrónico, como virus, malware, caballos de Troya, gusanos o bombas de tiempo, que causarán o es probable que causen daños, destruyan o limiten la funcionalidad de cualquier ordenador, software, hardware, dispositivo electrónico o equipo de telecomunicaciones;\nj. obtener acceso no autorizado al ordenador, cuenta de correo electrónico, cuenta bancaria, red informática o equipo de cualquier otra persona; o\nk. usar el Servicio para invadir la privacidad de otra persona o para causar molestias, inconvenientes o ansiedad a otra persona.\n3 Privacidad\nUsted reconoce y acepta que el Servicio capturará y procesará información sobre el tipo de navegador web y/o la información del sistema operativo utilizada por el dispositivo habilitado para determinar los medios más efectivos y/o personalizados para mostrar el sitio web solicitado en su dispositivo. Y la Tienda recopilará la dirección IP y MAC del dispositivo habilitado que haya accedido al servicio Wi-Fi, una vez que se hayan acordado los Términos y Condiciones.\n4 Liberación y compensación\n4.1 La Tienda no es responsable de la pérdida de datos debido a retrasos o interrupciones del servicio o cualquier tipo de pérdida o daño que pueda sufrir como resultado de su uso del Servicio.\n4.2 Usted libera a la Tienda de cualquier responsabilidad que pueda surgir de su uso del Servicio, incluida la responsabilidad en relación con material difamatorio u ofensivo o cualquier violación de los derechos de autor que pueda tener lugar.\n4.3 Usted acepta compensar y debe defender y eximir de responsabilidad a la Tienda, sus empleados y agentes, de y contra toda pérdida, daño, responsabilidad, cargo, gasto (incluidos, entre otros, los honorarios de abogados) de cualquier naturaleza o tipo que surja de su incumplimiento. de estos Términos y Condiciones.",
	"FI": "Tervetuloa Wi-Fi-palveluumme (\"palvelu\"). Pääsemällä tähän palveluun ja käyttämällä sitä vakuutat ja tunnustat olevasi täysi-ikäinen ja lukeneesi seuraavat käyttöehdot sekä sitoutuvasi noudattamaan niitä:\n1 Palveluun pääsy\n1.1 Kauppa (\"kauppa\") tarjoaa palvelun henkilökohtaiseen käyttöösi Kauppa varaa oikeuden muuttaa palvelua tai lopettaa sen tai muuttaa näitä käyttöehtoja milloin tahansa. Olet vastuussa näiden käyttöehtojen tarkistamisesta aina kun käytät palvelua.\n1.2 Pääsy palveluun voidaan estää, keskeyttää tai lopettaa milloin tahansa mistä tahansa syystä, mukaan lukien muun muassa siksi, että olet rikkonut näitä käyttöehtoja tai sovellettavia lakeja.\n1.3 Kauppa ei takaa internetin saatavuutta, pienintä internetin nopeutta verkossa tai sitä, että palvelu on vakaa, virheetön, oikea-aikainen, luotettava, toimiva tai sopiva käyttötarkoitukseesi.\n1.4 Kauppa ei takaa internetissä olevien tietojen laatua. On sinun vastuullasi määrittää hankittujen tietojen oikeellisuus, laatu ja merkityksellisyys.\n1.5 Palvelu tarjotaan avoimesti ja julkisesti, eikä kauppa voi taata Wi-Fi-palvelun tietoturvaa, ja ymmärrät ja hyväksyt, että palvelun käyttöösi liittyy luontaisia tietoturvariskejä ja että teet sen vain omalla vastuullasi.\n2 Rajoitukset\nYmmärrät ja hyväksyt, että käyttäessäsi palvelua noudatat kaikkia soveltuvia lakeja ja että et saa\na. käyttää palvelua kaupallisiin tarkoituksiin\nb. käyttää palvelua ei-toivottujen joukkosähköpostien lähettämiseen\nc. paljastaa tai julkaista omistusoikeudellisia tai luottamuksellisia tietoja\nd. loukata kenenkään henkilön immateriaalioikeuksia\ne. kerätä tai koostaa tietoja tai dataa palvelusta tai palvelun tarjoamiseen käytetyistä palvelimista\nf. yrittää siepata, häiritä tai tulkita mitä tahansa lähetystä palvelun tarjoamiseen käytettyihin palvelimiin tai palvelimista\ng. muodostaa yhteyttä vertaistiedostonjakoverkkoihin, lataa suuria tiedostoja tai suorita mitään ohjelmia, palveluita, järjestelmiä, prosesseja tai palvelimia, jotka voivat merkittävästi heikentää verkon suorituskykyä tai saatavuutta\nh. käyttää palvelua minkä tahansa sellaisen materiaalin välittämiseen, lähettämiseen, palvelimelle lataamiseen, vastaanottamiseen, lataamiseen, julkaisemiseen, postaamiseen, jakamiseen, levittämiseen tai sen vastaanottamisen kannustamiseen tai pyytämiseen, joka on loukkaavaa, herjaavaa, häiritsevää, sopimatonta, loukkaavaa, säädytöntä, uhkaavaa, rasistista, pornografista, uhkailevaa , laitonta tai jonkun henkilön oikeutta loukkaavaa\ni. käyttää palvelua minkä tahansa sellaisen sähköisen materiaalin, kuten virusten, haittaohjelmien, troijalaisten, matojen tai aikapommien, välittämiseen, tallentamiseen, julkaisemiseen tai palvelimelle lataamiseen, joka aiheuttaa tai todennäköisesti vahingoittaa tai tuhoaa jonkin tietokoneen, ohjelmiston, laitteiston, elektronisen laitteen tai tietoliikennelaitteen tai rajoittaa sen toimintaa\nj. hankkia luvatonta pääsyä kenenkään toisen henkilön tietokoneeseen, sähköpostitilille, pankkitilille, tietokoneverkkoon tai laitteistoon tai\nk. käyttää palvelua toisen henkilön yksityisyyden loukkaamiseen tai haitan, hankaluuksien tai ahdistuksen aiheuttamiseen toiselle henkilölle.\n3 Yksityisyys\nYmmärrät ja hyväksyt, että palvelu tallentaa ja käsittelee tietoja verkkoselaintyypistä ja/tai käyttöjärjestelmätiedoista, joita käytössä oleva laite käyttää määrittääkseen tehokkaamman ja/tai mukautetumman tavan pyydetyn verkkosivuston näyttämiseen laitteellasi. Lisäksi kauppa kerää Wi-Fi-palveluun päässeen käytössä olevan laitteen IP- ja MAC-osoitteen, kun käyttöehdot on hyväksytty.\n4 Vapautus ja korvausvastuu\n4.1 Kauppa ei ole vastuussa tietojen katoamisesta, joka johtuu palvelun viivästyksistä tai keskeytyksistä, tai mistään menetyksistä tai tappioista, joita sinulle saattaa koitua palvelun käyttösi seurauksena.\n4.2 Vapautat kaupan kaikesta vastuusta, joka saattaa johtua palvelun käytöstäsi, mukaan lukien vastuu herjaavasta tai loukkaavasta materiaalista tai mahdollisesta tekijänoikeusrikkomuksesta.\n4.3 Sitoudut suorittamaan korvauksen kaupalle, sen työntekijöille ja edustajille ja puolustamaan ja suojelemaan heitä kaikkien ja kaikenlaisten sellaisten menetysten, vahinkojen, vastuiden, syytösten, kulujen (mukaan lukien muun muassa asianajajan palkkiot) suhteen, jotka ovat seurausta siitä, että olet rikkonut näitä käyttöehtoja.",
	"FR": "Bienvenue sur notre service Wi-Fi (le « Service »). En accédant à ce service et en l'utilisant, vous déclarez et reconnaissez avoir l'âge légal, et vous avez lu et accepté d'être lié par les conditions suivantes :\n1 Accès au service\n1.1 Le service est fourni par la boutique (la « Boutique ») pour votre usage personnel. La Boutique se réserve le droit de modifier ou de mettre fin au service ou de modifier les présentes conditions générales à tout moment. Il vous incombe d'examiner les présentes conditions d’utilisation chaque fois que vous utilisez le service.\n1.2 L'accès au service peut être bloqué, suspendu ou résilié à tout moment pour quelque raison que ce soit, y compris, mais sans s'y limiter, en cas de violation des présentes conditions générales ou des lois applicables.\n1.3 La Boutique ne garantit pas la disponibilité d'Internet, les vitesses minimales de connexion à l'Internet sur le réseau, ou que le service sera stable, sans défaut, opportun, fiable, opérationnel ou adapté pour prendre en charge l'utilisation que vous souhaitez en faire.\n1.4 La Boutique ne garantit pas la qualité des informations présentes sur Internet. Il vous appartient de déterminer la validité, la qualité et la pertinence des informations obtenues.\n1.5 Le service est fourni sur une base ouverte et publique et la Boutique ne peut pas garantir la sécurité du service Wi-Fi, vous reconnaissez et acceptez qu'il existe des risques de sécurité inhérents associés à l'utilisation du service et que vous le faites uniquement à vos propres risques.\n2 Restrictions\nVous reconnaissez et acceptez qu'en utilisant le service, vous vous conformerez à toutes les lois applicables et que vous vous abstiendrez ;\na. d’utiliser le service à des fins commerciales ;\nb. d’utiliser le service pour envoyer des e-mails en bloc non sollicités ;\nc. de révéler ou publier des informations exclusives ou confidentielles ;\nd. d’enfreindre les droits de propriété intellectuelle de toute personne ;\ne. de collecter ou récolter des informations ou des données à partir du service ou des serveurs utilisés pour fournir le service ;\nf. de tenter d'intercepter, d'interférer ou de déchiffrer toute transmission vers ou depuis les serveurs utilisés pour fournir le service ;\ng. de vous connecter à des réseaux de partage de fichiers « Peer to Peer », télécharger des fichiers volumineux ou exécuter des programmes, services, systèmes, processus ou serveurs susceptibles de dégrader sensiblement les performances ou l'accessibilité du réseau ;\nh. d’utiliser le service pour transmettre, envoyer, charger, recevoir, télécharger, publier, afficher, distribuer, diffuser, encourager ou solliciter la réception de tout matériel abusif, diffamatoire, harcelant, indécent, offensant, obscène, menaçant, raciste, pornographique, menaçant, illégal ou en violation des droits d'une personne ;\ni. d’utiliser le service pour transmettre, stocker, publier ou télécharger tout matériel électronique, tel que des virus, des logiciels malveillants, des chevaux de Troie, des vers ou des bombes à retardement, qui endommageront ou sont susceptibles d'endommager, de détruire ou de limiter la fonctionnalité de tout ordinateur, logiciel, matériel, dispositif électronique ou équipement de télécommunication ;\nj. d’obtenir un accès non autorisé à l'ordinateur, au compte e-mail, au compte bancaire, au réseau informatique ou à l'équipement d'une autre personne ; ou\nk. d’utiliser le service pour porter atteinte à la vie privée d'autrui ou pour causer des ennuis, des désagréments ou de l'anxiété à autrui.\n3 Confidentialité\nVous reconnaissez et acceptez que le Service capture et traite les informations relatives au type de navigateur Web et/ou au système d'exploitation utilisé par le dispositif activé afin de déterminer les moyens les plus efficaces et/ou personnalisés d'afficher le site Web demandé sur votre dispositif. La Boutique recueillera l'adresse IP et l'adresse MAC du dispositif activé qui a accédé au service Wi-Fi, une fois que les conditions générales auront été acceptées.\n4 Décharge et indemnisation\n4.1 La Boutique n'est pas responsable de la perte de données due à des retards ou des interruptions de service ou de tout type de perte ou de dommage que vous pourriez subir du fait de votre utilisation du service.\n4.2 Vous dégagez la Boutique de toute responsabilité pouvant découler de votre utilisation du service, y compris en ce qui concerne le matériel diffamatoire ou offensant ou toute violation des droits d'auteur qui pourrait survenir.\n4.3 Vous acceptez d'indemniser et de défendre la Boutique, ses employés et agents, contre toute perte, dommage, responsabilité, charge, dépense (y compris, mais sans s'y limiter, les honoraires d'avocat) de quelque nature que ce soit, résultant de votre violation des présentes conditions générales.",
	"HU": "Üdvözli a Wi-Fi szolgáltatásunk (a \"szolgáltatás\"). E szolgáltatáshoz való hozzáféréssel és annak használatával kijelenti és elismeri, hogy nagykorú, továbbá elolvasta és elfogadja a következő Feltételeket és kikötéseket:\n1 A szolgáltatáshoz való hozzáférés\n1.1 Az áruház (az \"áruház\") személyes használat céljából biztosítja a szolgáltatást. Az áruház fenntartja a jogot a szolgáltatás tetszőleges időben való módosítására vagy megszüntetésére, illetve ezen Feltételek és kikötések módosítására. Ön a felelős a szolgáltatás használatakor e Feltételek és kikötések áttekintéséért.\n1.2 Bármikor, beleértve, de nem korlátozva e Feltételek és kikötések megsértésére bármely okból blokkolható, felfüggeszthető vagy megszüntethető a szolgáltatáshoz való hozzáférés.\n1.3 Az áruház nem garantálja az internet elérhetőségét, az internetkapcsolat minimális sebességét, illetve a szolgáltatás stabilitását, hibamentességét, megbízhatóságát, üzemképességét vagy az használati céljának való megfelelését.\n1.4 Az áruház nem vállal garanciát az interneten található információk minőségére. Az Ön felelőssége a kapott információk érvényességének, minőségének és fontosságának a meghatározása.\n1.5 Szabadon és nyilvánosan történik a szolgáltatás biztosítása, az áruház nem garantálhatja a Wi-Fi szolgáltatás biztonságát, Ön tudomásul veszi és elfogadja a szolgáltatás használatában rejlő biztonsági kockázatokat, illetve a saját felelősségére használja azt.\n2 Korlátozások\nTudomásul veszi és elfogadja, hogy a szolgáltatás használatakor betartja valamennyi vonatkozó törvényt, továbbá nem;\na. használja kereskedelmi célokra a szolgáltatást;\nb. használja kéretlen e-mailek tömeges küldésére a szolgáltatást;\nc. fed fel védett vagy bizalmas információkat;\nd. sérti meg más szerzői jogait;\ne. gyűjt információkat vagy adatokat a szolgáltatásról, illetve a szolgáltatás biztosítására szolgáló szerverekről;\nf. próbál illetéktelenül hozzáférni a szolgáltatás biztosítására használt szervekre küldött vagy arról érkező adatátviteli tartalmakhoz, továbbá nem avatkozik az adatátvitelbe, illetve nem dekódolja az átvitt tartalmakat;\ng. kapcsolódik \"társközi\" fájlmegosztó hálózatokhoz, nem tölt le nagy fájlokat, illetve nem működtet olyan programokat, szolgáltatásokat, rendszereket vagy kiszolgálókat, amelyek lényegesen rontják a hálózati teljesítményt vagy elérhetőséget;\nh. használja a szolgáltatást olyan anyagok átvitelére, küldésére, feltöltésére, fogadására, letöltésére, közzétételére, posztolására, elosztására, terjesztésére, illetve nem bátorít vagy kér bármely olyan anyag fogadására, amely sértő, rágalmazó, zaklató, trágár, goromba, obszcén, fenyegető, rasszista, pornográf, ijesztő, törvénytelen vagy valaki személyiségi jogát sérti;\ni. használja ezt a szolgáltatást olyan elektronikus anyagok, mint vírusok, kártevő szoftverek, trójai programok, férgek vagy időzített vírusok átvitelére, tárolására, közzétételére vagy feltöltésére, amelyek kárt okoznak vagy okozhatnak, tönkretehetik vagy korlátozhatják egy számítógép, szoftver, hardver, elektronikus vagy távközlési eszköz funkcióit;\nj. szerez jogosulatlan hozzáférést más személyi számítógépéhez, e-mail fiókjához, bankszámlájához, számítógép hálózatához vagy berendezéséhez; továbbá\nk. használja a szolgáltatást más magánéletébe való betolakodásra, illetve nem okozzon bosszúságot, kényelmetlenséget vagy aggodalmat másnak.\n3 Adatvédelem\nTudomásul veszi és elfogadja, hogy a szolgáltatás rögzíti és feldolgozza az engedélyezett eszköz böngészője típusára és/vagy az operációs rendszerére vonatkozó információkat a kért webhely eszközén való hatékonyabb és/vagy testreszabottabb módon való megjelenítése érdekében. Továbbá a Feltételek és kikötések elfogadása után az áruház gyűjti a Wi-Fi szolgáltatáshoz való hozzáféréshez használt engedélyezett eszköz IP- és MAC-címét.\n4 Kiadás és kártalanítás\n4.1 Az áruház nem felelős a szolgáltatás használata következtében, a szolgáltatás késedelmei vagy megszakadásai miatti adatvesztésért, illetve bármely veszteségért vagy kárért.\n4.2 Felmenti és mentesíti az áruházat a szolgáltatás használatából eredő bármely olyan felelősség alól, beleértve a rágalmazó vagy támadó anyagok vagy a szerzői jog megsértése miatti felelősséget.\n4.3 Elfogadja, hogy biztosítja, védi és mentesíti az áruházat, a munkavállalóit és ügynökeit bármely természetű minden olyan veszteség, kár, felelősség, költség, kiadás (beleértve, de nem korlátozva az ügyvédi költségekre) alól, amely a Feltételek és kikötések Ön általi megsértéséből erednek.",
	"IT": "Siamo lieti di presentare il nostro servizio Wi-Fi (\"Servizio\"). Accedendo a questo Servizio e utilizzandolo, l’Utente dichiara e conferma di possedere l’età legale richiesta, di avere letto e accettato i vincoli previsti dai presenti termini e condizioni.\n1 Accesso al Servizio\n1.1 Il Servizio è fornito dallo store (\"Store\") e destinato all’uso personale. Lo Store si riserva il diritto di modificare o terminare il Servizio, oppure di modificare questi Termini e condizioni in qualsiasi momento. Ogni volta che l’Utente utilizza il Servizio, dovrebbe consultare di nuovo i Termini e condizioni.\n1.2 L’accesso al Servizio potrebbe essere bloccato, sospeso o terminato in qualsiasi momento, per qualsiasi motivo, ad esempio in caso di violazione dei Termini e condizioni o delle leggi applicabili.\n1.3 Lo Store non garantisce alcuna disponibilità a Internet, velocità di connessione Internet minime sulla rete, né garantisce che il servizio sia sempre stabile, senza guasti, tempestivo, affidabile, funzionante o idoneo a supportare l’uso previsto.\n1.4 Lo Store non garantisce la qualità delle informazioni su Internet. È responsabilità dell’Utente verificare la validità, la qualità e la pertinenza delle informazioni ottenute.\n1.5 Il Servizio è fornito su base aperta e pubblica, pertanto lo Store non può garantire la sicurezza del servizio Wi-Fi: questo significa che esistono rischi inerenti alla sicurezza e associati all’utilizzo del Servizio e che, utilizzandolo, l’Utente se ne assume interamente il rischio.\n2 Limitazioni\nL’Utente dichiara di essere consapevole e di accettare la conformità a tutte le leggi vigenti in relazione all’utilizzo del Servizio e di non:\na. utilizzare il Servizio per fini commerciali;\nb. utilizzare il Servizio per inviare e-mail di massa indesiderate;\nc. divulgare o pubblicare informazioni proprietarie o riservate;\nd. violare i diritti di proprietà intellettuale di qualsiasi persona;\ne. raccogliere o raggruppare informazioni o dati dal Servizio o dai server usati per fornire il Servizio;\nf. tentare di intercettare, interferire o decifrare trasmissioni indirizzate o provenienti dai server usati per fornire il Servizio;\ng. collegarsi a reti di condivisione file \"peer-to-peer\", scaricare file di grandi dimensioni o eseguire programmi, servizi, sistemi, processi o server che potrebbero, concretamente, degradare le prestazioni della rete o la sua accessibilità;\nh. utilizzare il Servizio per trasmettere, inviare, caricare, ricevere, scaricare, pubblicare, postare, distribuire, divulgare, incoraggiare o sollecitare la ricezione di qualsiasi materiale di tipo abusivo, diffamatorio, molesto, indecente, offensivo, osceno, minaccioso, razzista, pornografico, insidioso, illegale o che violi i diritti di qualsiasi persona;\ni. utilizzare il Servizio per trasmettere, archiviare, pubblicare o caricare qualsiasi materiale elettronico, come virus, malware, cavalli di Troja, worm o time bomb, che causa, o potrebbe causare, danni, distruzione o limitazioni alla funzionalità di qualsiasi computer, software, hardware, dispositivo elettronico o apparecchiatura per telecomunicazioni;\nj. ottenere accessi non autorizzati a computer, account e-mail, conti bancari, reti o apparecchiature elettroniche di altre persone; oppure\nk. utilizzare il Servizio per invadere la privacy di altre persone o per causare fastidi, disagi o ansia ad altre persone.\n3 Privacy\nL'Utente riconosce e accetta l'acquisizione e l'elaborazione da parte del Servizio di informazioni sul tipo di browser Web e/o sul sistema operativo utilizzato dal dispositivo abilitato, al fine di determinare i mezzi più efficaci e/o personalizzati per la visualizzazione del sito Web richiesto sul dispositivo dell'Utente. Inoltre, lo Store rileverà l'indirizzo IP e MAC del dispositivo abilitato che ha effettuato l'accesso al servizio Wi-Fi, una volta accettati i Termini e condizioni.\n4 Manleva e indennizzo\n4.1 Lo Store non è responsabile per la perdita di dati dovuta a ritardi o interruzioni del servizio o per qualsiasi tipo di perdita o danno eventualmente subiti dall'Utente in seguito all'utilizzo del Servizio.\n4.2 L'Utente esonera il Store da qualsiasi responsabilità che possa derivare dal suo utilizzo del Servizio, inclusa la responsabilità in relazione a materiale diffamatorio o offensivo o a qualsiasi violazione del copyright eventualmente verificatasi.\n4.3 L'Utente accetta di indennizzare, e si impegna a difendere e manlevare, lo Store, i suoi dipendenti e agenti, da e avverso ogni perdita, danno, responsabilità, onere, spesa (incluse, a titolo esemplificativo e non esaustivo, le spese legali), di qualsiasi natura o genere, derivanti dalla violazione dei presenti Termini e condizioni da parte dell'Utente stesso.",
	"JP": "当社の Wi-Fi サービス (以後「本サービス」) へようこそ。あなたは、このサービスへアクセスして利用することによって、自分が法定年齢であるということを表明して認め、そして以下の利用規約を読みかつこれによって拘束されるということを認めたことになります。\n1 本サービスへのアクセス\n1.1 本サービスはあなたの個人的な使用のためにストア (以後「本ストア」) によって提供されます。本ストアは本サービスを変更または終了できる権利、もしくは利用規約をいつでも変更できる権利を持つものとします。あなたは本サービスを使用するときは常にこの利用規約を調べることに責任を持ちます。\n1.2 本サービスへのアクセスが何らかの理由により任意の時点でブロック、一時停止、または終了されることがあります。こうした理由にはこの利用規約や適用法への違反などが含まれますがこれらに限るわけではありません。\n1.3 本ストアはインターネットの可用性や、ネットワーク上の最小インターネット接続速度、あるいは本サービスが安定している、不具合がない、タイムリーである、信頼できる、操作可能、またはあなたが意図した使用に対して適している、といったことについて保証を行いません。\n1.4 本ストアは、インターネットについての情報の品質を保証しません。取得した情報の有効性、品質および関連性について判断することはあなたの責任になります。\n1.5 本サービスはオープンかつパブリックなベースで提供されており、本サービスは Wi-Fi サービスのセキュリティを保証することができません。あなたは本サービスを使用することにはそれに内在するセキュリティ上のリスクがあるということ、および本サービスの使用はすべてあなた自身のリスク負担で行うということを認めこれに同意するものとします。\n2 制限\nあなたは、本サービスを使用する際には、すべての適用法を遵守するということ、および以下を行わないということを認めこれに同意するものとします。\na. 本サービスを商業目的で使用すること。\nb. 大量の迷惑メールを送るために本サービスを使用すること。\nc. 独占的情報や機密情報を明らかにしたり公開したりすること。\nd. 人の知的財産権を侵害すること。\ne. 本サービスまたは本サービスを提供するために使用されるサーバーから情報を収集すること。\nf. 本サービスを提供するために使用されるサーバーからの送信を妨害、干渉、または解読を試みること。\ng. 「ピアツーピア」ファイル共有ネットワークへ接続すること、大容量ファイルをダウンロードすること、あるいはネットワークのパフォーマンスまたはアクセス性を大きく損なう可能性のあるプログラム、サーバー、システム、プロセス、またはサーバーを実行すること。\nh. 悪口、中傷、ハラスメント、不謹慎、攻撃的、わいせつ、威圧、人種差別主義的、ポルノ、脅迫、不法、あるいは人の権利を侵害するような素材の伝達、送信、アップロード、受信、ダウンロード、公開、投稿、配布、配信、奨励、または勧誘をすること。\ni. コンピュータ、ソフトウェア、ハードウェア、電子機器または通信機器に損傷を与えたり、破壊したり、あるいは機能を制限する、もしくはその可能性を持つウィルス、マルウェア、トロイの木馬、ワームあるいは時限爆弾などの電子的素材を送信、保存、公開、またはアップロードするために本サービスを利用すること。\nj. 他の人のコンピュータ、電子メールアカウント、銀行口座、コンピュータ ネットワークあるいは機器に無許可のアクセスを得ること。あるいは\nk. 本サービスを使用して別の人のプライバシーを侵害したり、不快、迷惑、あるいは不安を煽るような行為をすること。\n3 プライバシー\nあなたは本サービスが、有効化されたデバイスによって使用されるウェブ ブラウザのタイプおよび/もしくはオペレーティング システムの情報について、そうしたデバイス上でリクエストされるウェブサイトの表示方法をより効率的および/もしくはよりカスタマイズするための方法を決定するために、その情報を取得して処理するということを認めこれに同意するものとします。また、利用規約に同意がされると同時に、本サービスは Wi-Fi サービスにアクセスした有効化されたデバイスの IP と MAC アドレスを収集します。\n4 免除と免責\n4.1 本ストアは、何らかのサービスの遅延や中断によって生じたデータの紛失について責任を負いませんし、また本サービスの使用の結果あなたが被る可能性のあるいかなる種類の損失や損害についても責任を負いません。\n4.2 あなたは、あなたが本サービスを使用したことから生じたあらゆる責任から本ストアを免除し免責するものとします。これには名誉毀損や攻撃的な内容、あるいは著作権の侵害などから生じた責任が含まれます。\n4.3 あなたは、あなたがこの利用規約に違反したことから生じたあらゆる性質または種類のすべての損失、損害、責任、手数料、経費 (弁護士費用を含みますが、これらに限るわけではありません) から本ストア、その従業員、およびエージェントを免責し、防御し、そして無害に保たなければなりません。",
	"KR": "Wi-Fi 서비스(이하 \"서비스\")에 오신 것을 환영합니다. 본 서비스에 액세스하여 이용할 경우, 본인이 법정 연령이고 다음의 사용약관을 읽었으며, 이에 구속됨을 동의함을 나타내고 인정하는 것입니다.\n1 서비스 액세스\n1.1 본 서비스는 개인적인 용도로 사용하기 위해 스토어(이하 \"스토어\")에서 제공됩니다. 스토어는 언제든지 서비스를 변경하고 해지하거나 사용약관을 변경할 권리를 보유합니다. 귀하는 서비스를 이용할 때마다 본 사용약관을 확인할 책임이 있습니다.\n1.2 본 사용약관 또는 적용되는 법률의 위반을 포함하여(이에 국한되지 않음) 특정 이유로 언제든지 서비스 액세스가 차단, 일시 중지 또는 해지될 수 있습니다.\n1.3 스토어는 네트워크에서 인터넷 가용성, 최소 인터넷 연결 속도를 보장하지 않으며, 서비스가 안정적이고, 결함이 없으며, 적시에 안정적으로 작동하거나 사용자가 의도한 용도를 지원하는 데 적합함을 보장하지 않습니다.\n1.4 스토어는 인터넷상에서 정보의 품질을 보장하지 않습니다. 입수한 정보의 유효성, 품질, 관련성을 결정할 책임은 사용자 본인에게 있습니다.\n1.5 본 서비스는 공개적으로 제공되며, 스토어는 Wi-Fi 서비스의 보안을 보장할 수 없습니다. 따라서 귀하는 서비스 이용과 관련한 고유의 보안 위험이 존재하며, 그러한 위험을 감수하고 서비스를 이용함을 인정하고 동의합니다.\n2 제한\n귀하는 서비스를 이용할 때 적용되는 모든 법률을 준수하고, 다음과 같은 행동을 하지 않음을 인정하고 동의합니다.\na. 상업적인 목적으로 서비스를 이용하는 행위\nb. 서비스를 이용해 원치 않는 벌크 이메일을 보내는 행위\nc. 독점 또는 기밀 정보를 공개하거나 게시하는 행위\nd. 다른 사람의 지적재산권을 침해하는 행위\ne. 서비스 또는 서비스를 제공하는 데 사용되는 서버로부터 정보나 데이터를 수집하거나 모으는 행위\nf. 서비스를 제공하는 데 사용되는 서버에서 이루어지는 전송을 가로채고 방해하거나 암호 해독을 시도\ng. \"피어투피어\" 파일 공유 네트워크에 연결, 대용량 파일 다운로드 또는 네트워크 성능이나 접근성을 상당히 저하시킬 수 있는 프로그램, 서비스, 시스템, 프로세스, 서비스를 실행하는 행위\nh. 서비스를 이용해 모욕적, 비방적, 괴롭히거나, 외설적, 공격적, 음란, 협박적, 인종차별적, 포르노, 위협적, 불법적 또는 타인의 권리를 침해하는 자료를 전달, 전송, 업로드, 수신, 다운로드, 발행, 게시, 배급, 유포하고 그러한 행위를 조장하거나 수신을 요청하는 행위\ni. 서비스를 이용해 바이러스, 멀웨어, 트로이목마, 웜, 시한폭탄과 같이 컴퓨터, 소프트웨어, 하드웨어, 전자기기 또는 텔레커뮤니케이션 장비나 그 기능을 손상, 파괴 또는 제한할 수 있는 전자 자료를 전달, 저장, 게시 또는 업로드하는 행위\nj. 타인의 컴퓨터, 이메일 계정, 은행 계좌, 컴퓨터 네트워크 또는 장비에 대한 무단 접근을 확보하는 행위\nk. 서비스를 이용해 타인의 프라이버시를 침해하거나 다른 사람에게 문제, 불편 또는 불안을 일으키는 행위\n3 개인정보 보호\n귀하는 본인의 기기에 요청된 웹사이트를 원하는 방식대로 또는 보다 효과적으로 표시할 수 있는 방식을 결정하기 위해 본 서비스가 활성화된 기기에서 사용되는 웹 브라우저 유형 및/또는 운영 체제 정보에 관한 정보를 캡처하여 처리함을 인정하고 동의합니다. 그리고 스토어는 사용약관에 동의했으면 Wi-Fi 서비스에 액세스한 활성화된 기기의 IP 및 MAC 주소를 수집합니다.\n4 면책 및 배상\n4.1 스토어는 서비스 지연이나 중단으로 인한 데이터 손실 또는 본 서비스의 이용으로 인해 발생할 수 있는 손실이나 손해에 대해 책임을 지지 않습니다.\n4.2 귀하는 비방하거나 공격적인 자료 또는 저작권 위반과 관련한 책임을 포함하여 서비스 이용으로 인해 발생할 수 있는 문제로부터 스토어의 책임을 면제합니다.\n4.3 귀하는 이러한 사용약관의 위반으로 인해 발생할 수 있는 모든 종류의 손실, 손해, 책임, 비용, 지출(변호사 수임료를 포함하되 이에 국한되지 않음)로부터 스토어, 해당 직원과 대리인을 면책하고 해를 끼치지 않음에 동의합니다.",
	"MS": "",
	"NL": "Welkom bij onze Wi-Fi-service (de \"Service\"). Door verbinding te maken en deze Service te gebruiken, verklaart u dat u meerderjarig bent en dat u de volgende voorwaarden hebt gelezen en ermee akkoord gaat:\n1 Toegang tot de Service\n1.1 De Service wordt geleverd door de winkel (de \"Winkel\") voor uw persoonlijk gebruik. De Winkel behoudt zich het recht voor om de Service of deze Algemene Voorwaarden op elk moment te wijzigen of te beëindigen. U bent ervoor verantwoordelijk om deze Algemene voorwaarden te lezen telkens wanneer u de Service gebruikt.\n1.2 De toegang tot de Service kan o.a. door schending van de Algemene Voorwaarden of toepasselijke wetgeving worden geblokkeerd, opgeschort of beëindigd.\n1.3 De Winkel biedt geen garantie voor de beschikbaarheid van het internet, de minimale internetverbindingssnelheden op het netwerk, een stabiele, storingsvrije, tijdige, betrouwbare, operationele Service of de geschiktheid voor uw beoogde gebruik.\n1.4 De Winkel biedt geen garantie voor de kwaliteit van de informatie op het internet. Het is uw verantwoordelijkheid om de validiteit, kwaliteit en relevantie van de verkregen informatie te bepalen.\n1.5 De Service wordt geleverd op een open en openbare basis en de Winkel kan de veiligheid van de Wi-Fi-service niet garanderen. U erkent en stemt ermee in dat er inherente veiligheidsrisico's verbonden zijn aan het gebruik van de Service en dat u dit uitsluitend op eigen risico doet.\n2 Beperkingen\nU erkent en stemt ermee in dat u bij het gebruik van de Service alle toepasselijke wetten zult naleven en:\na. de Service niet zult gebruiken voor commerciële doeleinden;\nb. de Service niet zult gebruiken om ongevraagde bulk-e-mails te verzenden;\nc. de Service niet zult gebruiken om eigendoms- of vertrouwelijke informatie te onthullen of te publiceren;\nd. geen inbreuk zult doen op de intellectuele eigendomsrechten van een persoon;\ne. geen informatie of gegevens van de Service of voor de Service gebruikte servers zult verzamelen;\nf. de overdrachten van de Service-servers niet zult proberen te onderscheppen, te verstoren of te ontcijferen;\ng. geen verbinding zult maken met \"peer-to-peer\"-netwerken voor het delen van bestanden, grote bestanden te downloaden of programma's, services, systemen, processen of servers zult uitvoeren die de netwerkprestaties of toegankelijkheid aanzienlijk kunnen verminderen;\nh. de Service zult gebruiken voor het overdragen, verzenden, uploaden, ontvangen, downloaden, publiceren, posten, distribueren, verspreiden, aanmoedigen of aanvragen van materiaal dat beledigend, lasterlijk, intimiderend, onfatsoenlijk, aanstootgevend, obsceen, bedreigend, racistisch, pornografisch, bedreigend, onwettig is of in strijd is met enig recht van een persoon;\ni. de Service niet zult gebruiken om elektronisch materiaal, zoals virussen, malware, trojaanse paarden, wormen of tijdbommen, te verzenden, op te slaan, te publiceren of te uploaden, die schade zullen toebrengen of waarschijnlijk zullen veroorzaken aan de functionaliteit van computers, software, hardware, elektronische apparaten of telecommunicatieapparatuur;\nj. geen ongeoorloofde toegang zult verkrijgen tot de computer, e-mailaccount, bankrekening, computernetwerk of apparatuur van een andere persoon; of\nk. de Service zult gebruiken om inbreuk te doen op de privacy van een andere persoon of om ergernis, ongemak of angst bij een andere persoon te veroorzaken.\n3 Privacy\nU erkent en stemt ermee in dat de Service informatie verkrijgt en verwerkt over het type webbrowser en/of besturingssysteem dat het ingeschakelde apparaat gebruikt om de weergaveprestaties van de opgevraagde website op uw apparaat te verbeteren. En dat na akkoord met de Algemene Voorwaarden de Winkel het IP- en MAC-adres van het ingeschakelde apparaat dat via de Wi-Fi-service toegang maakt zal worden verzameld.\n4 Vrijlating en vrijwaring\n4.1 De Winkel is niet aansprakelijk voor verlies van gegevens als gevolg van vertragingen of onderbrekingen van de service of enige vorm van geleden verlies of schade als gevolg van het gebruik van de Service.\n4.2 U vrijwaart en ontheft de Winkel van elke aansprakelijkheid die uit het gebruik van de Service kan voortvloeien, inclusief de aansprakelijkheid met betrekking tot lasterlijk of aanstootgevend materiaal of enige inbreuk op het auteursrecht.\n4.3 U stemt ermee in om de Winkel, zijn werknemers en agenten te vrijwaren en te verdedigen tegen alle verlies, schade, aansprakelijkheid, kosten, uitgaven (inclusief maar niet beperkt tot advocaatkosten) van welke aard dan ook die voortvloeien uit uw schending van deze Algemene Voorwaarden.",
	"NO": "Velkommen til wifi-tjenesten vår («tjenesten»). Ved å oppnå tilgang til og bruke denne tjenesten erklærer og anerkjenner du at du er av myndig alder og har lest og godtar å være bundet av følgende betingelser:\n1 Tilgang til tjenesten\n1.1 Tjenesten leveres av butikken («butikken») til din private bruk. Butikken forbeholder seg retten til når som helst å endre eller avslutte tjenesten eller endre disse betingelsene. Du er ansvarlig for å lese gjennom disse betingelsene hver gang du bruker tjenesten.\n1.2 Tilgangen til tjenesten kan når som helst og av hvilken som helst årsak bli blokkert, suspendert eller avsluttet, inkludert, men ikke begrenset til, hvis du bryter disse betingelsene eller gjeldende rett.\n1.3 Butikken gir ingen garantier når det gjelder Internett-tilgang, minimum Internett-hastighet på nettverket eller hvorvidt tjenesten er stabil, feilfri, presis, pålitelig, driftssikker eller egnet til ditt tiltenkte bruksområde.\n1.4 Butikken gir ingen garantier angående informasjonskvaliteten på Internett. Det er ditt ansvar å avgjøre om informasjonen er gyldig, av god kvalitet og relevant.\n1.5 Tjenesten leveres på åpen og offentlig basis, og butikken kan ikke gi noen garantier angående wifi-tjenestens sikkerhet. Du anerkjenner og godtar at det finnes iboende sikkerhetsrisikoer tilknyttet bruk av tjenesten, og at du bruker tjenesten utelukkende på egen risiko.\n2 Begrensninger\nDu anerkjenner og godtar at du skal overholde alle gjeldende lover når du bruker tjenesten, og at du ikke skal\na. bruke tjenesten til kommersielle formål\nb. bruke tjenesten til å sende uoppfordrede masse-e-poster\nc. utlevere eller publisere opphavsrettsbeskyttet eller konfidensiell informasjon\nd. krenke andres immaterielle rettigheter\ne. samle inn eller høste informasjon eller data fra tjenesten eller serverne som brukes til å levere tjenesten\nf. forsøke å avskjære, forstyrre eller dechiffrere overføringer til eller fra serverne som brukes til å levere tjenesten\ng. koble til P2P-fildelingsnettverk, laste ned store filer eller kjøre programmer, tjenester, systemer, prosesser eller servere som betraktelig forringer nettverksytelsen eller -tilgjengeligheten\nh. bruke tjenesten til å overføre, sende, laste opp, motta, laste ned, publisere, legge ut, distribuere, spre, oppfordre til eller be om å motta materiale som anses som misbruk, ærekrenkende, trakasserende, upassende, støtende, obskønt, truende, rasistisk, pornografisk, ulovlig eller rettighetskrenkende\ni. bruke tjenesten til å overføre, lagre, publisere eller laste opp elektronisk materiale, f.eks. virus, skadelig programvare, trojanske hester, ormer eller tidsbomber, som vil eller trolig vil skade, ødelegge eller begrense funksjonen til enhver datamaskin, programvare, maskinvare, elektroniske enhet eller telekomenhet\nj. skaffe deg uautorisert tilgang til enhver persons datamaskin, e-postkonto, bankkonto, datamaskinnettverk eller utstyr\nk. bruke tjenesten til å invadere andres personvern eller påføre andre irritasjon, bryderi eller angst\n3 Personvern\nDu anerkjenner og godtar at tjenesten registrerer og behandler informasjon om nettlesertype og/eller informasjon om operativsystemet som brukes av den aktiverte enheten, for å kunne fastslå mer effektive og/eller tilpassede metoder for å vise det forespurte nettstedet på enheten din. Butikken samler også inn IP- og MAC-adressene til aktiverte enheter som har oppnådd tilgang til wifi-tjenesten, når betingelsene har blitt godtatt.\n4 Fraskrivelse og skadesløsholdelse\n4.1 Butikken er ikke ansvarlig for tap av data som følge av tjenesteforsinkelser eller -avbrudd eller andre typer skader du pådrar deg som resultat av din bruk av tjenesten.\n4.2 Du frigir og løser butikken fra alt ansvar i forbindelse med din bruk av tjenesten, deriblant ansvar i forbindelse med ærekrenkende eller støtende materiale eller eventuelle krenkelser av opphavsrett.\n4.3 Du godtar å forsvare og holde butikken og dens ansatte og representanter skadesløs mot alle typer tap, skader, ansvar, pålegg og utgifter (inkludert, men ikke begrenset til advokathonorarer) som oppstår som følge av at du bryter disse betingelsene.",
	"PL": "Witaj w naszej usłudze Wi-Fi (\"Usługa\"). Uzyskując dostęp do tej Usługi i korzystając z niej, użytkownik oświadcza i potwierdza, że jest pełnoletni oraz że przeczytał i akceptuje poniższe warunki:\n1 Uzyskiwanie dostępu do Usługi\n1.1 Usługa jest świadczona przez sklep (\"Sklep\") do osobistego użytku przez użytkownika. Sklep zastrzega sobie prawo do zmiany lub zakończenia świadczenia Usługi albo zmiany niniejszego Regulaminu w dowolnym momencie. Użytkownik jest odpowiedzialny za zapoznanie się z niniejszym Regulaminem za każdym razem, gdy korzysta z Usługi.\n1.2 Dostęp do Usługi może zostać zablokowany, zawieszony lub zakończony w dowolnym momencie z dowolnego powodu, w tym między innymi z powodu naruszenia przez użytkownika niniejszego Regulaminu lub obowiązujących przepisów prawa.\n1.3 Sklep nie gwarantuje dostępności do Internetu, minimalnej szybkości połączenia internetowego w sieci ani tego, że Usługa będzie stabilna, bezawaryjna, terminowa, niezawodna, sprawna lub odpowiednia do obsługi zamierzonego przez użytkownika użytkowania.\n1.4 Sklep nie gwarantuje jakości informacji znajdujących się w Internecie. Obowiązkiem użytkownika jest określenie ważności, jakości i przydatności uzyskanych informacji.\n1.5 Usługa jest świadczona w sposób otwarty i publiczny, a Sklep nie może zagwarantować bezpieczeństwa usługi Wi-Fi. Użytkownik przyjmuje do wiadomości i zgadza się, że korzystanie z Usługi wiąże się z nieodłącznym ryzykiem w zakresie bezpieczeństwa i że robi to wyłącznie na własne ryzyko.\n2 Ograniczenia\nUżytkownik przyjmuje do wiadomości i zgadza się, że podczas korzystania z Usługi będzie przestrzegać wszystkich obowiązujących przepisów prawa i że nie będzie:\na. korzystać z Usługi w celach komercyjnych;\nb. korzystać z Usługi w celu wysyłania niechcianych masowych wiadomości e-mail;\nc. ujawniać lub publikować informacji zastrzeżonych lub poufnych;\nd. naruszać praw własności intelektualnej jakiejkolwiek osoby;\ne. zbierać lub gromadzić jakichkolwiek informacji lub danych z Usługi albo serwerów wykorzystywanych do świadczenia Usługi;\nf. podejmować prób przechwytywania, ingerowania lub odszyfrowywania jakiejkolwiek transmisji do lub z serwerów wykorzystywanych do świadczenia Usługi;\ng. łączyć się z sieciami bezpośredniej wymiany plików, pobierać dużych plików ani uruchamiać żadnych programów, usług, systemów, procesów lub serwerów, które mogą znacznie obniżyć wydajność lub dostępność sieci;\nh. korzystać z Usługi w celu przekazywania, wysyłania, przesyłania, odbierania, pobierania, publikowania, zamieszczania, rozpowszechniania, dystrybuowania, zachęcania lub nakłaniania do odbioru jakichkolwiek materiałów, które są obraźliwe, zniesławiające, napastliwe, nieprzyzwoite, obsceniczne, groźne, rasistowskie, pornograficzne, zawierające groźby, niezgodne z prawem lub naruszające jakiekolwiek prawa jakiejkolwiek osoby;\ni. korzystać z Usługi w celu przesyłania, przechowywania, publikowania lub wgrywania jakichkolwiek materiałów elektronicznych, takich jak wirusy, złośliwe oprogramowanie, konie trojańskie, robaki lub bomby zegarowe, które spowodują lub mogą spowodować uszkodzenie, zniszczenie lub ograniczenie funkcjonalności jakiegokolwiek komputera, oprogramowania, sprzętu, urządzenia elektronicznego lub sprzętu telekomunikacyjnego;\nj. uzyskiwać nieautoryzowanego dostępu do komputera, konta e-mail, konta bankowego, sieci komputerowej lub sprzętu innej osoby; lub\nk. korzystać z Usługi w celu naruszenia prywatności innej osoby lub spowodowania irytacji, niedogodności lub niepokoju innej osoby.\n3 Prywatność\nUżytkownik przyjmuje do wiadomości i zgadza się, że Usługa będzie przechwytywać i przetwarzać informacje o typie przeglądarki internetowej i/lub informacje o systemie operacyjnym używanym przez włączone urządzenie w celu określenia bardziej efektywnych i/lub spersonalizowanych sposobów wyświetlania żądanej strony internetowej na urządzeniu użytkownika. Ponadto po zaakceptowaniu Regulaminu Sklep będzie gromadzić adres IP i adres MAC włączonego urządzenia, które uzyskało dostęp do usługi Wi-Fi.\n4 Zwolnienie z odpowiedzialności\n4.1 Sklep nie ponosi odpowiedzialności za utratę danych spowodowaną opóźnieniami lub przerwami w świadczeniu usług ani za jakiekolwiek straty lub szkody, które użytkownik może ponieść w wyniku korzystania z Usługi.\n4.2 Użytkownik zwalnia Sklep z wszelkiej odpowiedzialności, która może wynikać z korzystania przez niego z Usługi, w tym odpowiedzialności związanej z materiałami zniesławiającymi lub obraźliwymi lub jakimkolwiek naruszeniem praw autorskich, które może mieć miejsce.\n4.3 Użytkownik zgadza się zwolnić Sklep, jego pracowników i agentów z odpowiedzialności oraz chronić ich przed wszelkimi stratami, szkodami, odpowiedzialnością, opłatami, wydatkami (w tym między innymi kosztami obsługi prawnej) jakiegokolwiek rodzaju wynikającymi z naruszenia przez użytkownika niniejszego Regulaminu.",
	"RO": "Bun venit la serviciul nostru Wi-Fi (\"Serviciul\"). Prin accesarea și utilizarea acestui Serviciu, declarați și confirmați că aveți vârsta legală și că ați citit și sunteți de acord să respectați următorii termeni și condiții:\n1 Accesarea Serviciului\n1.1 Serviciul este furnizat de magazin (\"Magazinul\") pentru uz personal. Magazinul își rezervă dreptul de a modifica sau de a rezilia Serviciul sau de a modifica acești Termeni și condiții în orice moment. Sunteți responsabil pentru cunoașterea acestor Termeni și condiții de fiecare dată când utilizați Serviciul.\n1.2 Accesul la Serviciu poate fi blocat, suspendat sau reziliat în orice moment din orice motiv, inclusiv, dar fără a se limita la încălcarea de către dvs. a acestor Termeni și condiții sau a legilor aplicabile.\n1.3 Magazinul nu garantează disponibilitatea conexiunii la Internet, viteza minimă a conexiunii la Internet în rețea sau că Serviciul va fi stabil, fără erori, la timp, fiabil, operațional sau adecvat pentru a vă oferi utilizarea dorită.\n1.4 Magazinul nu garantează calitatea informațiilor de pe Internet. Este responsabilitatea dvs. să determinați validitatea, calitatea și relevanța informațiilor obținute.\n1.5 Serviciul este furnizat în mod deschis și public, iar Magazinul nu poate garanta securitatea serviciului Wi-Fi, recunoașteți și sunteți de acord că există riscuri inerente de securitate asociate cu utilizarea Serviciului și că faceți acest lucru exclusiv pe propriul risc.\n2 Restricţii\nConfirmați și sunteți de acord că atunci când utilizați Serviciul, veți respecta toate legile aplicabile și că nu veți:\na. utiliza Serviciul în scopuri comerciale;\nb. utiliza Serviciul pentru a trimite e-mailuri în masă nesolicitate;\nc. dezvălui sau publica informații confidențiale sau de proprietate;\nd. încălca drepturile de proprietate intelectuală ale oricărei persoane;\ne. colecta sau culege informații sau date de la Serviciu sau de la serverele utilizate pentru furnizarea Serviciului;\nf. încerca să interceptați, să interferați sau să descifrați orice transmisie către sau de la serverele utilizate pentru a furniza Serviciul;\ng. conecta la rețelele de partajare a fișierelor \"Peer to Peer\", descărca fișiere mari sau rula programe, servicii, sisteme, procese sau servere care pot degrada substanțial performanța sau accesibilitatea rețelei;\nh. utiliza Serviciul pentru a transmite, trimite, încărca, primi, descărca, publica, posta, distribui, difuza, încuraja sau solicita primirea oricărui material care este abuziv, defăimător, hărțuitor, indecent, ofensator, obscen, amenințător, rasist, pornografic, ilegal sau care încalcă orice drept al oricărei persoane;\ni. utiliza Serviciul pentru a transmite, stoca, publica sau încărca orice material electronic, cum ar fi viruși, malware, troieni, viermi sau bombe cu ceas, care vor provoca sau sunt susceptibile de a provoca daune sau de a distruge sau limita funcționalitatea oricărui computer, software, hardware, dispozitiv electronic sau echipament de telecomunicații;\nj. obține acces neautorizat la computerul, contul de e-mail, contul bancar, rețeaua de calculatoare sau echipamentul altei persoane; sau\nk. utiliza Serviciul pentru a încălca confidențialitatea unei alte persoane sau pentru a provoca neplăceri, inconveniente sau anxietate altei persoane.\n3 Confidențialitate\nConfirmați și sunteți de acord ca Serviciul să poată captura și procesa informații despre tipul de browser web și/sau informații despre sistemul de operare utilizat de dispozitivul activat pentru a determina mijloace mai eficiente și/sau personalizate de afișare a site-ului web solicitat pe dispozitivul dvs. Iar Magazinul va colecta adresa IP și MAC a dispozitivului activat care a accesat serviciul Wi-Fi, odată ce Termenii și condițiile au fost acceptate.\n4 Eliberare și despăgubire\n4.1 Magazinul nu este răspunzător pentru pierderea datelor din cauza întârzierilor sau întreruperilor serviciului sau a oricărui fel de pierderi sau daune pe care le puteți suferi ca urmare a utilizării Serviciului.\n4.2 Eliberați și exonerați Magazinul de orice răspundere care ar putea apărea din utilizarea de către dvs. a Serviciului, inclusiv răspunderea în legătură cu materiale defăimătoare sau ofensatoare sau orice încălcare a drepturilor de autor care ar putea apărea.\n4.3 Sunteți de acord să despăgubiți și trebuie să apărați și să exonerați de răspundere Magazinul, angajații și agenții săi pentru și împotriva tuturor pierderilor, daunelor, răspunderii, taxelor, cheltuielilor (inclusiv, dar fără a se limita la onorariile avocaților) de orice natură sau de orice fel care decurg din încălcarea de către dvs. a acestor Termeni și condiții.",
	"RU": "Добро пожаловать в сервис Wi-Fi (далее \"Сервис\"). Обращаясь к данному Сервису и используя его, вы подтверждаете, что достигли совершеннолетнего возраста, а также ознакомились и согласны со следующими условиями:\n1 Доступ к Сервису\n1.1 Данный Сервис предоставляется магазином (далее \"Магазин\") для личного использования. Магазин оставляет за собой право в любой момент прекратить работу Сервиса, а также изменить настоящие Условия. Вы несете ответственность за своевременное ознакомление с Условиями при каждом пользовании Сервисом.\n1.2 Доступ к Сервису может быть заблокирован, приостановлен или прекращен в любое время и по любой причине, включая, но не ограничиваясь случаями нарушения настоящих Условий или применимых законов.\n1.3 Магазин не предоставляет гарантии доступности Интернета, минимальной скорости Интернет-соединения в сети, а также не гарантирует стабильность работы Сервиса, отсутствие сбоев, своевременность, надежность или соответствие его вашим потребностям.\n1.4 Магазин не отвечает за качество информации в Интернете. Определение надежности, качества и соответствия найденной информации является вашей единоличной ответственностью.\n1.5 Сервис предоставляется на открытой и общедоступной основе. Магазин не гарантирует безопасность сервиса Wi-Fi; вы подтверждаете, что понимаете связанные риски безопасности и принимаете их при использовании Сервиса исключительно под свою собственную ответственность.\n2 Ограничения\nВы подтверждаете и соглашаетесь с тем, что при использовании Сервиса вы будете следовать всем применимым законам и не будете:\na. пользоваться Сервисом в коммерческим целях;\nb. использовать Сервис для отправки несанкционированных сообщений с рекламой товаров или услуг по электронной почте;\nc. разглашать или публиковать информацию частного и конфиденциального характера;\nd. нарушать принадлежащие другим лицам права на интеллектуальную собственность;\ne. осуществлять сбор какой бы то ни было информации или данных из данного Сервиса или с серверов, использующихся для его предоставления;\nf. предпринимать попытки перехвата, прерывания или расшифровки информации, которая передается между серверами, использующимися для предоставления Сервиса;\ng. подключаться к пиринговым файлообменным сетям, загружать большие по размеру файлы, а также запускать любые другие программы, службы, системы, процессы или серверы, которые могут значительно снизить производительность сети или ее доступность;\nh. использовать Сервис в целях передачи, отправки, выгрузки, получения, загрузки, публикации, размещения, раздачи, распространения или содействия в получении каких бы то ни было материалов, являющихся оскорбительными, клеветническими, притесняющими, агрессивными, нецензурными, унизительными, расистскими, порнографическими, содержащих угрозы, противоречащих законодательным требованиям или нарушающих права человека;\ni. использовать Сервис в целях передачи, хранения, публикации или выгрузки каких бы то ни было электронных материалов, таких как вирусы, вредоносное ПО, троянские программы, программы-черви, вирусы с часовым механизмом, которые нанесут или с высокой долей вероятности могут нанести вред, или приведут к уничтожению, или ограничат функциональность компьютера, программного обеспечения, аппаратных средств, электронного устройства или телекоммуникационного оборудования;\nj. предпринимать попытки несанкционированного доступа к компьютерам, учетным записям электронной почты, банковским счетам, компьютерным сетям или оборудованию других лиц;\nk. пользоваться Сервисом в целях нарушения частной жизни других лиц, а также доставлять другим лицам неудобство и дискомфорт.\n3 Конфиденциальность\nВы признаете и соглашаетесь с тем, что Сервисом будет осуществляться сбор и обработка информации, касающейся типа веб-браузера и/или операционной системы, который используется на подключенном устройстве, для определения наиболее эффективного и/или адаптированного способа отображения веб-сайта на вашем устройстве. Магазин будет выполнять сбор IP- и MAC-адресов подключенного устройства, с которого осуществляется доступ к сервису Wi-Fi, после того, как вы примите Условия использования.\n4 Освобождение от ответственности и возмещение убытков\n4.1 Магазин не несет ответственности за потерю данных из-за задержек или прерываний в работе сервиса, а также за любые убытки или повреждения, которые возникли в результате использования Сервиса.\n4.2 Вы освобождаете Магазин от любых обязательств, которые могут возникнуть вследствие использования Сервиса, включая обязательства, связанные с распространением клеветнических или оскорбительных материалов, а также нарушением авторских прав.\n4.3 Вы соглашаетесь обеспечить освобождение от ответственности, защиту и непричинение ущерба Магазину, его сотрудникам и агентам, в отношении любого рода убытков, повреждений, затрат, расходов и сборов (включая оплату юридических услуг), возникших в связи с нарушением настоящих Условий.",
	"SL": "Dobrodošli v naši storitvi Wi-Fi (»storitev«). Z dostopom do te storitve in njeno uporabo izjavljate in potrjujete, da ste polnoletni in da ste prebrali naslednje določbe in pogoje ter soglašate, da vas zavezujejo:\n1 Dostop do storitve\n1.1 Storitev zagotavlja trgovina (»trgovina«) za vašo osebno uporabo. Trgovina si pridržuje pravico kadar koli spremeniti ali odpovedati storitev oziroma spremeniti te določbe in pogoje. Vaša odgovornost je, da pri vsaki uporabi storitve pregledate te določbe in pogoje.\n1.2 Dostop do storitve je lahko kadar koli blokiran, začasno ustavljen ali prekinjen zaradi kakršnega koli razloga, kar vključuje tudi kršitev teh določb in pogojev ali veljavne zakonodaje, vendar ni omejeno nanjo.\n1.3 Trgovina ne jamči za razpoložljivost v internetu, najnižje hitrosti internetne povezave v omrežju ali da bo storitev stabilna, brez napak, pravočasna, zanesljiva, delujoča ali primerna za podporo vaši nameravani uporabi.\n1.4 Trgovina ne jamči za kakovost informacij v internetu. Vaša odgovornost je, da določite veljavnost, kakovost in ustreznost pridobljenih informacij.\n1.5 Storitev je zagotovljena na odprti in javni osnovi in trgovina ne more jamčiti za varnost storitve Wi-Fi, zato potrjujete in soglašate, da so z uporabo storitve povezana varnostna tveganja in da jo uporabljate izključno na lastno odgovornost.\n2 Omejitve\nPotrjujete in soglašate, da boste pri uporabi storitve spoštovali vso veljavno zakonodajo in ne boste:\na. uporabljali storitve za komercialne namene;\nb. uporabljali storitve za pošiljanje neželenih masovnih e-poštnih sporočil;\nc. razkrivali ali objavljali lastniških ali zaupnih informacij;\nd. kršili pravic intelektualne lastnine katere koli osebe;\ne. zbirali ali pridobivali informacij ali podatkov iz storitve ali strežnikov, ki zagotavljajo storitev;\nf. poskušali prestrezati, motiti ali dešifrirati katerega koli prenosa na strežnike ali s strežnikov, ki zagotavljajo storitev;\ng. vzpostavljali povezave z enakovrednimi omrežji za skupno rabo datotek, prenašali velikih datotek ali izvajali katerih koli programov, storitev, sistemov, procesov ali strežnikov, ki lahko bistveno poslabšajo delovanje ali dostopnost omrežja;\nh. uporabljali storitve za oddajanje, pošiljanje, nalaganje, prejemanje, prenašanje, izdajanje, objavljanje, distribuiranje, razširjanje, spodbujanje ali nagovarjanje k sprejemanju kakršne koli vsebine, ki je nasilna, obrekljiva, žaljiva, nespodobna, napadalna, opolzka, nevarna, rasistična, pornografska, grozilna, nezakonita ali ki krši kakršne koli pravice katere koli osebe;\ni. uporabljali storitve za prenašanje, shranjevanje, objavljanje ali nalaganje kakršne koli elektronske vsebine, kot so virusi, zlonamerna programska oprema, trojanski konji, črvi ali časovne bombe, ki lahko ali ki bo po vsej verjetnosti povzročila škodo ali uničenje oziroma omejila delovanje katerega koli računalnika, programske opreme, strojne opreme, elektronske naprave ali telekomunikacijske opreme;\nj. pridobili nepooblaščenega dostopa do računalnika, e-poštnega računa, bančnega računa, računalniškega omrežja ali opreme katere koli druge osebe; ali\nk. uporabili storitve za vdor v zasebnost druge osebe ali za motenje, nadlegovanje ali povzročanje bojazni tej drugi osebi.\n3 Zasebnost\nPotrjujete in se strinjate, da bo storitev zajemala in obdelovala informacije o tipu spletnega brskalnika in/ali informacije o operacijskem sistemu, ki jih uporablja omogočena naprava, da lahko določi učinkovitejše in/ali prilagojene načine prikazovanja zahtevanega spletnega mesta v vaši napravi. Ko boste potrdili svoje soglasje z določbami in pogoji, bo trgovina zbrala naslova IP in MAC omogočene naprave, ki je dostopila do storitve Wi-Fi.\n4 Oprostitev in odškodovanje\n4.1 Trgovina ni odgovorna za izgubo podatkov zaradi zakasnitev ali prekinitev storitve ali za kakršno koli izgubo ali škodo, ki jo lahko utrpite med uporabo storitve.\n4.2 Trgovino oproščate in razrešujte kakršne koli odgovornosti, ki bi lahko nastala zaradi vaše uporabe storitve, vključno z odgovornostjo, povezano z obrekljivo ali žaljivo vsebino ali kakršno koli kršitvijo avtorskih pravic, do katerih lahko pride.\n4.3 Strinjate se, da boste trgovino, njene uslužbence in predstavnike odškodovali, branili in odvezali odgovornosti glede vsakršne izgube, škode, obveznosti, stroškov in izdatkov (vključno s plačili stroškov za odvetnike, vendar ni omejeno nanje) kakršne koli narave ali na kakršen koli način nastale zaradi vaše kršitve teh določb in pogojev.",
	"SV": "Välkommen till vår Wi-Fi-tjänst (\"Tjänsten\"). Genom att använda Tjänsten intygar och bekräftar du att du är myndig och att du har läst och samtycker till att vara bunden av följande villkor:\n1 Åtkomst till Tjänsten\n1.1 Tjänsten tillhandahålls av butiken (\"Butiken\") för ditt personliga bruk. Butiken förbehåller sig rätten att när som helst ändra eller avsluta Tjänsten eller ändra dessa Regler och villkor. Du är ansvarig för att granska dessa Regler och villkor varje gång du använder Tjänsten.\n1.2 Åtkomst till Tjänsten kan blockeras, avbrytas eller avslutas när som helst av vilken anledning som helst, inklusive men inte begränsat till din överträdelse av dessa Regler och villkor eller tillämpliga lagar.\n1.3 Butiken garanterar inte tillgång till Internet, den lägsta Internetanslutningshastigheten på nätverket eller att tjänsten är stabil, felfri, läglig, pålitlig, fungerande eller lämplig för din avsedda användning.\n1.4 Butiken garanterar inte kvaliteten på informationen på Internet. Det är ditt ansvar att bestämma giltigheten, kvaliteten och relevansen av den erhållna informationen.\n1.5 Tjänsten tillhandahålls på en öppen och offentlig grundval och butiken kan inte garantera säkerheten för Wi-Fi-tjänsten, du bekräftar och godkänner att din användning av Tjänsten kan medföra risker och att du använder den på enbart egen risk.\n2 Begränsningar\nDu bekräftar och godkänner att när du använder Tjänsten följer du alla tillämpliga lagar och att du inte kommer att;\na. använda Tjänsten för kommersiella ändamål;\nb. använda Tjänsten för att skicka oönskade massutskick;\nc. avslöja eller publicera privat eller konfidentiell information;\nd. kränka någon persons immateriella rättigheter;\ne. samla in eller skörda information eller data från Tjänsten eller de servrar som används för att tillhandahålla Tjänsten;\nf. försöka att fånga upp, störa eller dechiffrera någon överföring till eller från de servrar som används för att tillhandahålla Tjänsten;\ng. ansluta till fildelningsnätverk av typen \"peer-to-peer\", hämta stora filer eller köra program, tjänster, system, processer eller servrar som väsentligt kan försämra nätverkets prestanda eller tillgänglighet;\nh. använda Tjänsten till att överföra, skicka, ladda upp, ta emot, hämta, publicera, göra inlägg, distribuera, sprida, uppmuntra eller begära mottagande av material som är otidigt, ärekränkande, trakasserande, oanständigt, stötande, obscent, hotfullt, rasistiskt, pornografiskt, skrämmande, olagligt eller i strid med någon rättighet för någon person;\ni. använda Tjänsten till att överföra, lagra, publicera eller ladda upp något elektroniskt material, såsom virus, skadlig programvara, trojanska hästar, maskar eller logiska bomber, som kommer eller sannolikt kommer att orsaka skada på eller förstöra eller begränsa funktionaliteten hos någon dator, programvara, hårdvara, elektronisk enhet eller telekommunikationsutrustning;\nj. erhålla obehörig åtkomst till någon annan persons dator, e-postkonto, bankkonto, datornätverk eller utrustning; eller\nk. använda Tjänsten till att göra intrång i en annan persons integritet eller för att orsaka irritation, obehag eller ångest för en annan person.\n3 Sekretess\nDu bekräftar och godkänner att Tjänsten samlar in och behandlar information om webbläsartyp och/eller operativsysteminformation som används av den aktiverade enheten, för att fastställa det mest effektiva och/eller anpassade sättet att visa den begärda webbplatsen på din enhet. Butiken samlar in IP- och MAC-adressen för den aktiverade enheten som har åtkomst till Wi-Fi-tjänsten när väl Regler och villkor har godkänts.\n4 Ansvarsavtal\n4.1 Butiken är inte ansvarig för förlust av data på grund av förseningar eller avbrott i tjänsten eller någon form av förlust eller skador som du kan åsamkas till följd av din användning av Tjänsten.\n4.2 Du håller Butiken fri från allt ansvar som kan uppstå genom din användning av Tjänsten, inklusive ansvar i samband med ärekränkande eller stötande material eller alla former av brott mot upphovsrätten.\n4.3 Du samtycker till att vara ersättningsskyldig och ta Butiken samt dess anställda och ombud i försvar samt hålla dem skadeslösa från och i relation till all förlust, skada, ansvar, debitering, kostnad (inklusive men inte begränsat till advokatkostnader) av som helst slag som uppstår på grund av ditt brott mot dessa villkor.",
	"TH": "ยินดีต้อนรับเข้าสู่บริการ Wi-Fi (ซึ่งต่อไปในที่นี้จะเรียกว่า \"บริการ\") ในการเข้าถึงและใช้บริการนี้ เราถือว่าคุณรับทราบและรับรองว่าคุณได้บรรลุนิติภาวะแล้วตามกฎหมาย และคุณได้อ่านและตกลงว่าจะยินยอมรับข้อผูกพันตามข้อกำหนดและเงื่อนไขดังต่อไปนี้:\n1 การเข้าถึงบริการ\n1.1 บริการนี้จัดหาให้โดยร้านค้านี้ (ซึ่งต่อไปในที่นี้จะเรียกว่า \"ร้านค้าฯ\") สำหรับการใช้งานส่วนตัวของคุณ ร้านค้าฯ ขอสงวนสิทธิในการเปลี่ยนแปลงหรือยุติการให้บริการ หรือเปลี่ยนแปลงข้อกำหนดและเงื่อนไขเหล่านี้ได้ตลอดเวลา คุณต้องรับผิดชอบในการตรวจสอบข้อกำหนดและเงื่อนไขเหล่านี้ในแต่ละครั้งที่คุณใช้บริการนี้\n1.2 การเข้าถึงบริการอาจถูกบล็อก ถูกระงับชั่วคราว หรือถูกยุติได้ตลอดเวลาไม่ว่าด้วยเหตุผลใด ๆ ก็ตาม ซึ่งรวมถึงแต่ไม่จำกัดแค่เพียง การที่คุณละเมิดข้อกำหนดและเงื่อนไขเหล่านี้หรือกฎหมายที่มีผลบังคับใช้\n1.3 ร้านค้าฯ ไม่รับประกันใด ๆ ทั้งสิ้น ในความพร้อมใช้งานของอินเทอร์เน็ต, ความเร็วขั้นต่ำในการเชื่อมต่ออินเทอร์เน็ตบนเครือข่าย หรือรับประกันว่าบริการนี้จะเสถียร ปราศจากข้อบกพร่อง, ทันกาลทันเวลา, เชื่อถือได้, สามารถใช้งานได้ หรือเหมาะสมสำหรับการรองรับการใช้งานตามวัตถุประสงค์ของคุณ\n1.4 ร้านค้าฯ ไม่รับประกันใด ๆ ทั้งสิ้น ในคุณภาพของข้อมูลบนอินเทอร์เน็ต คุณต้องรับผิดชอบในการตัดสินใจเรื่องความถูกต้องสมบูรณ์, คุณภาพ และความเกี่ยวข้องของข้อมูลที่คุณได้รับ\n1.5 บริการนี้จัดหาให้บนพื้นฐานของการเปิดกว้างต่อสาธารณะ และร้านค้าฯ ไม่รับประกันในความปลอดภัยของบริการ Wi-Fi นี้ คุณรับทราบและยอมรับว่าการใช้บริการนี้มีความเสี่ยงด้านความปลอดภัยอยู่เป็นปกติวิสัย และคุณใช้บริการนี้โดยแบกรับความเสี่ยงแต่เพียงผู้เดียว\n2 ข้อจำกัด\nคุณรับทราบและตกลงว่า เมื่อคุณใช้บริการนี้ คุณจะปฏิบัติตามกฎหมายที่มีผลบังคับใช้ทั้งหมด และคุณจะไม่:\na. ใช้บริการนี้เพื่อวัตถุประสงค์ทางการค้า\nb. ใช้บริการนี้เพื่อส่งอีเมลจำนวนมากโดยที่ผู้รับไม่ได้ร้องขอ\nc. เปิดเผยหรือเผยแพร่ข้อมูลที่มีกรรมสิทธิ์หรือข้อมูลที่เป็นความลับ\nd. ละเมิดสิทธิในทรัพย์สินทางปัญญาของบุคคลใดก็ตาม\ne. เก็บรวบรวมหรือเก็บข้อมูลจากบริการนี้หรือเซิร์ฟเวอร์ที่ใช้เพื่อให้บริการนี้\nf. พยายามที่จะดักจับข้อมูล, รบกวน หรือถอดรหัสการส่งและการรับข้อมูลจากเซิร์ฟเวอร์ที่ใช้เพื่อให้บริการนี้\ng. เชื่อมต่อกับเครือข่ายการแชร์ไฟล์ \"เพียร์ทูเพียร์\", ดาวน์โหลดไฟล์ขนาดใหญ่ หรือเรียกใช้โปรแกรม, บริการ, ระบบ, กระบวนการ หรือเซิร์ฟเวอร์ใด ๆก็ตามที่อาจลดประสิทธิภาพหรือความสามารถในเข้าถึงของเครือข่ายได้อย่างมาก\nh. ใช้บริการนี้เพื่อส่ง, อัปโหลด, รับ, ดาวน์โหลด, เผยแพร่, โพสต์, แจกจ่าย, กระจาย, ส่งเสริมหรือชักชวนให้รับเอกสารหรือเนื้อหาใด ๆ ก็ตามที่เป็นอันตราย, ทำให้เสื่อมเสียชื่อเสียง, ก่อความรำคาญ, ไม่เหมาะสม, โจมตีผู้อื่น, น่ารังเกียจ, คุกคาม, เหยียดสีผิว, ลามกอนาจาร, ข่มขู่, ผิดกฎหมาย หรือละเมิดสิทธิของบุคคลใด ๆ ก็ตาม\ni. ใช้บริการนี้เพื่อส่ง, จัดเก็บ, เผยแพร่ หรืออัปโหลดเอกสารหรือเนื้อหาอิเล็กทรอนิกส์ใด ๆ ก็ตาม อย่างเช่น ไวรัส, มัลแวร์, ม้าโทรจัน (Trojan Horse), เวิร์ม (Worm), ระเบิดเวลา (Time Bomb) ซึ่งจะ หรือมีแนวโน้มที่จะสร้างความเสียหาย, ทำลาย หรือจำกัดฟังก์ชันการทำงานของคอมพิวเตอร์, ซอฟต์แวร์, ฮาร์ดแวร์, อุปกรณ์อิเล็กทรอนิกส์ หรืออุปกรณ์โทรคมนาคม\nj. รับการเข้าถึงโดยไม่ได้รับอนุญาตไปยังคอมพิวเตอร์, บัญชีอีเมล, บัญชีธนาคาร, เครือข่ายคอมพิวเตอร์ หรืออุปกรณ์ของบุคคลอื่น หรือ\nk. ใช้บริการนี้เพื่อรุกล้ำความเป็นส่วนตัวของบุคคลอื่น หรือก่อให้เกิดความรำคาญ, ความไม่สะดวก หรือความวิตกกังวลต่อบุคคลอื่น\n3 ความเป็นส่วนตัว\nคุณรับทราบและยอมรับว่าบริการนี้จะเก็บรวบรวมและประมวลผลข้อมูลเกี่ยวกับชนิดของเว็บเบราว์เซอร์ และ/หรือข้อมูลระบบปฏิบัติการที่ใช้โดยอุปกรณ์ที่คุณเปิดใช้งาน เพื่อระบุวิธีการแสดงผลเว็บไซต์ที่ร้องขอบนอุปกรณ์ของคุณได้อย่างมีประสิทธิผลมากกว่า และ/หรือกำหนดค่าได้มากกว่า  และร้านค้าฯ จะเก็บรวบรวมข้อมูลที่อยู่ IP และที่อยู่ MAC ของอุปกรณ์ที่คุณเปิดใช้งาน ซึ่งได้เข้าถึงบริการ Wi-Fi เมื่อคุณยอมรับข้อกำหนดและเงื่อนไขเหล่านี้แล้ว\n4 การปลดเปลื้องความรับผิดและการชดเชยค่าเสียหาย\n4.1 ร้านค้าฯ ไม่รับผิดชอบใด ๆ ทั้งสิ้นต่อการสูญเสียข้อมูล เนื่องจากความล่าช้าหรือการหยุดชะงักของบริการนี้ หรือความสูญเสียหรือความเสียหายใด ๆ ก็ตามที่คุณอาจได้รับ ซึ่งเป็นผลลัพธ์จากการที่คุณใช้บริการนี้\n4.2 คุณปลดเปลื้องความรับผิดของร้านค้าฯ จากความรับผิดใด ๆ ก็ตามที่อาจเกิดขึ้นจากการที่คุณใช้บริการนี้ ซึ่งรวมถึง ความรับผิดที่เกี่ยวข้องกับเอกสารหรือเนื้อหาใด ๆ ก็ตามที่โจมตีหรือทำให้ผู้อื่นเสื่อมเสียชื่อเสียง หรือละเมิดลิขสิทธิ์ที่อาจเกิดขึ้น\n4.3 คุณตกลงที่จะชดใช้ค่าเสียหาย และต้องแก้ต่างและป้องกันร้านค้าฯ รวมถึงพนักงานและตัวแทนของร้านค้าฯ จากการสูญเสีย, ความเสียหาย, ความรับผิด, ข้อกล่าวหา และค่าใช้จ่ายทั้งหมด ไม่ว่าในรูปแบบหรือลักษณะใด ๆ ทั้งสิ้น (ซึ่งรวมถึงแต่ไม่จำกัดแค่เพียง ค่าธรรมเนียมทนายความ) ที่เกิดจากการที่คุณละเมิดข้อกำหนดและเงื่อนไขเหล่านี้",
	"TR": "Wi-Fi hizmetimize (\"Hizmet\") hoş geldiniz. Bu Hizmete erişerek ve bu Hizmeti kullanarak, reşit olduğunuzu ve aşağıdaki hüküm ve koşulları okuduğunuzu ve bunlara tabi olmayı kabul ettiğinizi beyan ve kabul edersiniz:\n1 Hizmete Erişme\n1.1 Hizmet, kişisel kullanımınız için mağaza (\"Mağaza\") tarafından sağlanmaktadır. Mağaza, Hizmeti değiştirme veya sonlandırma ya da bu Hüküm ve Koşulları dilediği zaman değiştirme hakkını saklı tutar. Hizmeti her kullandığınızda bu Hüküm ve Koşulları gözden geçirmek sizin sorumluluğunuzdadır.\n1.2 Hizmete erişim, bu Hüküm ve Koşulları veya yürürlükteki yasaları ihlal etmeniz dahil ancak bununla sınırlı olmamak üzere herhangi bir nedenle herhangi bir zamanda engellenebilir, askıya alınabilir veya sonlandırılabilir.\n1.3 Mağaza, İnternete erişilebilirliği, ağdaki minimum İnternet bağlantı hızlarını veya Hizmetin istikrarlı, hatasız, zamanında, güvenilir ve çalışır durumda veya kullanım amacınızı desteklemeye uygun olacağını garanti etmez.\n1.4 Mağaza, internet üzerindeki bilgilerin kalitesini garanti etmez. Alınan bilgilerin geçerliliğini, kalitesini ve uygunluğunu belirlemek sizin sorumluluğunuzdadır.\n1.5 Hizmet açık ve herkese açık bir şekilde sağlanmaktadır ve Mağaza, Wi-Fi hizmetinin güvenliğini garanti edemez, Hizmetin kullanımıyla ilgili doğal güvenlik riskleri olduğunu ve Hizmeti kullanmanın getireceği risklerin yalnızca sizin sorumluluğunuzda olduğunu kabul ve beyan edersiniz.\n2 Kısıtlamalar\nHizmeti kullanırken yürürlükteki tüm yasalara uyacağınızı ve aşağıdakileri yapmayacağınızı kabul ve beyan edersiniz;\na. Hizmeti ticari amaçlarla kullanmayacağınızı;\nb. Hizmeti istenmeyen toplu e-postalar göndermek için kullanmayacağınızı;\nc. özel veya gizli bilgileri ifşa etmeyeceğinizi veya yayınlamayacağınızı;\nd. herhangi bir kişinin fikri mülkiyet haklarını ihlal etmeyeceğinizi;\ne. Hizmetten veya Hizmeti sağlamak için kullanılan sunuculardan herhangi bir bilgi veya veri toplamayacağınızı veya elde etmeyeceğinizi;\nf. Hizmeti sağlamak için kullanılan sunuculara veya sunuculardan yapılan herhangi bir iletimi engellemeye, müdahale etmeye veya deşifre etmeye çalışmayacağınızı;\ng. \"Birebir\" dosya paylaşım ağlarına bağlanmayacağınızı, büyük dosyalar indirmeyeceğinizi veya ağ performansını veya erişilebilirliğini önemli ölçüde düşürebilecek herhangi bir program, hizmet, sistem, süreç veya sunucu çalıştırmayacağınızı;\nh. Hizmeti, rahatsız edici, karalayıcı, taciz edici, uygunsuz, saldırgan, müstehcen, gözdağı veren, ırkçı, pornografik, tehdit içeren, yasa dışı veya herhangi bir kişinin herhangi bir hakkını ihlal eden herhangi bir materyali iletmek, göndermek, yüklemek, almak, indirmek, yayınlamak, paylaşmak, dağıtmak, yaymak, teşvik etmek veya alınmasını talep etmek için kullanmayacağınızı;\ni. Hizmeti, herhangi bir bilgisayara, yazılıma, donanıma, elektronik cihaza veya telekomünikasyon ekipmanına zarar verecek veya zarar verme olasılığı olan virüsler, kötü amaçlı yazılımlar, Truva atları, solucanlar veya saatli bombalar gibi herhangi bir elektronik materyali iletmek, saklamak, yayınlamak veya yüklemek için kullanmayacağınızı;\nj. başka herhangi bir kişinin bilgisayarına, e-posta hesabına, banka hesabına, bilgisayar ağına veya ekipmanına yetkisiz erişim elde etmeyeceğinizi; veya\nk. Hizmeti başka bir kişinin gizliliğini ihlal etmek veya başka bir kişiye sıkıntı, rahatsızlık veya endişe vermek için kullanmayacağınızı.\n3 Gizlilik\nHizmetin, talep edilen web sitesini cihazınızda görüntülemenin daha etkili ve/veya özelleştirilmiş yollarını belirlemek için etkinleştirilmiş cihaz tarafından kullanılan web tarayıcısı türü ve/veya işletim sistemi bilgileri hakkındaki bilgileri kaydedip işleyeceğini kabul ve beyan edersiniz. Ayrıca Mağaza, Hüküm ve Koşullar kabul edildikten sonra Wi-Fi hizmetine erişen etkinleştirilmiş cihazın IP ve MAC adresini toplayacaktır.\n4 İbra Etme ve Tazminat\n4.1 Mağaza, hizmet gecikmeleri veya kesintileri nedeniyle veri kaybından veya Hizmeti kullanmanızın bir sonucu olarak maruz kalabileceğiniz her türlü kayıp veya zarardan sorumlu değildir.\n4.2 Mağazayı, hakaret içeren veya saldırgan materyallerle ilgili sorumluluktan veya meydana gelebilecek herhangi bir telif hakkı ihlali de dahil olmak üzere Hizmeti kullanımınızdan kaynaklanabilecek her türlü sorumluluktan muaf tutar ve ibra edersiniz.\n4.3 Bu Hüküm ve Koşulları ihlal etmenizden kaynaklanan her türlü kayıp, hasar, yükümlülük, ücret, masraftan (avukatlık ücretleri dahil ancak bunlarla sınırlı olmamak üzere) ve bu masraflara karşı Mağazayı, çalışanlarını ve temsilcilerini tazmin etmeyi kabul edersiniz ve bunlara karşı Mağazayı savunmanız ve sorumlu tutmamanız gerekir.",
	"TW": "歡迎您使用我們的Wi-Fi服務（以下簡稱「本服務」）。當您訪問和使用本服務時，您聲明並承認您已達到法定年齡，且您已閱讀並同意受以下條款的約束：\n1 訪問本服務\n1.1 本服務由商店（以下簡稱「本商店」）提供給您個人使用，本商店保留隨時更改或終止本服務或更改本使用條款的權利。您有責任於每次使用本服務時閱讀本使用條款。\n1.2 本服務可能隨時因任何原因被阻擋、暫停或終止，包括但不限於您違反本使用條款或所需適用的法律。\n1.3 本商店不對網路的可用性和最低連接速度作任何保證，也不保證本服務將穩定、無故障、及時、可靠、可運行或能符合或支持您的預期用途。\n1.4 本商店不對網路上的資訊品質作任何保證，您應自行判斷這些資訊的有效性、品質和關聯性。\n1.5 本服務是以公開的方式提供，本商店無法保證Wi-Fi服務的安全性，您知悉並同意使用本服務存在既有的安全風險，此風險由您自行承擔。\n2 限制\n您知悉並同意在使用本服務時會遵守所有適用的法律，並且您不會；\na. 將本服務用於商業目的；\nb. 使用本服務發送未經請求的廣告郵件；\nc. 洩露或公開他人專有或機密性的資訊；\nd. 侵害任何人的智慧財產權；\ne. 從本服務或用於提供本服務的伺服器中蒐集或擷取任何資訊或數據；\nf. 試圖攔截、干擾或解碼任何用於提供本服務的伺服器傳輸；\ng. 連接至點對點共享網站、下載大量文件或運行任何可能嚴重降低網路效能或使用性的程式、服務、系統、程序或伺服器；\nh. 使用本服務傳輸、發送、上傳、接收、下載、發布、張貼、分發、傳播、鼓勵或徵求任何包含辱罵、誹謗、騷擾、不雅、攻擊性、淫穢、威脅、種族主義、色情的、威脅、非法或侵害他人權利的內容；\ni. 使用本服務傳輸、儲存、發布或上傳任何可能損害、破壞或限制任何電腦、軟體、硬體、電子設備或電信設備功能的電子檔案，例如病毒、惡意軟體、特洛伊木馬、蠕蟲或病毒炸彈；\nj. 未經授權訪問任何其他人的電腦、電子郵件帳戶、銀行帳戶、電腦網路或設備；或\nk. 使用本服務以侵犯他人隱私或為用於對他人造成困擾、不便或焦慮。\n3 隱私\n您知悉並同意，本服務將取得並處理關於連接設備的網絡瀏覽器類型和/或作業系統資訊，以判斷較有效率及/或適合您設備的網站顯示方式。而本商店將在本使用條款經同意後蒐集連線Wi-Fi的裝置IP和MAC位置。\n4 免責與賠償條款\n4.1 本商店不對因本服務延遲或中斷而導致的數據遺失，或您因使用本服務可能遭受的任何損失或損害承擔任何責任。\n4.2 您免除本商店因您使用本服務而可能產生的任何責任，包括與誹謗或冒犯內容相關的責任，或可能發生的任何侵害著作權的責任。\n4.3 您同意對任何因您違反本使用條款而對本商店、其員工或代理人產生的所有損失、損害、責任、費用、支出（包含但不限於律師費等）進行賠償及辯護。",
	"UK": "Ласкаво просимо до нашої послуги Wi-Fi («Послуга»). Отримуючи доступ до цієї Послуги й використовуючи її, ви заявляєте та підтверджуєте, що досягли повноліття, а також прочитали й погоджуєтеся дотримуватися таких умов:\n1 Доступ до Послуги\n1.1 Послуга надається магазином («Магазин») для вашого особистого використання. Магазин залишає за собою право змінити чи припинити надання Послуги або змінити ці Умови та Правила в будь-який час. Ви несете відповідальність за перегляд цих Умов і Правил щоразу, коли використовуєте Послугу.\n1.2 Доступ до Послуги може бути заблоковано, призупинено або припинено в будь-який час із будь-якої причини, зокрема через порушення вами цих Умов і Правил або відповідних законів.\n1.3 Магазин не гарантує доступність інтернету, мінімальну швидкість інтернет-з’єднання в мережі або те, що Послуга буде стабільною, безвідмовною, своєчасною, надійною, оперативною або придатною для використання за призначенням.\n1.4 Магазин не гарантує якість інформації в інтернеті; визначення достовірності, якості й актуальності отриманої інформації — ваша відповідальність.\n1.5 Послуга надається на відкритих і публічних засадах, і Магазин не може гарантувати безпеку послуги Wi-Fi. Ви визнаєте й погоджуєтеся, що існують неодмінні ризики для безпеки, пов’язані з використанням Послуги, і ви робите це лише на власний ризик.\n2 Обмеження\nВи усвідомлюєте й погоджуєтеся, що під час використання Послуги ви будете дотримуватись усіх застосовних законів і не будете:\na. використовувати Послугу в комерційних цілях;\nb. використовувати Послугу для розсилки небажаних електронних листів;\nc. розкривати або публікувати службову або конфіденційну інформацію;\nd. порушувати права інтелектуальної власності будь-якої особи;\ne. отримувати або збирати будь-яку інформацію чи дані з Послуги або серверів, які використовуються для надання Послуги;\nf. намагатися перехопити, завадити або розшифрувати будь-яке передавання до або від серверів, які використовуються для надання Послуги;\ng. підключатися до однорангових мереж обміну файлами, завантажувати великі файли або запускати будь-які програми, служби, системи, процеси або сервери, які можуть суттєво погіршити продуктивність чи доступність мережі;\nh. використовувати Послугу для передавання, надсилання, вивантаження, отримання, завантаження, публікації, розповсюдження, поширення, сприяння або вимагання отримання будь-яких матеріалів, які є образливими, наклепницькими, агресивними, непристойними, лайливими, непристойними, загрозливими, расистськими, порнографічними, погрозливими, незаконними або такими, що порушують будь-які права будь-якої особи;\ni. використовувати Послугу для передавання, зберігання, публікації чи вивантаження будь-яких електронних матеріалів, як-от вірусів, зловмисного програмного забезпечення, троянських програм, комп’ютерних хробаків або «бомб уповільненої дії», які завдадуть або можуть завдати шкоди, знищити чи обмежити функціональність будь-якого комп’ютера, програмного забезпечення, апаратного забезпечення, електронного пристрою або телекомунікаційного обладнання;\nj. отримувати несанкціонований доступ до чужого комп’ютера, облікового запису електронної пошти, банківського рахунка, комп’ютерної мережі чи обладнання; або\nk. використовувати Послугу, щоб втрутитися в приватне життя іншої особи або викликати в іншої особи роздратування, незручності чи занепокоєння.\n3 Конфіденційність\nВи усвідомлюєте й погоджуєтеся з тим, що Послуга збиратиме й оброблятиме інформацію про тип веббраузера й/або інформацію про операційну систему, яка використовується ввімкненим пристроєм, щоб визначити більш ефективні та/або налаштовані засоби відображення запитаного вебсайту на вашому пристрої. Крім того, Магазин збере IP- та MAC-адресу ввімкненого пристрою, який отримав доступ до послуги Wi-Fi, після того як було прийнято Умови та Правила використання.\n4 Звільнення від відповідальності й відшкодування збитків\n4.1 Магазин не несе відповідальності за втрату даних через затримки або перерви в роботі служби або будь-які втрати чи збитки, яких ви можете зазнати в результаті використання вами Послуги.\n4.2 Ви звільняєте Магазин від будь-якої відповідальності, яка може виникнути внаслідок використання вами Послуги, зокрема від відповідальності за наклепницькі чи образливі матеріали або будь-яке порушення авторських прав, що може виникнути.\n4.3 Ви погоджуєтеся відшкодувати збитки й зобов’язані захищати Магазин, його співробітників і агентів від усіх втрат, пошкоджень, зобов’язань, витрат (зокрема, оплата послуг адвокатів) будь-якого характеру, що виникли внаслідок порушення вами цих Умов і Правил."
}