/* SPDX-License-Identifier: GPL-2.0+ */
/*
 * Copyright (C) 2015 Freescale Semiconductor, Inc.
 *
 * Author:
 *	Peng Fan <Peng.Fan@freescale.com>
 */

#ifndef __ARCH_ARM_MACH_MX7_CCM_REGS_H__
#define __ARCH_ARM_MACH_MX7_CCM_REGS_H__

#include <asm/arch/imx-regs.h>
#include <asm/io.h>

#define	CCM_GPR0_OFFSET			0x0
#define	CCM_OBSERVE0_OFFSET		0x0400
#define	CCM_SCTRL0_OFFSET		0x0800
#define	CCM_CCGR0_OFFSET		0x4000
#define	CCM_ROOT0_TARGET_OFFSET		0x8000

#ifndef __ASSEMBLY__

struct mxc_ccm_ccgr {
	uint32_t ccgr;
	uint32_t ccgr_set;
	uint32_t ccgr_clr;
	uint32_t ccgr_tog;
};

struct mxc_ccm_root_slice {
	uint32_t target_root;
	uint32_t target_root_set;
	uint32_t target_root_clr;
	uint32_t target_root_tog;
	uint32_t reserved_0[4];
	uint32_t post;
	uint32_t post_root_set;
	uint32_t post_root_clr;
	uint32_t post_root_tog;
	uint32_t pre;
	uint32_t pre_root_set;
	uint32_t pre_root_clr;
	uint32_t pre_root_tog;
	uint32_t reserved_1[12];
	uint32_t access_ctrl;
	uint32_t access_ctrl_root_set;
	uint32_t access_ctrl_root_clr;
	uint32_t access_ctrl_root_tog;
};

/** CCM - Peripheral register structure */
struct mxc_ccm_reg {
	uint32_t gpr0;
	uint32_t gpr0_set;
	uint32_t gpr0_clr;
	uint32_t gpr0_tog;
	uint32_t reserved_0[4092];
	struct mxc_ccm_ccgr ccgr_array[191];	/* offset 0x4000 */
	uint32_t reserved_1[3332];
	struct mxc_ccm_root_slice root[121];	/* offset 0x8000 */

};

struct mxc_ccm_anatop_reg {
	uint32_t ctrl_24m;			/* offset 0x0000 */
	uint32_t ctrl_24m_set;
	uint32_t ctrl_24m_clr;
	uint32_t ctrl_24m_tog;
	uint32_t rcosc_config0;			/* offset 0x0010 */
	uint32_t rcosc_config0_set;
	uint32_t rcosc_config0_clr;
	uint32_t rcosc_config0_tog;
	uint32_t rcosc_config1;			/* offset 0x0020 */
	uint32_t rcosc_config1_set;
	uint32_t rcosc_config1_clr;
	uint32_t rcosc_config1_tog;
	uint32_t rcosc_config2;			/* offset 0x0030 */
	uint32_t rcosc_config2_set;
	uint32_t rcosc_config2_clr;
	uint32_t rcosc_config2_tog;
	uint8_t reserved_0[16];
	uint32_t osc_32k;			/* offset 0x0050 */
	uint32_t osc_32k_set;
	uint32_t osc_32k_clr;
	uint32_t osc_32k_tog;
	uint32_t pll_arm;			/* offset 0x0060 */
	uint32_t pll_arm_set;
	uint32_t pll_arm_clr;
	uint32_t pll_arm_tog;
	uint32_t pll_ddr;			/* offset 0x0070 */
	uint32_t pll_ddr_set;
	uint32_t pll_ddr_clr;
	uint32_t pll_ddr_tog;
	uint32_t pll_ddr_ss;			/* offset 0x0080 */
	uint8_t reserved_1[12];
	uint32_t pll_ddr_num;			/* offset 0x0090 */
	uint8_t reserved_2[12];
	uint32_t pll_ddr_denom;			/* offset 0x00a0 */
	uint8_t reserved_3[12];
	uint32_t pll_480;			/* offset 0x00b0 */
	uint32_t pll_480_set;
	uint32_t pll_480_clr;
	uint32_t pll_480_tog;
	uint32_t pfd_480a;			/* offset 0x00c0 */
	uint32_t pfd_480a_set;
	uint32_t pfd_480a_clr;
	uint32_t pfd_480a_tog;
	uint32_t pfd_480b;			/* offset 0x00d0 */
	uint32_t pfd_480b_set;
	uint32_t pfd_480b_clr;
	uint32_t pfd_480b_tog;
	uint32_t pll_enet;			/* offset 0x00e0 */
	uint32_t pll_enet_set;
	uint32_t pll_enet_clr;
	uint32_t pll_enet_tog;
	uint32_t pll_audio;			/* offset 0x00f0 */
	uint32_t pll_audio_set;
	uint32_t pll_audio_clr;
	uint32_t pll_audio_tog;
	uint32_t pll_audio_ss;			/* offset 0x0100 */
	uint8_t reserved_4[12];
	uint32_t pll_audio_num;			/* offset 0x0110 */
	uint8_t reserved_5[12];
	uint32_t pll_audio_denom;		/* offset 0x0120 */
	uint8_t reserved_6[12];
	uint32_t pll_video;			/* offset 0x0130 */
	uint32_t pll_video_set;
	uint32_t pll_video_clr;
	uint32_t pll_video_tog;
	uint32_t pll_video_ss;			/* offset 0x0140 */
	uint8_t reserved_7[12];
	uint32_t pll_video_num;			/* offset 0x0150 */
	uint8_t reserved_8[12];
	uint32_t pll_video_denom;		/* offset 0x0160 */
	uint8_t reserved_9[12];
	uint32_t clk_misc0;			/* offset 0x0170 */
	uint32_t clk_misc0_set;
	uint32_t clk_misc0_clr;
	uint32_t clk_misc0_tog;
	uint32_t clk_rsvd;			/* offset 0x0180 */
	uint8_t reserved_10[124];
	uint32_t reg_1p0a;			/* offset 0x0200 */
	uint32_t reg_1p0a_set;
	uint32_t reg_1p0a_clr;
	uint32_t reg_1p0a_tog;
	uint32_t reg_1p0d;			/* offsest 0x0210 */
	uint32_t reg_1p0d_set;
	uint32_t reg_1p0d_clr;
	uint32_t reg_1p0d_tog;
	uint32_t reg_hsic_1p2;			/* offset 0x0220 */
	uint32_t reg_hsic_1p2_set;
	uint32_t reg_hsic_1p2_clr;
	uint32_t reg_hsic_1p2_tog;
	uint32_t reg_lpsr_1p0;			/* offset 0x0230 */
	uint32_t reg_lpsr_1p0_set;
	uint32_t reg_lpsr_1p0_clr;
	uint32_t reg_lpsr_1p0_tog;
	uint32_t reg_3p0;			/* offset 0x0240 */
	uint32_t reg_3p0_set;
	uint32_t reg_3p0_clr;
	uint32_t reg_3p0_tog;
	uint32_t reg_snvs;			/* offset 0x0250 */
	uint32_t reg_snvs_set;
	uint32_t reg_snvs_clr;
	uint32_t reg_snvs_tog;
	uint32_t analog_debug_misc0;		/* offset 0x0260 */
	uint32_t analog_debug_misc0_set;
	uint32_t analog_debug_misc0_clr;
	uint32_t analog_debug_misc0_tog;
	uint32_t ref;				/* offset 0x0270 */
	uint32_t ref_set;
	uint32_t ref_clr;
	uint32_t ref_tog;
	uint8_t reserved_11[128];
	uint32_t tempsense0;			/* offset 0x0300 */
	uint32_t tempsense0_set;
	uint32_t tempsense0_clr;
	uint32_t tempsense0_tog;
	uint32_t tempsense1;			/* offset 0x0310 */
	uint32_t tempsense1_set;
	uint32_t tempsense1_clr;
	uint32_t tempsense1_tog;
	uint32_t tempsense_trim;		/* offset 0x0320 */
	uint32_t tempsense_trim_set;
	uint32_t tempsense_trim_clr;
	uint32_t tempsense_trim_tog;
	uint32_t lowpwr_ctrl;			/* offset 0x0330 */
	uint32_t lowpwr_ctrl_set;
	uint32_t lowpwr_ctrl_clr;
	uint32_t lowpwr_ctrl_tog;
	uint32_t snvs_tamper_offset_ctrl;	/* offset 0x0340 */
	uint32_t snvs_tamper_offset_ctrl_set;
	uint32_t snvs_tamper_offset_ctrl_clr;
	uint32_t snvs_tamper_offset_ctrl_tog;
	uint32_t snvs_tamper_pull_ctrl;		/* offset 0x0350 */
	uint32_t snvs_tamper_pull_ctrl_set;
	uint32_t snvs_tamper_pull_ctrl_clr;
	uint32_t snvs_tamper_pull_ctrl_tog;
	uint32_t snvs_test;			/* offset 0x0360 */
	uint32_t snvs_test_set;
	uint32_t snvs_test_clr;
	uint32_t snvs_test_tog;
	uint32_t snvs_tamper_trim_ctrl;		/* offset 0x0370 */
	uint32_t snvs_tamper_trim_ctrl_set;
	uint32_t snvs_tamper_trim_ctrl_ctrl;
	uint32_t snvs_tamper_trim_ctrl_tog;
	uint32_t snvs_misc_ctrl;		/* offset 0x0380 */
	uint32_t snvs_misc_ctrl_set;
	uint32_t snvs_misc_ctrl_clr;
	uint32_t snvs_misc_ctrl_tog;
	uint8_t reserved_12[112];
	uint32_t misc;				/* offset 0x0400 */
	uint8_t reserved_13[252];
	uint32_t adc0;				/* offset 0x0500 */
	uint8_t reserved_14[12];
	uint32_t adc1;				/* offset 0x0510 */
	uint8_t reserved_15[748];
	uint32_t digprog;			/* offset 0x0800 */
};
#endif

#define ANADIG_CLK_MISC0_PFD_480_AUTOGATE_EN_MASK	(0x01 << 17)

#define ANADIG_PLL_LOCK					0x80000000

#define ANADIG_PLL_ARM_PWDN_MASK			(0x01 << 12)
#define ANADIG_PLL_480_PWDN_MASK			(0x01 << 12)
#define ANADIG_PLL_DDR_PWDN_MASK			(0x01 << 20)
#define ANADIG_PLL_ENET_PWDN_MASK			(0x01 << 5)
#define ANADIG_PLL_VIDEO_PWDN_MASK			(0x01 << 12)


#define ANATOP_PFD480B_PFD4_FRAC_MASK			0x0000003f
#define ANATOP_PFD480B_PFD4_FRAC_320M_VAL		0x0000001B
#define ANATOP_PFD480B_PFD4_FRAC_392M_VAL		0x00000016
#define ANATOP_PFD480B_PFD4_FRAC_432M_VAL		0x00000014

/* PLL_ARM Bit Fields */
#define CCM_ANALOG_PLL_ARM_DIV_SELECT_MASK		0x7F
#define CCM_ANALOG_PLL_ARM_DIV_SELECT_SHIFT		0
#define CCM_ANALOG_PLL_ARM_HALF_LF_MASK			0x80
#define CCM_ANALOG_PLL_ARM_HALF_LF_SHIFT		7
#define CCM_ANALOG_PLL_ARM_DOUBLE_LF_MASK		0x100
#define CCM_ANALOG_PLL_ARM_DOUBLE_LF_SHIFT		8
#define CCM_ANALOG_PLL_ARM_HALF_CP_MASK			0x200
