/*
  <:copyright-BRCM:2021:DUAL/GPL:standard 

  Copyright (c) 2021 Broadcom 
  All Rights Reserved

  Unless you and Broadcom execute a separate written software license
  agreement governing use of this software, this software is licensed
  to you under the terms of the GNU General Public License version 2
  (the "GPL"), available at http://www.broadcom.com/licenses/GPLv2.php,
  with the following added to such license:

  As a special exception, the copyright holders of this software give
  you permission to link this software with independent modules, and
  to copy and distribute the resulting executable under terms of your
  choice, provided that you also meet, for each linked independent
  module, the terms and conditions of the license of that module.
  An independent module is a module which is not derived from this
  software.  The special exception does not apply to any modifications
  of the software.

  Not withstanding the above, under no circumstances may you combine
  this software in any way with any other Broadcom software provided
  under a license other than the GPL, without Broadcom's express prior
  written consent.

  :>
*/

#ifndef __47622_SYSPORT_H__
#define __47622_SYSPORT_H__

#define FIELD_MASK(bits, shift)  ( ( (1ULL<<(bits)) - 1 ) << shift )

#define sysport_intc_to_irq_index(_intc)  (_intc)

typedef struct sys_port_intr2 {
    uint32_t SYSTEMPORT_INTR_CPU_STATUS;
    uint32_t SYSTEMPORT_INTR_CPU_SET;
    uint32_t SYSTEMPORT_INTR_CPU_CLEAR;
    uint32_t SYSTEMPORT_INTR_CPU_MASK_STATUS;
    uint32_t SYSTEMPORT_INTR_CPU_MASK_SET;
    uint32_t SYSTEMPORT_INTR_CPU_MASK_CLEAR;
    uint8_t  reserved[8];
}sys_port_intr2, SYSTEMPORT_INTRL2;

#define SYSPORT_INTC_MAPPING_TDMA_MULTI_BUFFER_DONE_INTR  0
#define SYSPORT_INTC_MAPPING_RDMA_MULTI_BUFFER_DONE_INTR  1
#define SYSPORT_INTC_MAPPING_CSB_DONE_INTR                2
#define SYSPORT_INTC_MAPPING_PSB_DONE_INTR                3
#define SYSPORT_INTC_MAPPING_TX_MISC_INTR                 2
#define SYSPORT_INTC_MAPPING_RX_MISC_INTR                 3

#define SYSPORT_INTC_MAPPING_INT_SEL_S(_index)                          \
    ( ((_index) < 16) ? ((_index) * 2) : (((_index) - 16) * 2) )

typedef struct sys_port_intc
{
    uint32_t SYSTEMPORT_INTC_INTC_MAPPING_1;//0x80498300
    uint32_t SYSTEMPORT_INTC_INTC_MAPPING_0;//0x80498304
    uint32_t SYSTEMPORT_INTC_INTC_PSB_EN;//0x80498308
    uint32_t SYSTEMPORT_INTC_INTC_CSB_EN;//0x8049830c
    uint8_t  reserved[16];
}sys_port_intc, SYSTEMPORT_INTC;

typedef struct sys_port_intr2_phy
{
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_STATUS;
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_SET;
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_CLEAR;
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_MASK_STATUS;
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_MASK_SET;
    uint32_t SYSTEMPORT_INTRL2_PHY_CPU_MASK_CLEAR;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_STATUS;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_SET;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_CLEAR;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_MASK_STATUS;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_MASK_SET;
    uint32_t SYSTEMPORT_INTRL2_PHY_PCI_MASK_CLEAR;
}sys_port_intr2_phy,SYSTEMPORT_X_INTRL2_PHY;

#define SYSPORT_UMAC_CMD_TX_ENA_M     FIELD_MASK(1,0)
#define SYSPORT_UMAC_CMD_RX_ENA_M     FIELD_MASK(1,1)

#define SYSPORT_UMAC_MPD_CTRL_MPD_EN  FIELD_MASK(1,0)

typedef struct sys_port_umac {
    uint32_t SYSTEMPORT_UMAC_UMAC_DUMMY;
    uint32_t SYSTEMPORT_UMAC_HD_BKP_CNTL;             //0x804
#define SYSPORT_UNIMAC_COMMAND_CONFIG_ENA_EXT_CONFIG        FIELD_MASK(1,22)
#define SYSPORT_UNIMAC_COMMAND_CONFIG_RX_EN 0x02
#define SYSPORT_UNIMAC_COMMAND_CONFIG_TX_EN 0x01
    uint32_t SYSTEMPORT_UMAC_CMD;                     //0x808
    uint32_t SYSTEMPORT_UMAC_MAC0;                    //0x80c
    uint32_t SYSTEMPORT_UMAC_MAC1;                    //0x810
    uint32_t SYSTEMPORT_UMAC_FRM_LEN;                 //0x814
    uint32_t SYSTEMPORT_UMAC_PAUSE_QUNAT;             //0x818
    uint32_t dummy1[9];
    uint32_t SYSTEMPORT_UMAC_TX_TS_SEQ_ID;            //0x83c
    uint32_t SYSTEMPORT_UMAC_SFD_OFFSET;              //0x840
    uint32_t SYSTEMPORT_UMAC_MODE;                    //0x844
    uint32_t SYSTEMPORT_UMAC_FRM_TAG0;                //0x848
    uint32_t SYSTEMPORT_UMAC_FRM_TAG1;                //0x84c
    uint32_t SYSTEMPORT_UMAC_RX_PAUSE_QUANTA_SCALE;   //0x850
    uint32_t SYSTEMPORT_UMAC_TX_PREAMBLE;             //0x854
    uint32_t dummy2;
    uint32_t SYSTEMPORT_UMAC_TX_IPG_LEN;              //0x85c
    uint32_t SYSTEMPORT_UMAC_PFC_XOFF_TIMER;          //0x860
    uint32_t SYSTEMPORT_UMAC_EEE_CTRL;                //0x864
    uint32_t SYSTEMPORT_UMAC_MII_EEE_LPI_TIMER;       //0x868
    uint32_t SYSTEMPORT_UMAC_GMII_EEE_LPI_TIMER;      //0x86c
    uint32_t SYSTEMPORT_UMAC_EEE_REF_COUNT;           //0x870
    uint32_t SYSTEMPORT_UMAC_TIMESTAMP_ADJUST;        //0x874
    uint32_t SYSTEMPORT_UMAC_RX_PKT_DROP_STATUS;      //0x878
    uint32_t SYSTEMPORT_UMAC_SYMMETRIC_IDLE_THRESHOLD;//0x87c
    uint32_t SYSTEMPORT_UMAC_MII_EEE_WAKE_TIMER;      //0x880
    uint32_t SYSTEMPORT_UMAC_GMII_EEE_WAKE_TIMER;     //0x884
    uint32_t SYSTEMPORT_UMAC_REV_ID;                  //0x888
    uint32_t dummy5[157];
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_TYPE;            //0xb00
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_OPCODE;          //0xb04
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_DA_0;            //0xb08
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_DA_1;            //0xb0c
    uint32_t SYSTEMPORT_UMAC_MACSEC_PROG_TX_CRC;      //0xb10
    uint32_t SYSTEMPORT_UMAC_MACSEC_CNTRL;            //0xb14
    uint32_t SYSTEMPORT_UMAC_TS_STATUS_CNTRL;         //0xb18
    uint32_t SYSTEMPORT_UMAC_TX_TS_DATA;              //0xb1c
    uint32_t dummy6[4];
    uint32_t SYSTEMPORT_UMAC_PAUSE_CNTRL;             //0xb30
    uint32_t SYSTEMPORT_UMAC_FLUSH_CNTRL;             //0xb34
    uint32_t SYSTEMPORT_UMAC_RXFIFO_STAT;             //0xb38
    uint32_t SYSTEMPORT_UMAC_TXFIFO_STAT;             //0xb3c
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_CTRL;            //0xb40
    uint32_t SYSTEMPORT_UMAC_MAC_PFC_REFRESH_CTRL;    //0xb44
}sys_port_umac, SYSTEMPORT_UNIMAC;

#define SYSPORT_MPD_CTRL_MPD_EN  FIELD_MASK(1,0)
typedef struct sys_port_mpd {
    uint32_t SYSTEMPORT_MPD_CTRL;
    uint32_t SYSTEMPORT_MPD_PSW_MS;
    uint32_t SYSTEMPORT_MPD_PSW_LS;
}sys_port_mpd, SYSTEMPORT_MPD;

#define SYSPORT_RDMA_CTRL_RDMA_EN_M             FIELD_MASK(1,0)
#define SYSPORT_RDMA_CTRL_RING_CFG_M            FIELD_MASK(2,1)
#define SYSPORT_RDMA_CTRL_RING_CFG_bit0_M       FIELD_MASK(1,1)
#define SYSPORT_RDMA_CTRL_RING_CFG_bit1_M       FIELD_MASK(1,2)
#define SYSPORT_RDMA_CTRL_DISCARD_EN_M          FIELD_MASK(1,3)
#define SYSPORT_RDMA_CTRL_DATA_OFFSET_M         FIELD_MASK(10,4)
#define SYSPORT_RDMA_CTRL_DDR_DESC_WR_EN_M      FIELD_MASK(1,15)
#define SYSPORT_RDMA_CTRL_PSB_EN_M              FIELD_MASK(1,18)

#define SYSPORT_RDMA_STATUS_RDMA_DISABLED_M     FIELD_MASK(1,0)
#define SYSPORT_RDMA_STATUS_DESC_RAM_BUSY_M     FIELD_MASK(1,1)

#define SYSTEMPORT_RDMA_LOCRAM_DESCRING_SIZE_MAX            128
#define SYSTEMPORT_RDMA_LOCRAM_DESCRING_SIZE_RING_FLUSH_M   FIELD_MASK(1,16)
#define SYSTEMPORT_RDMA_LOCRAM_DESCRING_SIZE_RING_EN_M      FIELD_MASK(1,17)

#define SYSPORT_RDMA_PSB_INTR_CFG_THRESHOLD_M     FIELD_MASK(16,0)
#define SYSPORT_RDMA_PSB_INTR_CFG_THRESHOLD_S     0
#define SYSPORT_RDMA_PSB_INTR_CFG_TIMEOUT_M       FIELD_MASK(16,16)
#define SYSPORT_RDMA_PSB_INTR_CFG_TIMEOUT_S       16

typedef struct sys_port_rdma {
    uint32_t SYSTEMPORT_RDMA_DESCRIPTOR[1024];
    uint32_t SYSTEMPORT_RDMA_DESC_WRITE_PORT[16];
    uint32_t SYSTEMPORT_RDMA_DESC_READ_PORT[16];
    uint32_t SYSTEMPORT_RDMA_CONTROL;
    uint32_t SYSTEMPORT_RDMA_STATUS;
    uint32_t SYSTEMPORT_RDMA_SYSBUS_BURST;
    uint32_t SYSTEMPORT_RDMA_SWITCH_PORT_BP_EN;
    uint32_t SYSTEMPORT_RDMA_RXQ_TO_SWITCH_EGRESS_QUEUES_BP_MAP[8];
#define SYSPORT_RDMA_RING_EN	(1<<17)
    uint32_t SYSTEMPORT_RDMA_LOCRAM_DESCRING_SIZE[8];
    uint32_t SYSTEMPORT_RDMA_PKTBUF_SIZE[8];
    uint32_t SYSTEMPORT_RDMA_PINDEX[8];
    uint32_t SYSTEMPORT_RDMA_CINDEX[8];
    uint32_t SYSTEMPORT_RDMA_BUFDONE_INTR_CFG[8];
    uint32_t SYSTEMPORT_RDMA_XON_XOFF_CFG[8];
    uint32_t SYSTEMPORT_RDMA_DDR_DESC_RING_START[16];
    uint32_t SYSTEMPORT_RDMA_DDR_DESC_RING_SIZE[8];
    uint32_t SYSTEMPORT_RDMA_DDR_DESC_RING_CTRL[8];
    uint32_t SYSTEMPORT_RDMA_DDR_DESC_RING_WR_PUSH_TIMER[8];
    uint32_t SYSTEMPORT_RDMA_BP_STATUS;
    uint32_t SYSTEMPORT_RDMA_DESC_RAM_ARB_CONTROL;
    uint32_t SYSTEMPORT_RDMA_DESC_RAM_RD_ARB_CFG;
    uint32_t SYSTEMPORT_RDMA_DESC_RAM_WR_ARB_CFG;
    uint32_t SYSTEMPORT_RDMA_PSB_INTR_CFG;
    uint32_t SYSTEMPORT_RDMA_PSB_ADDR_LO;
    uint32_t SYSTEMPORT_RDMA_PSB_ADDR_HI;
    uint32_t SYSTEMPORT_RDMA_TEST;
    uint32_t SYSTEMPORT_RDMA_DEBUG;
}sys_port_rdma, SYSTEMPORT_RDMA;

#define SYSPORT_RBUF_CTRL_RSB_MODE_M          FIELD_MASK(2,0)
#define SYSPORT_RBUF_CTRL_RSB_MODE_S          0
#define SYSPORT_RBUF_CTRL_4B_ALIGN_M          FIELD_MASK(1,2)
#define SYSPORT_RBUF_CTRL_BTAG_STRIP_M        FIELD_MASK(1,3)
#define SYSPORT_RBUF_CTRL_BAD_PKT_DISCARD_M   FIELD_MASK(1,4)
#define SYSPORT_RBUF_CTRL_CRC_REPLACE_M       FIELD_MASK(1,21)
#define SYSPORT_RBUF_CTRL_ACPI_EN_M           FIELD_MASK(1,25)

#define SYSPORT_RBUF_CTRL_RSB_MODE_NO_RSB     0
#define SYSPORT_RBUF_CTRL_RSB_MODE_RSB8       1
#define SYSPORT_RBUF_CTRL_RSB_MODE_RSB32      2

#define SYSPORT_RBUF_PACKET_READY_THRESHOLD_PKT_RDY_THRESHOLD_M   FIELD_MASK(10,0)
#define SYSPORT_RBUF_PACKET_READY_THRESHOLD_PKT_RDY_THRESHOLD_S   0
#define SYSPORT_RBUF_PACKET_READY_THRESHOLD_RESUME_THRESHOLD_M    FIELD_MASK(10,16)
#define SYSPORT_RBUF_PACKET_READY_THRESHOLD_RESUME_THRESHOLD_S    16

#define SYSPORT_RBUF_STATUS_WOL_M           FIELD_MASK(1,0)
#define SYSPORT_RBUF_STATUS_WOL_S           0
#define SYSPORT_RBUF_STATUS_MPD_ACTIVE_M    FIELD_MASK(1,1)
#define SYSPORT_RBUF_STATUS_MPD_ACTIVE_S    1
#define SYSPORT_RBUF_STATUS_ARP_ACTIVE_M    FIELD_MASK(1,2)
#define SYSPORT_RBUF_STATUS_ARP_ACTIVE_S    2

typedef struct sys_port_rbuf {
    uint32_t SYSTEMPORT_RBUF_RBUF_CONTROL;
    uint32_t SYSTEMPORT_RBUF_RBUF_PACKET_READY_THRESHOLD;
    uint32_t SYSTEMPORT_RBUF_RBUF_STATUS;
    uint32_t SYSTEMPORT_RBUF_RBUF_OVERFLOW_PACKET_DISCARD_COUNT;
    uint32_t SYSTEMPORT_RBUF_RBUF_ERROR_PACKET_COUNT;
}sys_port_rbuf, SYSTEMPORT_RBUF;

typedef struct sys_port_tbuf {
    uint32_t SYSTEMPORT_TBUF_TBUF_CONTROL;
    uint32_t SYSTEMPORT_TBUF_PKT_RDY_THRESHOLD;
    uint32_t SYSTEMPORT_TBUF_TBUF_STATUS;
}sys_port_tbuf, SYSTEMPORT_TBUF;

#define SYSTEMPORT_TDMA_DESC_RING_MAX        8
#define SYSTEMPORT_TDMA_LOCRAM_DESCRING_MAX  512

#define SYSTEMPORT_TDMA_TIMEOUT_TICK_NSEC    1000 // tick = 1 usec (internal timer)

typedef struct systemport_tdma_descriptor_write_port
{
    uint32_t SYSTEMPORT_TDMA_DESCRIPTOR_XX_WRITE_PORT_LO;
    uint32_t SYSTEMPORT_TDMA_DESCRIPTOR_XX_WRITE_PORT_HI;
}systemport_tdma_descriptor_write_port;

typedef struct systemport_tdma_descriptor_read_port
{
    uint32_t SYSTEMPORT_TDMA_DESCRIPTOR_XX_READ_PORT_LO;
    uint32_t SYSTEMPORT_TDMA_DESCRIPTOR_XX_READ_PORT_HI;
}systemport_tdma_descriptor_read_port;

#define SYSTEMPORT_TDMA_DESC_RING_XX_PRODUCER_CONSUMER_INDEX_CONSUMER_INDEX_S      16
#define SYSTEMPORT_TDMA_DESC_RING_XX_PRODUCER_CONSUMER_INDEX_CONSUMER_INDEX_M      FIELD_MASK(16,16)
#define SYSTEMPORT_TDMA_DESC_RING_XX_PRODUCER_CONSUMER_INDEX_PRODUCER_INDEX_M      FIELD_MASK(16,0)

#define SYSPORT_TDMA_CONTROL_TDMA_EN_M                  FIELD_MASK(1,0)
#define SYSPORT_TDMA_CONTROL_TSB_EN_M                   FIELD_MASK(1,1)
#define SYSPORT_TDMA_CONTROL_DATA_OFFSET_M              FIELD_MASK(10,5)
#define SYSPORT_TDMA_CONTROL_VLAN_EN_M                  FIELD_MASK(1,15)
#define SYSPORT_TDMA_CONTROL_SW_BRCM_TAG_M              FIELD_MASK(1,16)
#define SYSPORT_TDMA_CONTROL_WNC_PKT_SIZE_UPDATE_MODE   FIELD_MASK(1,17)
#define SYSPORT_TDMA_CONTROL_SYNC_PKT_SIZE_UPDATE_MODE  FIELD_MASK(1,18)
#define SYSPORT_TDMA_CONTROL_RING_CFG_M                 FIELD_MASK(1,19)
#define SYSPORT_TDMA_CONTROL_MAX_INFLIGHT_PBUFDMA       FIELD_MASK(5,22)
#define SYSPORT_TDMA_CONTROL_ACB_EN_M                   FIELD_MASK(1,27)
#define SYSPORT_TDMA_CONTROL_CSB_WR_EN                  FIELD_MASK(1,28)
#define SYSPORT_TDMA_CONTROL_TPD_16b_EN                 FIELD_MASK(1,29)

#define SYSPORT_TDMA_DESC_RING_CONTROL_FLUSH_M          FIELD_MASK(1,0)
#define SYSPORT_TDMA_DESC_RING_CONTROL_RING_EN_M        FIELD_MASK(1,1)

#define SYSPORT_TDMA_DESC_RING_INTR_CONTROL_THRESHOLD_S      0
#define SYSPORT_TDMA_DESC_RING_INTR_CONTROL_EMPTY_INTR_EN_M  FIELD_MASK(1,15)
#define SYSPORT_TDMA_DESC_RING_INTR_CONTROL_TIMEOUT_S        16

#define SYSPORT_TDMA_DESC_RING_MAPPING_QID_M            FIELD_MASK(3,0)
#define SYSPORT_TDMA_DESC_RING_MAPPING_QID_S            0
#define SYSPORT_TDMA_DESC_RING_MAPPING_PORT_ID_S        3
#define SYSPORT_TDMA_DESC_RING_MAPPING_IGNORE_STATUS_M  FIELD_MASK(1,6)
#define SYSPORT_TDMA_DESC_RING_MAPPING_CREDIT_S         8

#define SYSTEMPORT_TDMA_ARBITER_MODE_SP           0
#define SYSTEMPORT_TDMA_ARBITER_MODE_RR           1
#define SYSTEMPORT_TDMA_ARBITER_MODE_WRR          2
#define SYSTEMPORT_TDMA_ARBITER_MODE_DRR          3

#define SYSPORT_TDMA_STATUS_TDMA_DISABLED_M       FIELD_MASK(1,0)
#define SYSPORT_TDMA_STATUS_LL_RAM_INIT_BUSY_M    FIELD_MASK(1,1)

#define SYSTEMPORT_TDMA_DDR_DESC_RING_PUSH_TIMER_TIMEOUT_M  FIELD_MASK(16,0)

#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_CREDIT_M             FIELD_MASK(16,4)
#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_CREDIT_S             4
#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_IGNORE_CONGESTION_M  FIELD_MASK(1,2)
#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_IGNORE_CONGESTION_S  2
#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_ARB_MODE_M           FIELD_MASK(2,0)
#define SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL_ARB_MODE_S           0

#define SYSPORT_TDMA_CSB_INTR_CFG_THRESHOLD_M     FIELD_MASK(16,0)
#define SYSPORT_TDMA_CSB_INTR_CFG_THRESHOLD_S     0
#define SYSPORT_TDMA_CSB_INTR_CFG_TIMEOUT_M       FIELD_MASK(16,16)
#define SYSPORT_TDMA_CSB_INTR_CFG_TIMEOUT_S       16

typedef struct sys_port_tdma {
    systemport_tdma_descriptor_write_port SYSTEMPORT_TDMA_DESCRIPTOR_WRITE_PORT[32];
    systemport_tdma_descriptor_read_port  SYSTEMPORT_TDMA_DESCRIPTOR_READ_PORT[32];
#define SYSTEMPORT_TDMA_DESC_RING_CONTROL_RING_EN 0x02
    uint32_t SYSTEMPORT_TDMA_DESC_RING_CONTROL[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_HEAD_TAIL_PTR[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_COUNT[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_MAX_THRESHOLD[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_INTR_CONTROL[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_PRODUCER_CONSUMER_INDEX[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_MAPPING[32];
    uint32_t SYSTEMPORT_TDMA_DESC_RING_PCP_DEI_VID[32];
    uint32_t SYSTEMPORT_TDMA_DDR_DESC_RING_START[64];
    uint32_t SYSTEMPORT_TDMA_DDR_DESC_RING_SIZE[32];
    uint32_t SYSTEMPORT_TDMA_DDR_DESC_RING_CTRL[32];
    uint32_t SYSTEMPORT_TDMA_DDR_DESC_RING_PUSH_TIMER[32];
    uint32_t SYSTEMPORT_TDMA_DESC_READ_CMD;
    uint32_t SYSTEMPORT_TDMA_CONTROL;
    uint32_t SYSTEMPORT_TDMA_STATUS;
    uint32_t SYSTEMPORT_TDMA_SYSBUS_BURST;
    uint32_t SYSTEMPORT_TDMA_TIER1_ARBITER_CTRL[8];
    uint32_t SYSTEMPORT_TDMA_TIER1_ARBITER_QUEUE_ENABLE[8];
    uint32_t SYSTEMPORT_TDMA_TIER2_ARBITER_CTRL;
    uint32_t SYSTEMPORT_TDMA_OVER_MAX_THRESHOLD_STATUS;
    uint32_t SYSTEMPORT_TDMA_OVER_HYST_THRESHOLD_STATUS;
    uint32_t SYSTEMPORT_TDMA_TPID;
    uint32_t SYSTEMPORT_TDMA_FREE_LIST_HEAD_TAIL_PTR;
    uint32_t SYSTEMPORT_TDMA_FREE_LIST_COUNT;
    uint32_t SYSTEMPORT_TDMA_CSB_INTR_CFG;
    uint32_t SYSTEMPORT_TDMA_CSB_ADDR_LO;
    uint32_t SYSTEMPORT_TDMA_CSB_ADDR_HI;
    uint32_t SYSTEMPORT_TDMA_TEST;
    uint32_t SYSTEMPORT_TDMA_DEBUG;

}sys_port_tdma, SYSTEMPORT_TDMA;

#define SYSPORT_SPE_SPE_CNTRL_SPE_EN_M                      FIELD_MASK(1,0)

#define SYSTEMPORT_SPE_SPE_CACHE_CMD_COMMAND_LIST_INDEX_M   FIELD_MASK(16,0)
#define SYSTEMPORT_SPE_SPE_CACHE_CMD_CMD_M                  FIELD_MASK(2,16)
#define SYSTEMPORT_SPE_SPE_CACHE_CMD_CMD_S                  16
#define SYSTEMPORT_SPE_SPE_CACHE_CMD_START_BUSY_M           FIELD_MASK(1,18)

#define SYSTEMPORT_SPE_SPE_CACHE_CMD_CMD_INVALIDATE         0
#define SYSTEMPORT_SPE_SPE_CACHE_CMD_CMD_SET_STATIC         1
#define SYSTEMPORT_SPE_SPE_CACHE_CMD_CMD_CLEAR_STATIC       2

#define SYSTEMPORT_SPE_SPE_CACHE_CMD_COMMAND_LIST_INDEX_INVALID  0xFFFF

typedef struct sys_port_spe
{
    uint32_t SYSTEMPORT_SPE_SPE_CNTRL;
    uint32_t SYSTEMPORT_SPE_SPE_LFU_AW_MIN_PKT_COUNT;
    uint32_t SYSTEMPORT_SPE_SPE_LFU_AW_CNTRL_PERIOD;
    uint8_t  dummy_1[64];
    uint32_t SYSTEMPORT_SPE_SPE_CACHE_ENTRY_VALID_STATUS;
    uint32_t SYSTEMPORT_SPE_SPE_CACHE_CMD;
    uint32_t SYSTEMPORT_SPE_SPE_DDR_CMD_LIST_ARRAY_START_ADDR_LOW;
    uint32_t SYSTEMPORT_SPE_SPE_DDR_CMD_LIST_ARRAY_START_ADDR_HIGH;
    uint32_t SYSTEMPORT_SPE_SPE_SOP_POINTER;
    uint32_t SYSTEMPORT_SPE_SPE_CACHE_MISS_COUNTER;
    uint32_t SYSTEMPORT_SPE_SPE_CACHE_HIT_COUNTER;
    uint8_t  dummy_2[152];
    uint32_t SYSTEMPORT_SPE_SPE_CACHE_ENTRY_KEY[32];
    uint8_t  dummy_3[128];
    uint32_t SYSTEMPORT_SPE_SPE_REFERENCE_COUNT[32];
}sys_port_spe,SYSTEMPORT_SPE;

#define SYSPORT_TOPCTRL_MISC_CNTL_PM_CLK_DIV_M            FIELD_MASK(8,8)
#define SYSPORT_TOPCTRL_MISC_CNTL_PM_CLK_DIV_S            8

#define SYSPORT_TOPCTRL_PM_CNTL_EEE_EN_M                  FIELD_MASK(1,0)
#define SYSPORT_TOPCTRL_PM_CNTL_TX_PM_EN_M                FIELD_MASK(1,1)
#define SYSPORT_TOPCTRL_PM_CNTL_RX_PM_EN_M                FIELD_MASK(1,2)

#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_RSB_SWAP_M          FIELD_MASK(2,0)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_RSB_SWAP_S          0
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_TSB_SWAP_M          FIELD_MASK(2,2)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_TSB_SWAP_S          2
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_RX_DDR_DESC_SWAP_M  FIELD_MASK(2,4)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_RX_DDR_DESC_SWAP_S  4
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_TX_DDR_DESC_SWAP_M  FIELD_MASK(2,6)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_TX_DDR_DESC_SWAP_S  6
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_PSB_SWAP_M          FIELD_MASK(2,8)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_PSB_SWAP_S          8
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_CSB_SWAP_M          FIELD_MASK(2,10)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_CSB_SWAP_S          10
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SPE_SWAP_M          FIELD_MASK(2,12)
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SPE_SWAP_S          12

#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SWAP_NONE    0
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SWAP_32      1
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SWAP_64      2
#define SYSPORT_TOPCTRL_MISC_SWAP_CFG_SWAP_32_64   3

#define SYSTEMPORT_CLOCK_FREQUENCY  250 // MHz

typedef struct sys_port_topctrl {
    uint32_t SYSTEMPORT_TOPCTRL_REV_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_RX_FLUSH_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_TX_FLUSH_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_MISC_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_PM_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_PM_STATUS;
    uint32_t SYSTEMPORT_TOPCTRL_TIMER_TICK_CNTL;
    uint32_t SYSTEMPORT_TOPCTRL_WR_REPLY_CFG;
    uint32_t SYSTEMPORT_TOPCTRL_MISC_SWAP_CFG;
    uint32_t SYSTEMPORT_TOPCTRL_UMAC_RXERR_MASK;
    uint32_t SYSTEMPORT_TOPCTRL_MIB_MAX_PKT_SIZE;
    uint32_t SYSTEMPORT_TOPCTRL_TIMER0_TIMEOUT_PERIOD;
    uint32_t SYSTEMPORT_TOPCTRL_TIMER1_TIMEOUT_PERIOD;
}sys_port_topctrl, SYSTEMPORT_TOPCTRL;

typedef struct sys_port_sysbuscfg {
    uint32_t SYSTEMPORT_SYSBUSCFG_TIER1_TX_ARB_CFG;
    uint32_t SYSTEMPORT_SYSBUSCFG_TIER1_RX_ARB_CFG;
    uint32_t SYSTEMPORT_SYSBUSCFG_TIER2_ARB_CFG;
    uint32_t SYSTEMPORT_SYSBUSCFG_ARB_CONTROL;
    uint32_t SYSTEMPORT_SYSBUSCFG_U2R_BRIDGE_CONTROL;
    uint32_t SYSTEMPORT_SYSBUSCFG_DIAG;
}sys_port_sysbuscfg, SYSTEMPORT_SYSBUSCFG;

typedef struct sys_port_rxchk {
    uint32_t SYSTEMPORT_RXCHK_CONTROL;//0x80490300
    uint32_t SYSTEMPORT_RXCHK_BRCM_TAG[8];//0x80490304 - 0x80490320
    uint32_t SYSTEMPORT_RXCHK_BRCM_TAG_MASK[8];//0x80490324 - 0x80490340
    uint32_t SYSTEMPORT_RXCHK_BRCM_TAG_MATCH_STATUS;//0x80490344
    uint32_t SYSTEMPORT_RXCHK_ETHERTYPE;//0x80490348
    uint32_t SYSTEMPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING;//0x8049034c
    uint32_t SYSTEMPORT_RXCHK_MLT_CONFIG;//0x80490350
    uint32_t SYSTEMPORT_RXCHK_RX_QUEUE_MAPPING;//0x80490354
    uint32_t SYSTEMPORT_RXCHK_MLT_CMDDATA1;//0x80490358
    uint32_t SYSTEMPORT_RXCHK_MLT_DATA0;//0x8049035c
    uint32_t SYSTEMPORT_RXCHK_BAD_CHECKSUM_PACKET_DISCARD_COUNTER;//0x80490360
    uint32_t SYSTEMPORT_RXCHK_OTHER_PACKET_DISCARD_COUNTER;//0x80490364
    uint32_t SYSTEMPORT_RXCHK_RSB32BX_CFG1;//0x80490368
    uint32_t SYSTEMPORT_RXCHK_RSB32BX_CFG2;//0x8049036c
}sys_port_rxchk, SYSTEMPORT_RXCHK;

#define SYSPORT_RXCHK_CONTROL_RCHK_EN_M                   FIELD_MASK(1,0)
#define SYSPORT_RXCHK_CONTROL_SKIP_FCS_M                  FIELD_MASK(1,1)
#define SYSPORT_RXCHK_CONTROL_BAD_CHKSUM_DISCARD_EN_M     FIELD_MASK(1,2)
#define SYSPORT_RXCHK_CONTROL_BRCM_TAG_EN_M               FIELD_MASK(1,3)
#define SYSPORT_RXCHK_CONTROL_BRCM_TAG_MATCH_EN_M         FIELD_MASK(8,4)
#define SYSPORT_RXCHK_CONTROL_PARSE_TUNNELED_IP_M         FIELD_MASK(1,12)
#define SYSPORT_RXCHK_CONTROL_STRUCT_VIOL_EN_M            FIELD_MASK(1,13)
#define SYSPORT_RXCHK_CONTROL_STRUCT_VIOL_ACT_M           FIELD_MASK(1,14)
#define SYSPORT_RXCHK_CONTROL_INCOMPLETE_PACKET_ACT_M     FIELD_MASK(1,15)
#define SYSPORT_RXCHK_CONTROL_IPV6_DUP_EXTHDR_EN_M        FIELD_MASK(1,16)
#define SYSPORT_RXCHK_CONTROL_IPV6_DUP_EXTHDR_ACT_M       FIELD_MASK(1,17)
#define SYSPORT_RXCHK_CONTROL_UNEXPECTED_ETHTYPE_ACT_M    FIELD_MASK(1,18)
#define SYSPORT_RXCHK_CONTROL_LLCSNAP_HDR_ERR_ACT_M       FIELD_MASK(1,19)
#define SYSPORT_RXCHK_CONTROL_PPPOE_HDR_ERR_ACT_M         FIELD_MASK(1,20)
#define SYSPORT_RXCHK_CONTROL_L3_HDR_ERR_ACT_M            FIELD_MASK(1,21)
#define SYSPORT_RXCHK_CONTROL_MAC_RX_ERR_ACT_M            FIELD_MASK(1,22)
#define SYSPORT_RXCHK_CONTROL_PARSE_AUTH_M                FIELD_MASK(1,23)
#define SYSPORT_RXCHK_CONTROL_USE_IPV4DATALEN_M           FIELD_MASK(1,24)
#define SYSPORT_RXCHK_CONTROL_USE_IPV6DATALEN_M           FIELD_MASK(1,25)
#define SYSPORT_RXCHK_CONTROL_ARP_INTR_EN_M               FIELD_MASK(1,26)
#define SYSPORT_RXCHK_CONTROL_MLT_EN_M                    FIELD_MASK(1,27)

#define SYSPORT_RXCHK_MLT_CONFIG_DEFAULT_SRC_PORT_M       FIELD_MASK(3,0)
#define SYSPORT_RXCHK_MLT_CONFIG_DEFAULT_SRC_PORT_S       0
#define SYSPORT_RXCHK_MLT_CONFIG_SRC_PORT_IS_WAN_M        FIELD_MASK(1,3)
#define SYSPORT_RXCHK_MLT_CONFIG_LAN_DLF_RXQ_M            FIELD_MASK(3,4)
#define SYSPORT_RXCHK_MLT_CONFIG_LAN_DLF_RXQ_S            4
#define SYSPORT_RXCHK_MLT_CONFIG_WAN_DLF_RXQ_M            FIELD_MASK(3,8)
#define SYSPORT_RXCHK_MLT_CONFIG_WAN_DLF_RXQ_S            8

#define SYSPORT_RXCHK_MLT_CMDDATA1_DATA1_M                FIELD_MASK(21,0)
#define SYSPORT_RXCHK_MLT_CMDDATA1_DATA1_S                0
#define SYSPORT_RXCHK_MLT_CMDDATA1_MATCH_STATUS_M         FIELD_MASK(1,21)
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_M                  FIELD_MASK(4,24)
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_S                  24
#define SYSPORT_RXCHK_MLT_CMDDATA1_START_BUSY_M           FIELD_MASK(1,28)

#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_WR                 0
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_CAMWR              1
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_RDIDX              2
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_SEARCH             3
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_CLR                4
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_CLRIDX             5
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_INIT_HASHTAB       6
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_INIT_CAM           7
#define SYSPORT_RXCHK_MLT_CMDDATA1_CMD_INIT_ALL           8

#define SYSPORT_RXCHK_RSB32BX_CFG1_MAC_SA_EN_M            FIELD_MASK(1,0)
#define SYSPORT_RXCHK_RSB32BX_CFG1_MAX_VLAN_M             FIELD_MASK(3,1)
#define SYSPORT_RXCHK_RSB32BX_CFG1_MAX_VLAN_S             1
#define SYSPORT_RXCHK_RSB32BX_CFG1_L3_FORCE_M             FIELD_MASK(1,4)

#define SYSPORT_RXCHK_RSB32BX_CFG2_L3UCAST_TOS_EN_VECT_M  FIELD_MASK(8,0)
#define SYSPORT_RXCHK_RSB32BX_CFG2_L3UCAST_TOS_EN_VECT_S  0
#define SYSPORT_RXCHK_RSB32BX_CFG2_L2UCAST_TOS_EN_VECT_M  FIELD_MASK(8,8)
#define SYSPORT_RXCHK_RSB32BX_CFG2_L2UCAST_TOS_EN_VECT_S  8
#define SYSPORT_RXCHK_RSB32BX_CFG2_VLAN_DEI_EN_M          FIELD_MASK(1,16)
#define SYSPORT_RXCHK_RSB32BX_CFG2_VLAN_PCP_EN_M          FIELD_MASK(1,17)

#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN0_PORT_ID_M            FIELD_MASK(4,0)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN0_PORT_ID_S            0
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN0_PORT_ENABLE_M        FIELD_MASK(1,4)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN0_PORT_MAP_ENABLE_M    FIELD_MASK(1,5)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN1_PORT_ID_M            FIELD_MASK(4,8)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN1_PORT_ID_S            8
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN1_PORT_ENABLE_M        FIELD_MASK(1,12)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_WAN1_PORT_MAP_ENABLE_M    FIELD_MASK(1,13)
#define SYSPORT_RXCHK_WAN_PORT_AND_HOST_CPU_MAPPING_HOST_CPU_TC_M             FIELD_MASK(3,16)

typedef struct sysport {
    union {
        SYSTEMPORT_TOPCTRL SYSTEMPORT_TOPCTRL;
        uint8_t SYSTEMPORT_TOPCTRL_buf[64];//0x80500000
    };
    union {
        SYSTEMPORT_SYSBUSCFG SYSTEMPORT_SYSBUSCFG;
        uint8_t SYSTEMPORT_SYSBUSCFG_buf[704];//0x80500040
    };
    union {
        SYSTEMPORT_RXCHK SYSTEMPORT_RXCHK;
        uint8_t SYSTEMPORT_RXCHK_buf[256];//0x80500300
    };
    union {
        SYSTEMPORT_RBUF SYSTEMPORT_RBUF;
        uint8_t SYSTEMPORT_RBUF_buf[512];//0x80500400
    };
    union {
        SYSTEMPORT_TBUF SYSTEMPORT_TBUF;
        uint8_t SYSTEMPORT_TBUF_buf[512];//0x80500600
    };
    union {
        SYSTEMPORT_UNIMAC SYSTEMPORT_UNIMAC;
        uint8_t SYSTEMPORT_UNIMAC_buf[1024];//0x80500800
    };
    union {
        uint8_t SYSTEMPORT_MIB_COUNTERS_buf[512];//0x80500c00
    };
    union {
        SYSTEMPORT_MPD SYSTEMPORT_MPD;
        uint8_t SYSTEMPORT_MPD_buf[4608];//0x80500e00
    };
    union {
        SYSTEMPORT_RDMA SYSTEMPORT_RDMA;
        uint8_t SYSTEMPORT_RDMA_buf[8192];//0x80502000
    };
    union {
        SYSTEMPORT_TDMA SYSTEMPORT_TDMA;
        uint8_t SYSTEMPORT_TDMA_buf[8192];//0x80504000
    };
    union {
        SYSTEMPORT_SPE SYSTEMPORT_SPE;
        uint8_t SYSTEMPORT_SPE_buf[8704];//0x80506000
    };
    union {
        SYSTEMPORT_INTRL2 SYSTEMPORT_INTRL2[5];
        uint8_t SYSTEMPORT_INTRL_0_buf[256];//0x80508200
    };
    union {
        SYSTEMPORT_INTC SYSTEMPORT_INTC[5];
        uint8_t SYSTEMPORT_INTC_1_buf[256];//0x80508300
    };
    union {
        SYSTEMPORT_INTRL2 SYSTEMPORT_INTRL2_MISC_RX;
        uint8_t SYSTEMPORT_INTRL_MISC_RX_buf[256];//0x80508400
    };
    union {
        SYSTEMPORT_INTRL2 SYSTEMPORT_INTRL2_MISC_TX;
        uint8_t SYSTEMPORT_INTRL_MISC_TX_buf[31488];//0x80508500
    };
    union {
        uint8_t SYSTEMPORT_LED_REG_buf[1280];//0x80510000
    };
    union {
        SYSTEMPORT_X_INTRL2_PHY SYSTEMPORT_1_INTRL2_PHY;
        uint8_t SYSTEMPORT_1_INTRL2_PHY_buf[2816];//0x80510500
    };
    union {
        uint8_t SYSTEMPORT_MISC_buf[768];//0x80511000
    };
    union {
        uint8_t SYSTEMPORT_MDIO_buf[16];//0x80511300
    };
} sysport;

#endif /* __47622_SYSPORT_H__ */
