/*
<:copyright-broadcom 
 
 Copyright (c) 2007 Broadcom Corporation 
 All Rights Reserved 
 No portions of this material may be reproduced in any form without the 
 written permission of: 
          Broadcom Corporation 
          5300 California Avenue
          Irvine, California 92617 
 All information contained in this document is Broadcom Corporation 
 company private, proprietary, and trade secret. 
 
:>
*/
/***************************************************************************
 * File Name  : XtmProcRegs.h
 *
 * Description: This file contains definitions for the ATM/PTM processor
 *              registers.
 ***************************************************************************/

#if !defined(_XTMPROCREGS_H_)
#define _XTMPROCREGS_H_

/* Miscellaneous values. */
#define XP_MAX_PORTS                        4
#define XP_MAX_CONNS                        16
#define XP_MAX_RX_QUEUES                    4
#define XP_MAX_TX_HDRS                      8
#define XP_TX_HDR_WORDS                     (16 / sizeof(UINT32))
#define XP_RX_MIB_MATCH_ENTRIES             128

/* Circuit types. */
#define XCT_TRANSPARENT                     0x00000001
#define XCT_AAL0_PKT                        0x00000002
#define XCT_AAL0_CELL                       0x00000003
#define XCT_OAM_F5_SEG                      0x00000004
#define XCT_OAM_F5_E2E                      0x00000005
#define XCT_RM                              0x00000006
#define XCT_AAL5                            0x00000007

#define PBSTART_0_SHIFT                     0
#define PBSTART_1_MASK                      0xffff0000
#define PBSTART_1_SHIFT                     16

/* Definitions for ulRxPktBufFifoStop[2]. */
#define PBSTOP_0_MASK                       0x0000ffff
#define PBSTOP_0_SHIFT                      0
#define PBSTOP_1_MASK                       0xffff0000
#define PBSTOP_1_SHIFT                      16

/* Definitions for ulRxPktBufFifoDelay[2]. */
#define PBDELAY_0_MASK                      0x0000ffff
#define PBDELAY_0_SHIFT                     0
#define PBDELAY_1_MASK                      0xffff0000
#define PBDELAY_1_SHIFT                     16

/* Definitions for ulRxPktBufQueueStatus. */
#define PBQS_NUM_NO_BUFS_MASK               0x0000ffff
#define PBQS_NUM_NO_BUFS_SHIFT              0
#define PBQS_NUM_QUEUE_FULL_MASK            0xffff0000
#define PBQS_NUM_QUEUE_FULL_SHIFT           16

/* Definitions for ulRxPktBufErrorStatus. */
#define PBERR_NUM_ERROR_FRAGS_MASK          0x0000ffff
#define PBERR_NUM_ERROR_FRAGS_SHIFT         0
#define PBERR_NUM_ERROR_PKTS_MASK           0xffff0000
#define PBERR_NUM_ERROR_PKTS_SHIFT          16

/* Definitions for ulRxPktBufTR. */
#define PBTR_LD_T_PTR_MASK                  0x0000ffff
#define PBTR_LD_T_PTR_SHIFT                 0
#define PBTR_LD_H_PTR_MASK                  0xffff0000
#define PBTR_LD_H_PTR_SHIFT                 16

/* Definitions for ulRxPktBufFPM. */
#define PBFPM_FRAME_BUF_MASK                0x0000ffff
#define PBFPM_FRAME_BUF_SHIFT               0
#define PBFPM_LOAD_COUNT_MASK               0xffff0000
#define PBFPM_LOAD_COUNT_SHIFT              16

/* Definitions for ulRxPktBufMibCtrl. */
#define PBMIB_TOGGLE                        0x40000000
#define PBMIB_CLEAR                         0x80000000

/* Definitions for ulRxPktBufMibMatch. */
#define PBMIB_MATCH_MASK                    0x0000007f

/* Definitions for ulTxHdrInsert. */
#define TXHDR_COUNT_MASK                    0x0000001f
#define TXHDR_COUNT_SHIFT                   0
#define TXHDR_OFFSET_MASK                   0x00ff0000
#define TXHDR_OFFSET_SHIFT                  16

/* Definitions for ulTxRxPortOamCellCnt. */
#define OAM_TX_CELL_COUNT_MASK              0x0000ffff
#define OAM_TX_CELL_COUNT_SHIFT             0
#define OAM_RX_CELL_COUNT_MASK              0xffff0000
#define OAM_RX_CELL_COUNT_SHIFT             16

/* Definitions for ulTxRxPortAsmCellCnt. */
#define ASM_TX_CELL_COUNT_MASK              0x0000ffff
#define ASM_TX_CELL_COUNT_SHIFT             0
#define ASM_RX_CELL_COUNT_MASK              0xffff0000
#define ASM_RX_CELL_COUNT_SHIFT             16

/* Definitions for ulRxPortErrorPktCellCnt. */
#define ERROR_RX_CELL_COUNT_MASK            0x0000ffff
#define ERROR_RX_CELL_COUNT_SHIFT           0
#define ERROR_RX_PKT_COUNT_MASK             0xffff0000
#define ERROR_RX_PKT_COUNT_SHIFT            16


#if defined(CONFIG_BCM96328) || defined(CONFIG_BCM96362)
#define XTM_PROCESSOR_BASE                                       0xb0007800
#endif
typedef struct XtmProcessorRegisters
{
    UINT32 ulTxChannelCfg[XP_MAX_CONNS];                            /* 0000 */
    UINT32 ulSwitchPktCfg;                                          /* 0040 */
    UINT32 ulSwitchPktTxCtrl;                                       /* 0044 */
    UINT32 ulSwitchPktRxCtrl;                                       /* 0048 */
    UINT32 ulPktModCtrl;                                            /* 004c */
    UINT32 ulIrqStatus;                                             /* 0050 */
    UINT32 ulIrqMask;                                               /* 0054 */
    UINT32 ulReserved1[2];                                          /* 0058 */
    UINT32 ulTxSarCfg;                                              /* 0060 */
    UINT32 ulTxSchedCfg;                                            /* 0064 */
    UINT32 ulTxOamCfg;                                              /* 0068 */
    UINT32 ulTxAtmStatus;                                           /* 006c */
    UINT32 ulTxAalStatus;                                           /* 0070 */
    UINT32 ulTxMpAalCfg;                                            /* 0074 */
    UINT32 ulTxUtopiaCfg;                                           /* 0078 */
    UINT32 ulTxLineRateTimer;                                       /* 007c */
    UINT32 ulRxAtmCfg[XP_MAX_PORTS];                                /* 0080 */
    UINT32 ulRxSarCfg;                                              /* 0090 */
    UINT32 ulRxOamCfg;                                              /* 0094 */
    UINT32 ulRxAtmStatus;                                           /* 0098 */
    UINT32 ulRxUtopiaCfg;                                           /* 009c */
    UINT32 ulRxAalCfg;                                              /* 00a0 */
    UINT32 ulRxAalMaxSdu;                                           /* 00a4 */
    UINT32 ulRxAalStatus;                                           /* 00a8 */
    UINT32 ulLedCtrl;                                               /* 00ac */
    UINT32 ulReserved2[20];                                         /* 00b0 */
    UINT32 ulTxVpiVciTable[XP_MAX_CONNS];                           /* 0100 */
    UINT32 ulRxVpiVciCam[XP_MAX_CONNS * 2];                         /* 0140 */
    UINT32 ulReserved3[16];                                         /* 01c0 */
    UINT32 ulSstCtrl[XP_MAX_CONNS];                                 /* 0200 */
    UINT32 ulSstPcrScr[XP_MAX_CONNS];                               /* 0240 */
    UINT32 ulSstBt[XP_MAX_CONNS];                                   /* 0280 */
    UINT32 ulSstBucketCnt[XP_MAX_CONNS];                            /* 02c0 */
    UINT32 ulRxPktBufCfg;                                           /* 0300 */
    UINT32 ulRxPktBufThreshold;                                     /* 0304 */
    UINT32 ulRxPktBufVcid;                                          /* 0308 */
    UINT32 ulRxPktBufMem;                                           /* 030c */
    UINT32 ulRxPktBufData[2];                                       /* 0310 */
    UINT32 ulRxPktBufPtr;                                           /* 0318 */
    UINT32 ulRxPktBufSize;                                          /* 031c */
    UINT32 ulRxPktBufFifoStart[2];                                  /* 0320 */
    UINT32 ulRxPktBufFifoStop[2];                                   /* 0328 */
    UINT32 ulRxPktBufFifoDelay[2];                                  /* 0330 */
    UINT32 ulRxPktBufQueueStatus;                                   /* 0338 */
    UINT32 ulRxPktBufErrorStatus;                                   /* 033c */
    UINT32 ulRxPktBufTR;                                            /* 0340 */
    UINT32 ulRxPktBufFPM;                                           /* 0344 */
    UINT32 ulRxPktBufMibCtrl;                                       /* 0348 */
    UINT32 ulRxPktBufMibMatch;                                      /* 034c */
    UINT32 ulRxPktBufMibRxOctet;                                    /* 0350 */
    UINT32 ulRxPktBufMibRxPkt;                                      /* 0354 */
    UINT32 ulReserved4[106];                                        /* 0358 */
    UINT32 ulTxHdrInsert[XP_MAX_TX_HDRS];                           /* 0500 */
    UINT32 ulReserved5[24];                                         /* 0520 */
    UINT32 ulTxHdrValues[XP_MAX_TX_HDRS][XP_TX_HDR_WORDS];          /* 0580 */
    UINT32 ulTxPortPktOctCnt[XP_MAX_PORTS];                         /* 0600 */
    UINT32 ulRxPortPktOctCnt[XP_MAX_PORTS];                         /* 0610 */
    UINT32 ulTxPortPktCnt[XP_MAX_PORTS];                            /* 0620 */
    UINT32 ulRxPortPktCnt[XP_MAX_PORTS];                            /* 0630 */
    UINT32 ulTxRxPortOamCellCnt[XP_MAX_PORTS];                      /* 0640 */
    UINT32 ulTxRxPortAsmCellCnt[XP_MAX_PORTS];                      /* 0650 */
    UINT32 ulRxPortErrorPktCellCnt[XP_MAX_PORTS];                   /* 0660 */
    UINT32 ulBondInputCellCnt;                                      /* 0670 */
    UINT32 ulBondOutputCellCnt;                                     /* 0674 */
    UINT32 ulReserved6[1];                                          /* 0678 */
    UINT32 ulMibCtrl;                                               /* 067c */
    UINT32 ulTxVcPktOctCnt[XP_MAX_CONNS];                           /* 0680 */
} XTM_PROCESSOR_REGISTERS, *PXTM_PROCESSOR_REGISTERS;

#define XP_REGS ((volatile PXTM_PROCESSOR_REGISTERS const) XTM_PROCESSOR_BASE)

/* Definitions from pktCmfHw.h.  TBD. Use commoon header file. */
#ifndef PKTCMF_OFFSET_ENGINE_SAR
#if defined(CONFIG_BCM96362) || defined(CONFIG_BCM96328)
#define PKTCMF_OFFSET_ENGINE_SAR        0xB0008000
#endif
#endif
#define PKTCMF_OFFSET_RXFILT            0x00001B00
#define RXFILT_REG_MATCH0_DEF_ID        0x0000000C /* 7b/VCID 03..00 */
#define RXFILT_REG_MATCH1_DEF_ID        0x00000010 /* 7b/VCID 07..04 */
#define RXFILT_REG_MATCH2_DEF_ID        0x00000014 /* 7b/VCID 11..08 */
#define RXFILT_REG_MATCH3_DEF_ID        0x00000018 /* 7b/VCID 15..12 */

#define RXFILT_REG_VCID0_QID            0x00000004 /* 2b/VCID 15..00 */
#define RXFILT_REG_VCID1_QID            0x00000008 /* 2b VCID=    16 */

#endif /* _XTMPROCREGS_H_ */

