// SPDX-License-Identifier: GPL-2.0+
/*
   Copyright (c) 2017 Broadcom Corporation
   All Rights Reserved

   */
/*
 * xport_drv.c
 *
 */

//includes
#include <linux/delay.h>
#include "xport_ag.h"
#include "xport_drv.h"
#include "xport_intr.h"

#define UDELAY udelay

void __iomem *xport_phys_base;
void __iomem *xport_virt_base;
void __iomem *xlif_virt_base;

static void remap_ru_block_single_virtbase(const ru_block_rec *ru_block, uintptr_t virt_offset)
{
    uint32_t addr_itr;
    uintptr_t phys_addr, virt_addr;

    for (addr_itr = 0; addr_itr < ru_block->addr_count; addr_itr++)
    {
        phys_addr = ru_block->addr[addr_itr];
        virt_addr = ru_block->addr[addr_itr] + virt_offset;
        ru_block->addr[addr_itr] = virt_addr;

        pr_debug("%-11s %1d Remapped physical 0x%lx to virtual 0x%lx\n",
            ru_block->name, addr_itr, phys_addr, virt_addr);
    }
}

/* This function is a utility to fix virtual address of the RU/HAL based driver.
 * After calling this function all RU addresses will turn virtual and no translation is needed during read/write
 * ru_blocks[] is the main ru object of the xport block
 */
static void remap_ru_block_addrs(void)
{
    const ru_block_rec **ru_blocks = RU_XPORT_BLOCKS;
    uint32_t blk;
    uintptr_t virt_offset = xport_virt_base - xport_phys_base;

    for (blk = 0; ru_blocks[blk]; blk++)
    {
        remap_ru_block_single_virtbase(ru_blocks[blk], virt_offset);
    }
}

static int xport_probe(dt_device_t *pdev)
{
    int ret;

    xport_virt_base = dt_dev_remap(pdev, 0);
    if (IS_ERR(xport_virt_base))
    {
        ret = PTR_ERR(xport_virt_base);
        xport_virt_base = NULL;
        goto Exit;
    }

    xlif_virt_base = dt_dev_remap(pdev, 1);
    if (IS_ERR(xlif_virt_base))
    {
        ret = PTR_ERR(xlif_virt_base);
        xlif_virt_base = NULL;
        goto Exit;
    }

    xport_phys_base = dt_dev_read_addr(pdev ,0);
    if (!xport_phys_base)
    {
        ret = -1;
        goto Exit;
    }

    remap_ru_block_addrs();

    dev_info(&pdev->dev, "registered\n");

    return 0;

Exit:
    return ret;
}

static const struct udevice_id xport_ids[] = {
    { .compatible = "brcm,xport" },
    { /* end of list */ },
};

U_BOOT_DRIVER(brcm_xport) = {
    .name	= "brcm-xport",
    .id	= UCLASS_MISC,
    .of_match = xport_ids,
    .probe = xport_probe,
};

typedef struct
{
    uint32_t if_enable; 
    uint32_t read_credits; 
    uint32_t set_credits; 
    uint32_t out_ctrl; 
    uint32_t urun_port_enable;
    uint32_t tx_threshold;
} xlif_tx_if_t;

typedef struct
{
    uint32_t xlif_rx_if_channel[3];             // 0x00 - 0x0b
    uint32_t xlif_rsvd_1[5];                    // 0x0c - 0x1f
    uint32_t xlif_rx_flow_control_channel[2];   // 0x20 - 0x27
    uint32_t xlif_rsvd_2[6];                    // 0x28 - 0x3f
    xlif_tx_if_t xlif_tx_if_channel;            // 0x40 - 0x57
    uint32_t xlif_rsvd_3[2];                    // 0x58 - 0x5f
    uint32_t xlif_tx_flow_control_channel[2];   // 0x60 - 0x67
    uint32_t xlif_rsvd_4[2];                    // 0x68 - 0x6f
    uint32_t debug_bus_channel[1];              // 0x70 - 0x73
    uint32_t xlif_rsvd_5[1];                    // 0x74 - 0x77
    uint32_t xlif_eee_channel[1];               // 0x78 - 0x7b
    uint32_t q_off_channel[1];                  // 0x7c - 0x7f
    uint32_t xlif_rsvd_6[96];                   // 0x80 - 0x67f

} xlif_ch_t;

#define XLIF_REG ((volatile xlif_ch_t *)xlif_virt_base)

static int validate_xport_configuration(xport_xlmac_port_info_s *init_params)
{
    if (XPORT_PORT_VALID(init_params->xport_port_id))
    {
        return XPORT_ERR_OK;
    }
    return XPORT_ERR_INVALID;
}

static int xport_speed_to_xlmac(XPORT_PORT_RATE xport_speed)
{
    int ret = 0;

    switch (xport_speed)
    {
    case XPORT_RATE_10MB:
        ret = XLMAC_PORT_SPEED_10MB;
        break;
    case XPORT_RATE_100MB:
        ret = XLMAC_PORT_SPEED_100MB;
        break;
    case XPORT_RATE_1000MB:
        ret = XLMAC_PORT_SPEED_1000MB;
        break;
    case XPORT_RATE_2500MB:
        ret = XLMAC_PORT_SPEED_2500MB;
        break;
    case XPORT_RATE_5G:
#if !defined(CONFIG_BCM963158)
        ret = XLMAC_PORT_SPEED_5G;
#else
        /* 5G LED does not work, so borrow 10M LED color which is not used in real world */
