/*
<:copyright-BRCM:2013:proprietary:standard

   Copyright (c) 2013 Broadcom 
   All Rights Reserved

 This program is the proprietary software of Broadcom and/or its
 licensors, and may only be used, duplicated, modified or distributed pursuant
 to the terms and conditions of a separate, written license agreement executed
 between you and Broadcom (an "Authorized License").  Except as set forth in
 an Authorized License, Broadcom grants no license (express or implied), right
 to use, or waiver of any kind with respect to the Software, and Broadcom
 expressly reserves all rights in and to the Software and all intellectual
 property rights therein.  IF YOU HAVE NO AUTHORIZED LICENSE, THEN YOU HAVE
 NO RIGHT TO USE THIS SOFTWARE IN ANY WAY, AND SHOULD IMMEDIATELY NOTIFY
 BROADCOM AND DISCONTINUE ALL USE OF THE SOFTWARE.

 Except as expressly set forth in the Authorized License,

 1. This program, including its structure, sequence and organization,
    constitutes the valuable trade secrets of Broadcom, and you shall use
    all reasonable efforts to protect the confidentiality thereof, and to
    use this information only in connection with your use of Broadcom
    integrated circuit products.

 2. TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED "AS IS"
    AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES, REPRESENTATIONS OR
    WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH

    WAY RELATING TO YOUR USE OF OR INABILITY TO USE THE SOFTWARE EVEN
    IF BROADCOM HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES;
    OR (ii) ANY AMOUNT IN EXCESS OF THE AMOUNT ACTUALLY PAID FOR THE
    SOFTWARE ITSELF OR U.S. $1, WHICHEVER IS GREATER. THESE LIMITATIONS
    SHALL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY
    LIMITED REMEDY.
:>
*/
/***********************************************************************/
/*                                                                     */
/*   MODULE:  63148_map.h                                              */
/*   DATE:    09/05/13                                                 */
/*   PURPOSE: Define the proprietary hardware blocks/subblocks for     */
/*            BCM63148                                                 */
/*                                                                     */
/***********************************************************************/
#ifndef __BCM63148_MAP_H
#define __BCM63148_MAP_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__KERNEL__) || defined (_CFE_)
#define REG_BASE                 0x80000000
#define PER_BASE                 0xfffe0000
#else
/* Access to registers from userspace, see bcm_mmap.h for api */
#define REG_BASE                  (bcm_mmap_info.mmap_addr)
#define BCM_MMAP_INFO_BASE        0x80000000
#define BCM_MMAP_INFO_SIZE        0x00784000
#define PER_BASE                  (bcm_mmap_info.mmap_addr2)
#define BCM_MMAP_INFO_BASE2       0xfffe0000
#define BCM_MMAP_INFO_SIZE2       0x00020000
#endif

#include "bcmtypes.h"
#include "bcm_io_map.h"
#include "63148_common.h"
#include "63148_intr.h"
#include "63148_map_part.h"


#define PCM_PHYS_BASE                    (REG_BASE + 0x00100200)  /* PCM control registers */
#define APM_PCM_DMA_PHYS_BASE            (REG_BASE + 0x00100800)  /* APM/PCM DMA control registers */
#define BMU_PHYS_BASE                    (REG_BASE + 0x00101000)
#define APM_PICO_IMEM_PHYS_BASE          (REG_BASE + 0x00110000)
           
#define BROM_SEC_PHYS_BASE               (PER_BASE + 0x0000b600)
#define SRAM_SEC_PHYS_BASE               (PER_BASE + 0x0000b800)
#define PER_SEC_PHYS_BASE                (PER_BASE + 0x0000b820)
#define UART2_PHYS_BASE                  (REG_BASE + 0x00019000)  /* ARM UART base */

#define PCM_BASE                         BCM_IO_ADDR(PCM_PHYS_BASE)
#define APM_PCM_DMA_BASE                 BCM_IO_ADDR(APM_PCM_DMA_PHYS_BASE)
#define BMU_BASE                         BCM_IO_ADDR(BMU_PHYS_BASE)
#define APM_PICO_IMEM_BASE               BCM_IO_ADDR(APM_PICO_IMEM_PHYS_BASE)
#define BROM_SEC_BASE                    BCM_IO_ADDR(BROM_SEC_PHYS_BASE)
#define SRAM_SEC_BASE                    BCM_IO_ADDR(SRAM_SEC_PHYS_BASE)
#define PER_SEC_BASE                     BCM_IO_ADDR(PER_SEC_PHYS_BASE)
#define UART2_BASE                       BCM_IO_ADDR(UART2_PHYS_BASE)

#ifndef __ASSEMBLER__

#if defined(__KERNEL__) && !defined(MODULE)
#error "PRIVATE FILE INCLUDED IN KERNEL"
#endif

/*
 * PKA
 */
typedef struct Pka {
	uint32 status;		/* 0x00 */
	uint32 dataIn;		/* 0x04 */
	uint32 dataOut;		/* 0x08 */
	uint32 accessCtrl;	/* 0x0c */
	uint32 ScaLfsrSeed;	/* 0x10 */
	uint32 perm;		/* 0x14 */
} Pka;

#define PKA ((volatile Pka * const) PKA_BASE)

/*
 * AES engine
 */
typedef struct AESEngine {
	uint32 perm;		/* 0x00 */
	uint32 cfg;		/* 0x04 */
	uint32 key[8];		/* 0x08-0x24 */
	uint32 iv[4];		/* 0x28-0x34 */
	uint32 ififoData;	/* 0x38 */
	uint32 ififoDataEop;	/* 0x3c */
	uint32 ofifoData;	/* 0x40 */
	uint32 status;		/* 0x44 */
} AESEngine;

#define AES0 ((volatile AESEngine * const) AES0_BASE)
#define AES1 ((volatile AESEngine * const) AES1_BASE)


/*
 * Bootrom
 */
typedef struct BromSec {
	uint32 ctrl;
	uint32 rangeCheckCtrl0;
	uint32 rangeCheckCtrl1;
	uint32 rangeCheckCtrl2;
	uint32 rangeCheckCtrl3;
	uint32 cfg;
} BromSec;

#define BROMSEC ((volatile BromSec * const) BROM_SEC_BASE)


/*
 * SRAM Boot
 */
typedef struct SramSec {
	uint32 ctrl;
	uint32 sramRdyStatus;
} SramSec;

#define SRAMSEC ((volatile SramSec * const) SRAM_SEC_BASE)


/*
 * SRAM Boot
 */
typedef struct PerSec {
	uint32 rangeChkLogInfo0;
	uint32 rangeChkLogInfo1;
} PerSec;

#define PERSEC ((volatile PerSec * const) PER_SEC_BASE)



/*
 * JTAG Instruction OTP
 */
typedef struct JtagIotp {
	uint32 ctrl0;		/* 0x00 */
	uint32 ctrl1;		/* 0x04 */
	uint32 wrData0;		/* 0x08 */
	uint32 wrData1;		/* 0x0c */
	// FIXME! as of 2013/04/29 RDB, it skips ctrl2
	uint32 ctrl3;		/* 0x10 */
	uint32 ctrl4;		/* 0x14 */
	uint32 rdData0;		/* 0x18 */
	uint32 rdData1;		/* 0x1c */
	// FIXME! as of 2013/04/29 RDB, it skips status0
	uint32 status1;		/* 0x20 */
	uint32 status2;		/* 0x24 */
	uint32 status3;		/* 0x28 */
	uint32 status4;		/* 0x2c */
	uint32 status5;		/* 0x30 */
	uint32 status6;		/* 0x34 */
	uint32 status7;		/* 0x38 */
	uint32 status8;		/* 0x3c */
	uint32 status9;		/* 0x40 */
} JtagIotp;

#define JTAGIOTP ((volatile JtagIotp * const) JTAG_IOTP_BASE)

typedef struct SotpRegs {
   uint32 sotp_otp_prog_ctrl;            /* 0x00 */  
   uint32 sotp_otp_wdata_0;              /* 0x04 */
   uint32 sotp_otp_wdata_1;              /* 0x08 */
   uint32 sotp_otp_addr;                 /* 0x0c */
   uint32 sotp_otp_ctrl_0;               /* 0x10 */
   uint32 dummy1;                        /* 0x14 */  
   uint32 sotp_otp_status_0;             /* 0x18 */
   uint32 sotp_otp_status_1;             /* 0x1c */
   uint32 sotp_otp_rdata_0;              /* 0x20 */
   uint32 sotp_otp_rdata_1;              /* 0x24 */
   uint32 sotp_chip_states;              /* 0x28 */
   uint32 dummy2;                        /* 0x2c */  
   uint32 sotp_otp_ecccnt;               /* 0x30 */
   uint32 sotp_otp_bad_addr;             /* 0x34 */
   uint32 sotp_otp_wr_lock;              /* 0x38 */
   uint32 sotp_otp_rd_lock;              /* 0x3c */
   uint32 sotp_rom_block_start;          /* 0x40 */
   uint32 sotp_rom_block_end;            /* 0x44 */
   uint32 sotp_samu_cntrl;               /* 0x48 */
   uint32 sotp_chip_cntrl;               /* 0x4c */
   uint32 sotp_sr_state_0;               /* 0x50 */
   uint32 sotp_sr_state_1;               /* 0x54 */
   uint32 sotp_sr_state_2;               /* 0x58 */
   uint32 sotp_sr_state_3;               /* 0x5c */
   uint32 sotp_sr_state_4;               /* 0x60 */
   uint32 sotp_sr_state_5;               /* 0x64 */
   uint32 sotp_sr_state_6;               /* 0x68 */
   uint32 sotp_sr_state_7;               /* 0x6c */
   uint32 sotp_perm;                     /* 0x70 */
   uint32 sotp_sotp_out_0;               /* 0x74 */
   uint32 sotp_sotp_out_1;               /* 0x78 */
   uint32 sotp_sotp_out_2;               /* 0x7c */
   uint32 sotp_sotp_inout;               /* 0x80 */
} SotpRegs;
#define SOTP ((volatile SotpRegs * const) SOTP_BASE)

/*
 * Boot Section Look Up Table
 */
typedef struct BootLut {
	uint32 bootLut0;	/* 0x00 */
	uint32 bootLut1;	/* 0x04 */
	uint32 bootLut2;	/* 0x08 */
	uint32 bootLut3;	/* 0x0c */
	uint32 bootLut4;	/* 0x10 */
	uint32 bootLut5;	/* 0x14 */
	uint32 bootLut6;	/* 0x18 */
	uint32 bootLut7;	/* 0x1c */
	uint32 bootLutRst;	/* 0x20 */
	uint32 bootLutUnd;	/* 0x24 */
	uint32 bootLutSWI;	/* 0x28 */
	uint32 bootLutPrf;	/* 0x2c */
	uint32 bootLutAbt;	/* 0x30 */
	uint32 bootLutUnu;	/* 0x34 */
	uint32 bootLutIrq;	/* 0x38 */
	uint32 bootLutFiq;	/* 0x3c */
	uint32 bootLutPerm;	/* 0x40 */
	uint32 reserved0;	/* 0x44 */
	uint32 reserved1;	/* 0x48 */
	uint32 reserved2;	/* 0x4c */
} BootLut;

#define BOOTLUT ((volatile BootLut * const) BOOTLUT_BASE)


/*
** USB 2.0 Device Registers
*/
typedef struct UsbRegisters {
	uint32 usbd_control;		/* 0x00 */
#define USBD_CONTROL_APP_AUTO_CSRS	(1 << 13)
#define EN_RXZSCFG			(1 << 12) /* better naming? */
#define USBD_CONTROL_APP_FIFO_SEL_SHIFT	8
#define USBD_CONTROL_APP_FIFO_INIT_SEL(x)	(((x) & 0x0f) << USBD_CONTROL_APP_FIFO_SEL_SHIFT)
#define USBD_CONTROL_APP_TXFIFIO_INIT	(1 << 7)
#define USBD_CONTROL_APP_RXFIFIO_INIT	(1 << 6)
#define APPSETUPERRLOCK			(1 << 5) /* better naming? */
#define USBD_CONTROL_APP_RESUME		(1 << 1)
#define USBD_CONTROL_APP_DONECSR	(1 << 0)
#if 0 /* don't have these fields anymore */
#define USBD_CONTROL_APP_AUTO_INS_ZERO_LEN_PKT	0x4000
#define EN_TXZLENINS  (1<<14)
#endif

	uint32 usbd_straps;		/* 0x04 */
#define USBD_STRAPS_APP_SELF_PWR	(1 << 10)
#define USBD_STRAPS_APP_DEV_DISCON	(1 << 9)
#define USBD_STRAPS_APP_CSRPRG_SUP	(1 << 8)
#define USBD_STRAPS_APP_RAM_IF		(1 << 7)
#define USBD_STRAPS_APP_DEV_RMTWKUP	(1 << 6)
#define USBD_STRAPS_APP_PHYIF_8BIT	(1 << 2)
#define USBD_STRAPS_FULL_SPEED		0x0003
#define USBD_STRAPS_LOW_SPEED		0x0002
#define USBD_STRAPS_HIGH_SPEED		0x0000
#define APPUTMIDIR(x)			((x & 1) << 3)
#define UNIDIR				0

	uint32 usbd_stall;		/* 0x08 */
#define USB_ENDPOINT_0			0x01

	uint32 usbd_status;		/* 0x0c */
#define USBD_ENUM_SPEED_SHIFT		12
#define USBD_ENUM_SPEED			(0x3 << USBD_ENUM_SPEED_SHIFT)
#define UDC20_ALTINTF(x)		((x >> 8) & 0xf)
#define UDC20_INTF(x)			((x >> 4) & 0xf)
#define UDC20_CFG(x)			((x >> 0) & 0xf)

	uint32 usbd_events;		/* 0x10 */
	uint32 usbd_events_irq;		/* 0x14 */
#define USBD_LINK			(1 << 10)
#define USBD_SET_CSRS			(1 << 6)
#define USBD_SUSPEND			(1 << 5)
#define USBD_EARLY_SUSPEND		(1 << 4)
#define USBD_SOF			(1 << 3)
#define USBD_ENUMON			(1 << 2)
#define USBD_SETUP			(1 << 1)
#define USBD_USBRESET			(1 << 0)

	uint32 usbd_irqcfg_hi;		/* 0x18 */
	uint32 usbd_irqcfg_lo;		/* 0x1c */
#define UPPER(x)		(16+x)
#define ENABLE(x)		(1 << x)
#define SWP_TXBSY		(15)
#define SWP_RXBSY		(14)
#define SETUP_ERR		(13)
#define APPUDCSTALLCHG		(12)
#define BUS_ERR			(11)
#define USB_LINK		(10)
#define HST_SETCFG		(9)
#define HST_SETINTF		(8)
#define ERRATIC_ERR		(7)
#define SET_CSRS		(6)
#define SUSPEND			(5)
#define ERLY_SUSPEND		(4)
#define SOF			(3)
#define ENUM_ON			(2)
#define SETUP			(1)
#define USB_RESET		(0)
#define RISING(x)		(0x0 << (2 * x))
#define FALLING(x)		(0x1 << (2 * x))
#define USBD_IRQCFG_ENUM_ON_FALLING_EDGE	0x00000010

	uint32 usbd_events_irq_mask;	/* 0x20 */
#define USBD_USB_LINK_IRQ		(1 << 10)
#define USBD_USB_SETCFG_IRQ		(1 << 9)
#define USBD_USB_ERRATIC_ERR_IRQ	(1 << 7)
#define USBD_USB_SET_CSRS_IRQ		(1 << 6)
#define USBD_USB_SUSPEND_IRQ		(1 << 5) /* non-standard setup cmd rcvd */
#define USBD_USB_EARLY_SUSPEND_IRQ	(1 << 4)
#define USBD_USB_SOF_IRQ		(1 << 3)
#define USBD_USB_ENUM_ON_IRQ		(1 << 2)
#define USBD_USB_SETUP_IRQ		(1 << 1) /* non-standard setup cmd rcvd */
#define USBD_USB_RESET_IRQ		(1 << 0)

	uint32 usbd_swcfg;
	uint32 usbd_swtxctl;
	uint32 usbd_swrxctl;

	uint32 usbd_txfifo_rwptr;	/* 0x30 */
	uint32 usbd_rxfifo_rwptr;
	uint32 usbd_txfifo_st_rwptr;
	uint32 usbd_rxfifo_st_rwptr;

	uint32 usbd_txfifo0_config;	/* 0x40 */
	uint32 usbd_txfifo1_config;
	uint32 usbd_txfifo2_config;
	uint32 unsed0[13];

	uint32 usbd_rxfifo0_config;	/* 0x80 */
	uint32 usbd_rxfifo1_config;
	uint32 usbd_rxfifo2_config;

#if 0	// FIXME! Removed fields
	uint32 usbd_txfifo_epsize;
	uint32 usbd_rxfifo_epsize;
#define USBD_EPNUM_CTRL		0x0
#define USBD_EPNUM_ISO		0x1
#define USBD_EPNUM_BULK		0x2
#define USBD_EPNUM_IRQ		0x3
#define USBD_EPNUM_EPTYPE(x)	(((x)&0x3)<<8)
#define USBD_EPNUM_EPDMACHMAP(x)	(((x)&0xf)<<0)
	uint32 usbd_epnum_typemap ;
	uint32 usbd_reserved [0xB] ;
	uint32 usbd_csr_setupaddr ;
#define USBD_EPNUM_MASK		0xf
#define USBD_EPNUM(x)		((x&USBD_EPNUM_MASK)<<0)
#define USBD_EPDIR_IN		(1<<4)
#define USBD_EPDIR_OUT		(0<<4)
#define USBD_EPTYP_CTRL		(USBD_EPNUM_CTRL<<5)
#define USBD_EPTYP_ISO		(USBD_EPNUM_ISO<<5)
#define USBD_EPTYP_BULK		(USBD_EPNUM_BULK<<5)
#define USBD_EPTYP_IRQ		(USBD_EPNUM_IRQ<<5)
#define USBD_EPCFG_MASK		0xf
#define USBD_EPCFG(x)		((x&USBD_EPCFG_MASK)<<7)
#define USBD_EPINTF_MASK	0xf
#define USBD_EPINTF(x)		((x&USBD_EPINTF_MASK)<<11)
#define USBD_EPAINTF_MASK	0xf
#define USBD_EPAINTF(x)		((x&USBD_EPAINTF_MASK)<<15)
#define USBD_EPMAXPKT_MSK	0x7ff
#define USBD_EPMAXPKT(x)	((x&USBD_EPMAXPKT_MSK)<<19)
#define USBD_EPISOPID_MASK	0x3
#define USBD_EPISOPID(x)	((x&USBD_ISOPID_MASK)<<30)
	uint32 usbd_csr_ep [5];
#endif
} UsbRegisters;

typedef struct UsbDmaCtrlRegisters {
	uint32 ctrl_config;	/* 0x00 */
	uint32 ch1_flow_ctrl_low_thresh;
	uint32 ch1_flow_ctrl_high_thresh;
	uint32 ch1_flow_ctrl_buffer_alloc;

	uint32 ch3_flow_ctrl_low_thresh;	/* 0x10 */
	uint32 ch3_flow_ctrl_high_thresh;
	uint32 ch3_flow_ctrl_buffer_alloc;
	uint32 ch5_flow_ctrl_low_thresh;

	uint32 ch5_flow_ctrl_high_thresh;	/* 0x20 */
	uint32 ch5_flow_ctrl_buffer_alloc;
	uint32 ch7_flow_ctrl_low_thresh;
	uint32 ch7_flow_ctrl_high_thresh;

	uint32 ch7_flow_ctrl_buffer_alloc;	/* 0x30 */
	uint32 channel_reset;
	uint32 channel_debug;
	uint32 unused;

	uint32 global_interrupt_status;		/* 0x40 */
	uint32 global_interrupt_mask;
} UsbDmaCtrlRegisters;

typedef struct UsbDmaChCtrlRegisters {
	uint32 config;
	uint32 interrupt_status;
	uint32 interrupt_mask;
	uint32 interrupt_maxburst_cfg;
} UsbDmaChCtrlRegisters;

typedef struct UsbDmaChStateRamRegisters {
	uint32 start_addr;
	uint32 state;
	uint32 desc_word1;
	uint32 desc_word2;
} UsbDmaChStateRamRegisters;

#define USB ((volatile UsbRegisters * const) USB_CTL_BASE)
#define USB_DMA_CTRL ((volatile UsbDmaCtrlRegisters * const) (USB_CTL_BASE + 0x800))


/*
 * DDR Phy
 */
typedef struct DDRPhy {
	/* FIXME! do we need to define the register for this?
	 * since this should be handled in CFE */
} DDRPhy;

#define DDRPHY ((volatile DDRPhy * const) DDRPHY_BASE)

/*
** BCM APM Register Structure and definitions - APM is logic core it NOT present in 63148
*/
typedef struct ApmControlRegisters
{
