/*
<:copyright-BRCM:2012:proprietary:standard

   Copyright (c) 2012 Broadcom 
   All Rights Reserved

 This program is the proprietary software of Broadcom and/or its
 licensors, and may only be used, duplicated, modified or distributed pursuant
 to the terms and conditions of a separate, written license agreement executed
 between you and Broadcom (an "Authorized License").  Except as set forth in
 an Authorized License, Broadcom grants no license (express or implied), right
 to use, or waiver of any kind with respect to the Software, and Broadcom
 expressly reserves all rights in and to the Software and all intellectual
 property rights therein.  IF YOU HAVE NO AUTHORIZED LICENSE, THEN YOU HAVE
 NO RIGHT TO USE THIS SOFTWARE IN ANY WAY, AND SHOULD IMMEDIATELY NOTIFY
 BROADCOM AND DISCONTINUE ALL USE OF THE SOFTWARE.

 Except as expressly set forth in the Authorized License,

 1. This program, including its structure, sequence and organization,
    constitutes the valuable trade secrets of Broadcom, and you shall use
    all reasonable efforts to protect the confidentiality thereof, and to
    use this information only in connection with your use of Broadcom
    integrated circuit products.

 2. TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED "AS IS"
    AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES, REPRESENTATIONS OR
    WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH

/* Definitions for ulSsteUtoPortPcrW0. */
#define SSTE_UTOPCRMW_PCR_PLVLWT_MASK       0x0000000f
#define SSTE_UTOPCRMW_PCR_PLVLWT_SHIFT      0

#define SSTE_UTOPCRMW_PCR_INCR_MASK         0x7FFF0000
#define SSTE_UTOPCRMW_PCR_INCR_SHIFT        16

/* Definitions for ulSsteUtoPortPcrW1. */
#define SSTE_UTOPCRMW_PCR_CURACC_MASK       0x00007FFF
#define SSTE_UTOPCRMW_PCR_CURACC_SHIFT      0

#define SSTE_UTOPCRMW_PCR_ACCLMT_MASK       0x7FFF0000
#define SSTE_UTOPCRMW_PCR_ACCLMT_SHIFT      16

/* Definitions for ulSsteUtoPortPcrW2. */
#define SSTE_UTOPCRMW_PCR_CURSIT_MASK       0x00007FFF
#define SSTE_UTOPCRMW_PCR_CURSIT_SHIFT      0

#define SSTE_UTOPCRMW_PCR_SITLMT_MASK       0x7FFF0000
#define SSTE_UTOPCRMW_PCR_SITLMT_SHIFT      16

/* Definitions for ulSsteUtoGtsCfg. */
#define SSTE_UTOGTSCFG_MASK                 0x000000FF
#define SSTE_UTOGTSCFG_SHIFT                0

/* Definitions for ulSsteMpPriLevel. */
#define SSTE_LASTIDX_MP_MASK                0x0000000f
#define SSTE_LASTIDX_MP_SHIFT               0
#define SSTE_GT0VEC_MP_MASK                 0xffff0000
#define SSTE_GT0VEC_MP_SHIFT                16

#define SSTE_PMASKSC_MASK                   0x00007fff
#define SSTE_PMASKSC_SHIFT                  0
#define SSTE_ACTVLST_MP_MASK                0xffff0000
#define SSTE_ACTVLST_MP_SHIFT               16

#define RXPAF_INVALID_VCID                  0xf
#define RXPAF_VCID_MASK                     0xf
#define RXPAF_VCID_PREEMPTION_SHIFT         16
#define RXPAF_VCID_NON_PREEMPTION_SHIFT     0
#define RXPAF_VCID_SHIFT                    4

/* Definitions for ulSstMpQueueMask */
#define SST_MPG_QUEUE_MASK                  0xFFFF
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
#define SST_MPG_PER_QUEUE_MASK_REG          2
#else
#define SST_MPG_PER_QUEUE_MASK_REG          1
#endif
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
#define SST_SECOND_MPG_QUEUE_MASK_SHIFT     16
#else
#define SST_SECOND_MPG_QUEUE_MASK_SHIFT     0
#endif

/* Definitions ulSstMpPriArb */
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
#define NUM_MPN_PLVL_ARB_CONFIG_REG         2
#else
#define NUM_MPN_PLVL_ARB_CONFIG_REG         1 
#endif
#define MPN_PLVL_ARB_PLVL_MASK              0xFF
#define NUM_MPG_PER_ARB_CONFIG_REG          4
#define MPN_PLVL_ARB_MASK_SHIFT             8

/* Definitions ulSsForceMpArbRRxx */
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
#define NUM_MPN_ARB_FORCE_RR_CONFIG_REG         2
#else
#define NUM_MPN_ARB_FORCE_RR_CONFIG_REG         1 
#endif
#define MPN_ARB_FORCE_RR_MASK                   0xFF
#define NUM_MPG_PER_ARB_FORCE_RR_REG            4
#define MPN_ARB_FORCE_RR_MASK_SHIFT             8

#define SST_UTOPIA_CFG_ENABLE_PREEMPTION             0x00000040
#define SST_UTOPIA_CFG_PKTBUFQINDEX_PREEMPT_MASK     0x00000038
#define SST_UTOPIA_CFG_PKTBUFQINDEX_NON_PREEMPT_MASK 0x00000007

#define RXBOND_SIDOUT_CNT_DISABLE_UPDATE    0xF
#define RXBOND_SIDOUT_CNT_ENABLE_UPDATE     0x0

#define XTM_PROCESSOR_BASE    SAR_BASE

typedef struct XtmProcessorRegisters
{
    UINT32 ulTxChannelCfg[XP_MAX_CONNS];                            /* 0000 */
    UINT32 ulReserved1[4];                                          /* 0040 */
    UINT32 ulIrqStatus;                                             /* 0050 */
    UINT32 ulIrqMask;                                               /* 0054 */
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
    UINT32 ulSoftReset;                                             /* 0058 */
    UINT32 ulTxPacBufSpacePadding;                                  /* 005C */
#else
    UINT32 ulReserved2[2];                                          /* 0058 */
#endif
    UINT32 ulTxSarCfg;                                              /* 0060 */
    UINT32 ulTxSchedCfg;                                            /* 0064 */
    UINT32 ulTxOamCfg;                                              /* 0068 */
    UINT32 ulTxCtlStatus1;                                          /* 006c */
    UINT32 ulTxCtlStatus2;                                          /* 0070 */
    UINT32 ulTxMpCfg;                                               /* 0074 */
    UINT32 ulTxUtopiaCfg;                                           /* 0078 */
    UINT32 ulTxLineRateTimer;                                       /* 007c */
    UINT32 ulRxAtmCfg[XP_MAX_PORTS];                                /* 0080 */
    UINT32 ulRxSarCfg;                                              /* 0090 */
    UINT32 ulRxOamCfg;                                              /* 0094 */
    UINT32 ulRxAtmStatus;                                           /* 0098 */
    UINT32 ulRxUtopiaCfg;                                           /* 009c */
    UINT32 ulRxAalCfg;                                              /* 00a0 */
    UINT32 ulRxAalMaxSdu;                                           /* 00a4 */
    UINT32 ulRxAalStatus;                                           /* 00a8 */
    UINT32 ulLedCtrl;                                               /* 00ac */
#if defined(CONFIG_BCM963138) || defined(CONFIG_BCM963381) || defined(CONFIG_BCM963148) || defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
    UINT32 ulRxAalClenCrcErrCnt;                                    /* 00b0 */
    UINT32 ulRxAalMaxSduErrCnt;                                     /* 00b4 */
    UINT32 ulRxAtmErrCellVcid0;                                     /* 00b8 */
    UINT32 ulRxAtmErrCellVcid1;                                     /* 00bc */
    UINT32 ulReserved3[12];                                         /* 00c0 */
    UINT32 ulUbusCfg;                                               /* 00f0 */
    UINT32 ulUbusReqEop;                                            /* 00f4 */
    UINT32 ulReserved4[2];                                          /* 00f8 */
#else
    UINT32 ulReserved3[20];                                         /* 00b0 */
#endif
    UINT32 ulTxVpiVciTable[XP_MAX_CONNS];                           /* 0100 */
    UINT32 ulRxVpiVciCam[XP_MAX_CONNS * 2];                         /* 0140 */
    UINT32 ulReserved5[16];                                         /* 01c0 */
    UINT32 ulSstMpPriArb[NUM_MPN_PLVL_ARB_CONFIG_REG];              /* 0200 */
    UINT32 ulSstVcPriArb;                                           /* 0204  / 0208 */
    UINT32 ulSstLinkDownCount[XP_MAX_PORTS];                        /* 0208  / 020C */
    UINT32 ulSstUtopiaCfg;                                          /* 0218  / 021C */
    UINT32 ulSstRemapUtopiaCfg;                                     /* 021c  / 0220 */
    UINT32 ulSsPtmBondedPair;                                       /* 0220  / 0224 */
    UINT32 ulSstDiagDMode;                                          /* 0224  / 0228 */
    UINT32 ulSstSitValue;                                           /* 0228  / 022C */
    UINT32 ulSstSitSlowValue;                                       /* 022c  / 0230 */
    UINT32 ulSstMpQueueMask[XP_MAX_MPAAL_Q_IND];                    /* 0230  / 0234 */
    UINT32 ulSsMpGtsCfg[XP_MAX_MP_GROUPS];                          /* 0240  / 0244 */
    UINT32 ulSsTxDmaEmpty;                                          /* 0250  / 0264 */
    UINT32 ulSsPBufEmpty;                                           /* 0254  / 0268 */
    UINT32 ulSsTxToRxPtmLinkStateMap;                               /* 0258  / 026C */
    UINT32 ulSsForceVcArbRR;                                        /* 025c  / 0270 */
    UINT32 ulSsForceMpArbRR[NUM_MPN_ARB_FORCE_RR_CONFIG_REG];       /*       / 0274 */
    UINT32 ulSsDiagAdrMode;                                         /* 0264  / 027C */
    UINT32 ulSsNewCfgD0_or_Reserved6;                               /* 0268  / 0280 */
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
    UINT32 ulReserved7[31];                                         /*       / 0284 */
#else
    UINT32 ulReserved7[37];                                         /* 026C */
#endif
    UINT32 ulRxPktBufCfg;                                           /* 0300 */
    UINT32 ulRxPktBufThreshold;                                     /* 0304 */
    UINT32 ulRxPktBufVcid;                                          /* 0308 */
    UINT32 ulRxPktBufMem;                                           /* 030c */
    UINT32 ulRxPktBufData[2];                                       /* 0310 */
    UINT32 ulRxPktBufPtr;                                           /* 0318 */
    UINT32 ulRxPktBufSize;                                          /* 031c */
    UINT32 ulRxPktBufFifoStart[2];                                  /* 0320 */
    UINT32 ulRxPktBufFifoStop[2];                                   /* 0328 */
    UINT32 ulRxPktBufFifoDelay[2];                                  /* 0330 */
    UINT32 ulRxPktBufQueueFull;                                     /* 0338 */
    UINT32 ulRxPktBufNoBuf;                                         /* 033c */
    UINT32 ulRxPktBufErrorPkt;                                      /* 0340 */
    UINT32 ulRxPktBufErrorFrag;                                     /* 0344 */
    UINT32 ulRxPktBufTR;                                            /* 0348 */
    UINT32 ulRxPktBufFPM;                                           /* 034c */
    UINT32 ulRxPktBufMibCtrl;                                       /* 0350 */
    UINT32 ulRxPktBufMibMatch;                                      /* 0354 */
    UINT32 ulRxPktBufMibRxOctet;                                    /* 0358 */
    UINT32 ulRxPktBufMibRxPkt;                                      /* 035c */
    UINT32 ulReserved8[40];                                         /* 0360 */
    UINT32 ulRxPBufMuxVcidDefQueueId[2];                            /* 0400 */
    UINT32 ulRxPBufMuxMatch0DefQueueId;                             /* 0408 */
    UINT32 ulRxPBufMuxMatch1DefQueueId;                             /* 040c */
    UINT32 ulRxPBufMuxMatch2DefQueueId;                             /* 0410 */
    UINT32 ulRxPBufMuxMatch3DefQueueId;                             /* 0414 */
    UINT32 ulPBufMuxltMatch4DefQueueId;                             /* 0418 */
    UINT32 ulReserved9[57];                                         /* 041c */
    UINT32 ulTxHdrInsert[XP_MAX_TX_HDRS];                           /* 0500 */
    UINT32 ulTxHdrTxDatapathCfg;                                    /* 0520 */
    UINT32 ulReserved10[23];                                        /* 0524 */
    UINT32 ulTxHdrValues[XP_MAX_TX_HDRS][XP_TX_HDR_WORDS];          /* 0580 */
    UINT32 ulTxPortPktOctCnt[XP_MAX_PORTS];                         /* 0600 */
    UINT32 ulRxPortPktOctCnt[XP_MAX_PORTS];                         /* 0610 */
    UINT32 ulTxPortPktCnt[XP_MAX_PORTS];                            /* 0620 */
    UINT32 ulRxPortPktCnt[XP_MAX_PORTS];                            /* 0630 */
    UINT32 ulTxRxPortOamCellCnt[XP_MAX_PORTS];                      /* 0640 */
    UINT32 ulTxRxPortAsmCellCnt[XP_MAX_PORTS];                      /* 0650 */
    UINT32 ulRxPortErrorPktCellCnt[XP_MAX_PORTS];                   /* 0660 */
    UINT32 ulBondInputCellCnt;                                      /* 0670 */ /* Not defined in 158*/
    UINT32 ulBondOutputCellCnt;                                     /* 0674 */
    UINT32 ulReserved11;                                            /* 0678 */
    UINT32 ulMibCtrl;                                               /* 067c */
    UINT32 ulTxVcPktOctCnt[XP_MAX_CONNS];                           /* 0680 */
    UINT32 ulReserved12[16];                                        /* 06c0 */
    UINT32 ulDiagCtrl;                                              /* 0700 */
    UINT32 ulReserved13[63];                                        /* 0704 */
    UINT32 ulRxPafConfig;                                           /* 0800 */
    UINT32 ulRxPafStatus;                                           /* 0804 */
    UINT32 ulRxPafErrorStatus0;                                     /* 0808 */
    UINT32 ulRxPafVcid;                                             /* 080c */
    UINT32 ulRxPafFragSize;                                         /* 0810 */
    UINT32 ulRxPafPktSize;                                          /* 0814 */
    UINT32 ulRxPafLinkState;                                        /* 0818 */
    UINT32 ulRxPafWriteChanFlush;                                   /* 081c */
    UINT32 ulRxPafErrorStatus1;                                     /* 0820 */
    UINT32 ulRxPafErrorStatus2;                                     /* 0824 */
    UINT32 ulRxPafTestMode0;                                        /* 0828 */
#if defined(CONFIG_BCM963138) || defined(CONFIG_BCM963381) || defined(CONFIG_BCM963148) || defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
    UINT32 ulRxPafTestMode1;                                        /* 082c */
    UINT32 ulRxPafErrorStatus0_NC;                                  /* 0830 */
    UINT32 ulRxPafErrorStatus1_NC;                                  /* 0834 */
    UINT32 ulRxPafErrorStatus2_NC;                                  /* 0838 */
    UINT32 ulReserved14;                                            /* 083c */
#else
    UINT32 ulReserved14[5];                                         /* 082c */
#endif
    UINT32 ulRxPafCellCount[XP_MAX_RXPAF_WR_CHANNELS];              /* 0840 */
    UINT32 ulRxPafDroppedCellCount[XP_MAX_RXPAF_WR_CHANNELS];       /* 0860 */
    UINT32 ulRxPafFragCount[XP_MAX_RXPAF_WR_CHANNELS];              /* 0880 */
    UINT32 ulRxPafDroppedFragCount[XP_MAX_RXPAF_WR_CHANNELS];       /* 08a0 */
    UINT32 ulRxPafPktCount[XP_MAX_RXPAF_WR_CHANNELS];               /* 08c0 */
    UINT32 ulRxPafDroppedPktCount[XP_MAX_RXPAF_WR_CHANNELS];        /* 08e0 */
    UINT32 ulRxBondConfig;                                          /* 0900 */
    UINT32 ulRxBondStatus;                                          /* 0904 */
    UINT32 ulRxBondErrorStatus;                                     /* 0908 */
    UINT32 ulRxBondWriteChanToReadChan;                             /* 090c */
    UINT32 ulRxBondBufInit;                                         /* 0910 */
    UINT32 ulRxBondPafBufAddr;                                      /* 0914 */
    UINT32 ulRxBondPafBufData;                                      /* 0918 */
    UINT32 ulRxBondReclaim;                                         /* 091c */
    UINT32 ulRxBondStatus1;                                         /* 0920 */
    UINT32 ulRxBondSidStatus;                                       /* 0924 */
    UINT32 ulRxBondExpectedSid0;                                    /* 0928 */
    UINT32 ulRxBondExpectedSid1;                                    /* 092c */
    UINT32 ulRxBondBaseTimer;                                       /* 0930 */
    UINT32 ulRxBondTimeout0;                                        /* 0934 */
    UINT32 ulRxBondTimeout1;                                        /* 0938 */
    UINT32 ulRxBondSIDOutCnt;                                       /* 093c */
    UINT32 ulRxBondCellCount[XP_MAX_RXBOND_CHANNELS];               /* 0940 */
    UINT32 ulRxBondFragCount[XP_MAX_RXBOND_CHANNELS];               /* 0950 */
    UINT32 ulRxBondCellFull[XP_MAX_RXBOND_CHANNELS];                /* 0960 */
    UINT32 ulRxBondCellWriteAddr[XP_MAX_RXBOND_CHANNELS];           /* 0970 */
    UINT32 ulRxBondCellReadAddr[XP_MAX_RXBOND_CHANNELS];            /* 0980 */
    UINT32 ulRxBondReceivedSID[XP_MAX_RXBOND_CHANNELS];             /* 0990 */
    UINT32 ulRxBondDroppedFragCount[XP_MAX_RXPAF_WR_CHANNELS];      /* 09a0 */
    UINT32 ulRxBondErrorStatus_NC;                                  /* 09c0 */
    UINT32 ulReserved15[399];                                       /* 09c4 */
#if defined(CONFIG_BCM963158) || defined(CONFIG_BCM963178)
    UINT32 ulSsteMpPriLevel[XP_MAX_MP_GROUPS][XP_MAX_PRI_LEVELS][4];/* 1000 */
    UINT32 ulSsteQueueScr[XP_MAX_CONNS][4];                         /* 1400 */
    UINT32 ulSsteQueuePcr[XP_MAX_CONNS][4];                         /* 1500 */
    UINT32 ulSsteMpScr[XP_MAX_MP_GROUPS][4];                        /* 1600 */
    UINT32 ulSsteMpPcr[XP_MAX_MP_GROUPS][4];                        /* 1680 */
    UINT32 ulSsteQueueMpArb[XP_MAX_CONNS][2];                       /* 1700 */
    UINT32 ulSsteQueuePriLevel[XP_MAX_CONNS];                       /* 1780 */
    UINT32 ulSsteQueueGtsCfg[XP_MAX_CONNS];                         /* 17C0 */
    UINT32 ulSsteQueueArbWt[XP_MAX_CONNS];                          /* 1800 */
    UINT32 ulSsteMpVcArbWt[XP_MAX_MP_GROUPS];                       /* 1840 */
    UINT32 ulReserved16[8] ;                                        /* 1860 */
    UINT32 ulSsteUtoPortScr[XP_MAX_PORTS][4];                       /* 1880 */
    UINT32 ulSsteUtoPortPcr[XP_MAX_PORTS][4];                       /* 18C0 */
    UINT32 ulSsteUtoGtsCfg[XP_MAX_PORTS];                           /* 1900 */
#else
    UINT32 ulSsteQueueGtsCfg[XP_MAX_CONNS];                         /* 1000 */
    UINT32 ulSsteMpScr[XP_MAX_MP_GROUPS][4];                        /* 1040 */
    UINT32 ulSsteMpPcr[XP_MAX_MP_GROUPS][4];                        /* 1080 */
    UINT32 ulSsteMpVcArbWt[XP_MAX_MP_GROUPS];                       /* 10c0 */
    UINT32 ulReserved16[12];                                        /* 10d0 */
    UINT32 ulSsteQueueArbWt[XP_MAX_CONNS];                          /* 1100 */
    UINT32 ulSsteQueuePriLevel[XP_MAX_CONNS];                       /* 1140 */
    UINT32 ulSsteQueueMpArb[XP_MAX_CONNS][2];                       /* 1180 */
    UINT32 ulSsteMpPriLevel[XP_MAX_MP_GROUPS][XP_MAX_PRI_LEVELS][4];/* 1200 */
    UINT32 ulSsteQueueScr[XP_MAX_CONNS][4];                         /* 1400 */
    UINT32 ulSsteQueuePcr[XP_MAX_CONNS][4];                         /* 1500 */
#endif
} XTM_PROCESSOR_REGISTERS, *PXTM_PROCESSOR_REGISTERS;

#define XP_REGS ((volatile PXTM_PROCESSOR_REGISTERS const) XTM_PROCESSOR_BASE)

typedef struct TxPafProcessorRegisters
{
    UINT32 ulControl;                            /* 0000 */
} TXPAF_PROCESSOR_REGISTERS, *PTXPAF_PROCESSOR_REGISTERS;

#define TXPAF_PROCESSOR_CONTROL_ENABLE_MASK     0x00000001
#define TXPAF_REGS ((volatile PTXPAF_PROCESSOR_REGISTERS const) TXPAF_PROCESSOR_BASE)

#endif /* _XTMPROCREGS_IMPL2_H_ */
