/*
<:copyright-BRCM:2012:proprietary:standard

   Copyright (c) 2012 Broadcom 
   All Rights Reserved

 This program is the proprietary software of Broadcom and/or its
 licensors, and may only be used, duplicated, modified or distributed pursuant
 to the terms and conditions of a separate, written license agreement executed
 between you and Broadcom (an "Authorized License").  Except as set forth in
 an Authorized License, Broadcom grants no license (express or implied), right
 to use, or waiver of any kind with respect to the Software, and Broadcom
 expressly reserves all rights in and to the Software and all intellectual
 property rights therein.  IF YOU HAVE NO AUTHORIZED LICENSE, THEN YOU HAVE
 NO RIGHT TO USE THIS SOFTWARE IN ANY WAY, AND SHOULD IMMEDIATELY NOTIFY
 BROADCOM AND DISCONTINUE ALL USE OF THE SOFTWARE.

 Except as expressly set forth in the Authorized License,

 1. This program, including its structure, sequence and organization,
    constitutes the valuable trade secrets of Broadcom, and you shall use
    all reasonable efforts to protect the confidentiality thereof, and to
    use this information only in connection with your use of Broadcom
    integrated circuit products.

 2. TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED "AS IS"
    AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES, REPRESENTATIONS OR
    WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH

    ALL IMPLIED WARRANTIES OF TITLE, MERCHANTABILITY, NONINFRINGEMENT,
    FITNESS FOR A PARTICULAR PURPOSE, LACK OF VIRUSES, ACCURACY OR
    COMPLETENESS, QUIET ENJOYMENT, QUIET POSSESSION OR CORRESPONDENCE
    TO DESCRIPTION. YOU ASSUME THE ENTIRE RISK ARISING OUT OF USE OR
    PERFORMANCE OF THE SOFTWARE.

 3. TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL BROADCOM OR
    ITS LICENSORS BE LIABLE FOR (i) CONSEQUENTIAL, INCIDENTAL, SPECIAL,
    INDIRECT, OR EXEMPLARY DAMAGES WHATSOEVER ARISING OUT OF OR IN ANY
    WAY RELATING TO YOUR USE OF OR INABILITY TO USE THE SOFTWARE EVEN
    IF BROADCOM HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES;
    OR (ii) ANY AMOUNT IN EXCESS OF THE AMOUNT ACTUALLY PAID FOR THE
    SOFTWARE ITSELF OR U.S. $1, WHICHEVER IS GREATER. THESE LIMITATIONS
    SHALL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY
    LIMITED REMEDY.
:>
*/
/***********************************************************************/
/*                                                                     */
/*   MODULE:  6838_map.h                                               */
/*   PURPOSE: Define the proprietary hardware blocks/subblocks for     */
/*            BCM6838                                                  */
/*                                                                     */
/***********************************************************************/
#ifndef __BCM6838_MAP_H
#define __BCM6838_MAP_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__KERNEL__) || defined (_CFE_) || defined(FAP_4KE)
/* Access to registers from kernelspace */
#define REG_BASE                 0xa0000000
#else
/* Access to registers from userspace, see bcm_mmap.h for api */
#define REG_BASE                 (bcm_mmap_info.mmap_addr)
#define BCM_MMAP_INFO_BASE       0x10000000
#define BCM_MMAP_INFO_SIZE       0x01000000
#endif

#include "bcmtypes.h"
#include "6838_common.h"
#include "6838_intr.h"
#include "6838_map_part.h"

/* define proprietary block here. non-proprietary blocks in xxxx_map_part.h */
#define RDP_BASE                 ( REG_BASE +  0x13000000 ) /* RDP block */
#define PCM_BASE                 ( REG_BASE +  0x13a00200 ) /* APM PCM Registers */
#define APM_HVG_BASE             ( REG_BASE +  0x13a00300 ) /* APM HVG Registers */
#define APM_PCM_DMA_BASE         ( REG_BASE +  0x13a00800 ) /* APM/PCM DMA control registers */
#define PICO_IMEM_BASE           ( REG_BASE +  0x13a10000 ) /* PICO IMEM Block */
#define BSP_KS_BASE              ( REG_BASE +  0x14e03000 ) /* DRAM scrambler key generator BSP_KS register*/
#define BSP_RNG_BASE             ( REG_BASE +  0x14e03100 ) /* DRAM scrambler key generator BSP_RNG */


/* macro to convert logical data addresses to physical */
/* DMA hardware must see physical address */
#define LtoP( x )       ( (uint32)x & 0x1fffffff )
#define PtoL( x )       ( LtoP(x) | 0xa0000000 )

#ifndef __ASSEMBLER__

#if defined(__KERNEL__) && !defined(MODULE)
#error "PRIVATE FILE INCLUDED IN KERNEL"
#endif

/*
** OTP
*/
typedef struct Otp {
    uint32      Config;                 /* 0x0 */
#define   OTP_CONFIG_CPU_MODE             (1 << 1)
    uint32      Control;                /* 0x4 */
#define   OTP_CONTROL_START               (1 << 0)
#define   OTP_CONTROL_CMD_PROG_ENAB       (0x1 << 1) /* bits 5:1 are cmd bits. 0x0:read, 0x1: prog_enable, 0xa: prog_bit, 0xb: prog word */             
#define   OTP_CONTROL_CMD_PROG_WORD       (0xb << 1) /* bits 5:1 are cmd bits. 0x0:read, 0x1: prog_enable, 0xa: prog_bit, 0xb: prog word */             
#define   OTP_CONTROL_PROG_EN             (1 << 21)              
#define   OTP_CONTROL_ACCESS_MODE         (1 << 23)  /* bits 23:22 are access mode bits. set to 'b10 for fusing customer otp */             
    uint32      Status;                 /* 0x8 */
#define   OTP_STATUS_CMD_DONE             (1 << 0)
#define   OTP_STATUS_WRP_DATA_READY       (1 << 1)
#define   OTP_STATUS_WRP_FDONE            (1 << 7)
#define   OTP_STATUS_PROG_OK              (1 << 12)
#define   OTP_STATUS_OTP_READY            (1 << 16)
    uint32      Addr;                   /* 0xc */
    uint32      WriteData;              /* 0x10 */
    uint32      ReadData;               /* 0x14 */
    uint32      reserved0[2];           /* 0x18 */
    uint32      SecureBootConfig;       /* 0x20 */
    uint32      SWMask;                 /* 0x24 */
    uint32      DramMask;               /* 0x28 */
    uint32      SecrCR;                 /* 0x2c */
    uint32      reserved1[4];           /* 0x30 */
    uint32      BrcmBits[3];            /* 0x40 */
    uint32      dbgPER;                 /* 0x4c */
    uint32      BrcmMoreBits[4];        /* 0x50 */
    uint32      UserBits;               /* 0x60 */
    uint32      ControlHi;              /* 0x64 */
    uint32      Bitsel;                 /* 0x68 */
    uint32      reserved2[2];           /* 0x6c */
    uint32      DramShmooDone;          /* 0x74 */
} Otp;

#define OTP ((volatile Otp * const) OTP_BASE)

/* Word order is reversed for User OTP bits */
#define OTP_GET_BRCM_BIT(x)   ((OTP->BrcmBits[((x)/32)] >> ((x) % 32)) & 1)
#define OTP_GET_USER_BIT(x)   ((OTP->UserBits >> ((x) % 32)) & 1)
/* Extract manufacturer ID from OTP bits */
#define OTP_GET_MFG_ID()      ((OTP->dbgPER & 0x0F000000) >> 24)
#define MFG_ID_TSMC           0x0
#define MFG_ID_UMC            0xA

/*
** BCM APM Register Structure and definitions
*/
typedef struct ApmControlRegisters
{
     uint16 apm_dev_diag_sel;
#define   APM_DIAG_HI_SEL                 0xff00
#define   APM_DIAG_LO_SEL                 0x00ff

     uint16 apm_dev_irq_status;                     // (0x00) read only block interrupt status
#define   DEV_INTERRUPT                   0x0001        // DMA interrupt pending
#define   APM_INTERRUPT_1                 0x0002        // APM interrupt pending from bank 1
