/* SPDX-License-Identifier: GPL-2.0 */
/*
 * arch/arm/include/asm/arch-rmobile/rcar-base.h
 *
 * Copyright (C) 2013,2014 Renesas Electronics Corporation
 */

#ifndef __ASM_ARCH_RCAR_BASE_H
#define __ASM_ARCH_RCAR_BASE_H

/*
 * R-Car (R8A7790/R8A7791/R8A7792/R8A7793/R8A7794) I/O Addresses
 */
#define RWDT_BASE		0xE6020000
#define SWDT_BASE		0xE6030000
#define LBSC_BASE		0xFEC00200
#define DBSC3_0_BASE		0xE6790000
#define DBSC3_1_BASE		0xE67A0000
#define TMU_BASE		0xE61E0000
#define GPIO5_BASE		0xE6055000
#define SH_QSPI_BASE		0xE6B10000

/* SCIF */
#define SCIF0_BASE		0xE6E60000
#define SCIF1_BASE		0xE6E68000
#define SCIF2_BASE		0xE6E58000
#define SCIF3_BASE		0xE6EA8000
#define SCIF4_BASE		0xE6EE0000
#define SCIF5_BASE		0xE6EE8000
#define SCIFA0_BASE		0xE6C40000
#define SCIFA1_BASE		0xE6C50000
#define SCIFA2_BASE		0xE6C60000

/* Module stop status register */
#define MSTPSR0			0xE6150030
#define MSTPSR1			0xE6150038
#define MSTPSR2			0xE6150040
#define MSTPSR3			0xE6150048
#define MSTPSR4			0xE615004C
#define MSTPSR5			0xE615003C
#define MSTPSR7			0xE61501C4
#define MSTPSR8			0xE61509A0
#define MSTPSR9			0xE61509A4
#define MSTPSR10		0xE61509A8
#define MSTPSR11		0xE61509AC

/* Realtime module stop control register */
#define RMSTPCR0		0xE6150110
#define RMSTPCR1		0xE6150114
#define RMSTPCR2		0xE6150118
#define RMSTPCR3		0xE615011C
#define RMSTPCR4		0xE6150120
#define RMSTPCR5		0xE6150124
#define RMSTPCR7		0xE615012C
#define RMSTPCR8		0xE6150980
#define RMSTPCR9		0xE6150984

#define MXT_FDPSLVDMSCR		0xFF87210C
#define MXT_IMRSLVDMSCR		0xFF872110
#define MXT_VINSLVDMSCR		0xFF872114
#define MXT_VPC0SLVDMSCR	0xFF872118
#define MXT_VPC1SLVDMSCR	0xFF87211C
#define MXT_VSP0SLVDMSCR	0xFF872120
#define MXT_VSP1SLVDMSCR	0xFF872124
#define MXT_VSPD0SLVDMSCR	0xFF872128
#define MXT_VSPD1SLVDMSCR	0xFF87212C
#define MXT_MAP1SLVDMSCR	0xFF872130
#define MXT_MAP2SLVDMSCR	0xFF872134
#endif	/* R8A7792 */

/* DMS Register (MXI) */
#if defined(CONFIG_R8A7792)
#define	MXI_JPURDMSCR		0xFE964200
#define	MXI_JPUWDMSCR		0xFE966200
#define	MXI_VCTU0RDMSCR		0xFE964600
#define	MXI_VCTU0WDMSCR		0xFE966600
#define	MXI_VDCTU0RDMSCR	0xFE964604
#define	MXI_VDCTU0WDMSCR	0xFE966604
#define	MXI_VDCTU1RDMSCR	0xFE964608
#define	MXI_VDCTU1WDMSCR	0xFE966608
#define	MXI_VIN0WDMSCR		0xFE967608
#define	MXI_VIN1WDMSCR		0xFE966E08
#define	MXI_RDRWDMSCR		0xFE96760C
#define	MXI_IMS01RDMSCR		0xFE965600
#define	MXI_IMS01WDMSCR		0xFE967600
#define	MXI_IMS23RDMSCR		0xFE965604
#define	MXI_IMS23WDMSCR		0xFE967604
#define	MXI_IMS45RDMSCR		0xFE964E00
#define	MXI_IMS45WDMSCR		0xFE966E00
#define	MXI_IMRRDMSCR		0xFE964E04
#define	MXI_IMRWDMSCR		0xFE966E04
#define	MXI_ROTCE4RDMSCR	0xFE965200
#define	MXI_ROTCE4WDMSCR	0xFE967200
#define	MXI_ROTVLC4RDMSCR	0xFE965204
#define	MXI_ROTVLC4WDMSCR	0xFE967204
#define	MXI_VSPD0RDMSCR		0xFE964A00
#define	MXI_VSPD0WDMSCR		0xFE966A00
#define	MXI_VSPD1RDMSCR		0xFE964A04
#define	MXI_VSPD1WDMSCR		0xFE966A04
#define	MXI_DU0RDMSCR		0xFE964A08
#define	MXI_DU0WDMSCR		0xFE966A08
#define	MXI_VSP0RDMSCR		0xFE964A0C
#define	MXI_VSP0WDMSCR		0xFE966A0C
#define	MXI_ROTCE0RDMSCR	0xFE965A00
#define	MXI_ROTCE0WDMSCR	0xFE967A00
#define	MXI_ROTVLC0RDMSCR	0xFE965A04
#define	MXI_ROTVLC0WDMSCR	0xFE967A04
#define	MXI_ROTCE1RDMSCR	0xFE965A08
#define	MXI_ROTCE1WDMSCR	0xFE967A08
#define	MXI_ROTVLC1RDMSCR	0xFE965A0C
#define	MXI_ROTVLC1WDMSCR	0xFE967A0C
#define	MXI_ROTCE2RDMSCR	0xFE965E00
#define	MXI_ROTCE2WDMSCR	0xFE967E00
#define	MXI_ROTVLC2RDMSCR	0xFE965E04
#define	MXI_ROTVLC2WDMSCR	0xFE967E04
#define	MXI_ROTCE3RDMSCR	0xFE965E08
#define	MXI_ROTCE3WDMSCR	0xFE967E08
#define	MXI_ROTVLC3RDMSCR	0xFE965E0C
#define	MXI_ROTVLC3WDMSCR	0xFE967E0C
#endif	/* R8A7792 */

#define CCI_AXI_MMUS0DMSCR	0xFF882000
#define CCI_AXI_SYX2DMSCR	0xFF882004
#define CCI_AXI_MMURDMSCR	0xFF882008
#define CCI_AXI_MMUDSDMSCR	0xFF88200C
#define CCI_AXI_MMUMDMSCR	0xFF882010
#define CCI_AXI_MXIDMSCR	0xFF882014
#define CCI_AXI_MMUS1DMSCR	0xFF882018
#define CCI_AXI_MMUMPDMSCR	0xFF88201C
#define CCI_AXI_DVMDMSCR	0xFF882020
#define CCI_AXI_CCISLVDMSCR	0xFF882100

#define CCI_AXI_IPMMUIDVMCR	0xFF880400
#define CCI_AXI_IPMMURDVMCR	0xFF880404
#define CCI_AXI_IPMMUS0DVMCR	0xFF880408
#define CCI_AXI_IPMMUS1DVMCR	0xFF88040C
#define CCI_AXI_IPMMUMPDVMCR	0xFF880410
#define CCI_AXI_IPMMUDSDVMCR	0xFF880414
#define CCI_AXI_AX2ADDRMASK	0xFF88041C

#define PLL0CR			0xE61500D8
#define PLL0_STC_MASK		0x7F000000
#define PLL0_STC_BIT		24
#define PLLECR			0xE61500D0
#define PLL0ST			0x100

#ifndef __ASSEMBLY__
#include <asm/types.h>

/* RWDT */
struct rcar_rwdt {
	u32 rwtcnt;	/* 0x00 */
	u32 rwtcsra;	/* 0x04 */
	u16 rwtcsrb;	/* 0x08 */
};

/* SWDT */
struct rcar_swdt {
	u32 swtcnt;	/* 0x00 */
	u32 swtcsra;	/* 0x04 */
	u16 swtcsrb;	/* 0x08 */
};

/* LBSC */
struct rcar_lbsc {
	u32 cs0ctrl;
	u32 cs1ctrl;
	u32 ecs0ctrl;
	u32 ecs1ctrl;
	u32 ecs2ctrl;
	u32 ecs3ctrl;
	u32 ecs4ctrl;
	u32 ecs5ctrl;
	u32 dummy0[4];	/* 0x20 .. 0x2C */
	u32 cswcr0;
	u32 cswcr1;
	u32 ecswcr0;
	u32 ecswcr1;
	u32 ecswcr2;
	u32 ecswcr3;
	u32 ecswcr4;
	u32 ecswcr5;
	u32 exdmawcr0;
	u32 exdmawcr1;
	u32 exdmawcr2;
	u32 dummy1[9];	/* 0x5C .. 0x7C */
	u32 cspwcr0;
	u32 cspwcr1;
	u32 ecspwcr0;
	u32 ecspwcr1;
	u32 ecspwcr2;
	u32 ecspwcr3;
	u32 ecspwcr4;
	u32 ecspwcr5;
	u32 exwtsync;
	u32 dummy2[3];	/* 0xA4 .. 0xAC */
	u32 cs0bstctl;
	u32 cs0btph;
	u32 dummy3[2];	/* 0xB8 .. 0xBC */
	u32 cs1gdst;
	u32 ecs0gdst;
	u32 ecs1gdst;
	u32 ecs2gdst;
	u32 ecs3gdst;
	u32 ecs4gdst;
	u32 ecs5gdst;
	u32 dummy4[5];	/* 0xDC .. 0xEC */
	u32 exdmaset0;
	u32 exdmaset1;
	u32 exdmaset2;
	u32 dummy5[5];	/* 0xFC .. 0x10C */
	u32 exdmcr0;
	u32 exdmcr1;
	u32 exdmcr2;
	u32 dummy6[5];	/* 0x11C .. 0x12C */
	u32 bcintsr;
	u32 bcintcr;
	u32 bcintmr;
	u32 dummy7;	/* 0x13C */
	u32 exbatlv;
	u32 exwtsts;
	u32 dummy8[14];	/* 0x148 .. 0x17C */
	u32 atacsctrl;
	u32 dummy9[15]; /* 0x184 .. 0x1BC */
	u32 exbct;
	u32 extct;
};

/* DBSC3 */
struct rcar_dbsc3 {
	u32 dummy0[3];	/* 0x00 .. 0x08 */
	u32 dbstate1;
	u32 dbacen;
	u32 dbrfen;
	u32 dbcmd;
	u32 dbwait;
	u32 dbkind;
	u32 dbconf0;
	u32 dummy1[2];	/* 0x28 .. 0x2C */
	u32 dbphytype;
	u32 dummy2[3];	/* 0x34 .. 0x3C */
	u32 dbtr0;
	u32 dbtr1;
	u32 dbtr2;
	u32 dummy3;	/* 0x4C */
	u32 dbtr3;
	u32 dbtr4;
	u32 dbtr5;
	u32 dbtr6;
	u32 dbtr7;
	u32 dbtr8;
	u32 dbtr9;
	u32 dbtr10;
	u32 dbtr11;
	u32 dbtr12;
	u32 dbtr13;
	u32 dbtr14;
	u32 dbtr15;
	u32 dbtr16;
	u32 dbtr17;
	u32 dbtr18;
	u32 dbtr19;
	u32 dummy4[7];	/* 0x94 .. 0xAC */
	u32 dbbl;
	u32 dummy5[3];	/* 0xB4 .. 0xBC */
	u32 dbadj0;
	u32 dummy6;	/* 0xC4 */
	u32 dbadj2;
	u32 dummy7[5];	/* 0xCC .. 0xDC */
	u32 dbrfcnf0;
	u32 dbrfcnf1;
	u32 dbrfcnf2;
	u32 dummy8[2];	/* 0xEC .. 0xF0 */
	u32 dbcalcnf;
	u32 dbcaltr;
	u32 dummy9;	/* 0xFC */
	u32 dbrnk0;
	u32 dummy10[31];	/* 0x104 .. 0x17C */
	u32 dbpdncnf;
	u32 dummy11[47];	/* 0x184 ..0x23C */
	u32 dbdfistat;
	u32 dbdficnt;
	u32 dummy12[14];	/* 0x248 .. 0x27C */
	u32 dbpdlck;
	u32 dummy13[3];	/* 0x284 .. 0x28C */
	u32 dbpdrga;
	u32 dummy14[3];	/* 0x294 .. 0x29C */
	u32 dbpdrgd;
	u32 dummy15[24];	/* 0x2A4 .. 0x300 */
	u32 dbbs0cnt1;
	u32 dummy16[30];	/* 0x308 .. 0x37C */
	u32 dbwt0cnf0;
	u32 dbwt0cnf1;
	u32 dbwt0cnf2;
	u32 dbwt0cnf3;
	u32 dbwt0cnf4;
	u32 dummy17[27];	/* 0x394 .. 0x3FC */
	u32 dbeccmode;
	u32 dummy18[3];		/* 0x404 .. 0x40C */
	u32 dbeccarea0;
	u32 dbeccarea1;
	u32 dbeccarea2;
	u32 dbeccarea3;
	u32 dummy19[4];		/* 0x420 .. 0x42C */
	u32 dbeccintenable;
	u32 dbeccintdetect;
	u32 dummy20[22];	/* 0x438 .. 0x48C */
	u32 dbeccmodulcnt;
	u32 dummy21[27];	/* 0x494 .. 0x4FC */
	u32 dbschecnt0;
	u32 dummy22[63];	/* 0x504 .. 0x5FC */
	u32 dbreradr0;
	u32 dbreblane0;
	u32 dbrerid0;
	u32 dbrerinfo0;
	u32 dbureradr0;
	u32 dbureblane0;
	u32 dburerid0;
	u32 dburerinfo0;
	u32 dbreradr1;
	u32 dbreblane1;
	u32 dbrerid1;
	u32 dbrerinfo1;
	u32 dbureradr1;
	u32 dbureblane1;
	u32 dburerid1;
	u32 dburerinfo1;
	u32 dbreradr2;
	u32 dbreblane2;
	u32 dbrerid2;
	u32 dbrerinfo2;
	u32 dbureradr2;
	u32 dbureblane2;
	u32 dburerid2;
	u32 dburerinfo2;
	u32 dbreradr3;
	u32 dbreblane3;
	u32 dbrerid3;
	u32 dbrerinfo3;
	u32 dbureradr3;
	u32 dbureblane3;
	u32 dburerid3;
	u32 dburerinfo3;
	u32 dummy23[160];	/* 0x680 .. 0x8FC */
	u32 dbpccr;
	u32 dbpeier;
	u32 dbpeisr;
	u32 dummy24;
	u32 dbwdpesr0;
	u32 dbwspesr0;
	u32 dbpwear0;
	u32 dbpweid0;
	u32 dbpweinfo0;
	u32 dummy25[3];		/* 0x924 .. 0x92C */
	u32 dbwdpesr1;
	u32 dbwspesr1;
	u32 dbpwear1;
	u32 dbpweid1;
	u32 dbpweinfo1;
	u32 dummy26[3];		/* 0x944 .. 0x94C */
	u32 dbwdpesr2;
	u32 dbwspesr2;
	u32 dbpwear2;
	u32 dbpweid2;
	u32 dbpweinfo2;
	u32 dummy27[3];		/* 0x964 .. 0x96C */
	u32 dbwdpesr3;
	u32 dbwspesr3;
	u32 dbpwear3;
	u32 dbpweid3;
	u32 dbpweinfo3;
};

/* GPIO */
struct rcar_gpio {
	u32 iointsel;
	u32 inoutsel;
	u32 outdt;
	u32 indt;
	u32 intdt;
	u32 intclr;
	u32 intmsk;
	u32 posneg;
	u32 edglevel;
	u32 filonoff;
	u32 intmsks;
	u32 mskclrs;
	u32 outdtsel;
	u32 outdth;
	u32 outdtl;
	u32 bothedge;
};

/* S3C(QoS) */
struct rcar_s3c {
	u32 s3cexcladdmsk;
	u32 s3cexclidmsk;
	u32 s3cadsplcr;
	u32 s3cmaar;
	u32 s3carcr11;
	u32 s3crorr;
	u32 s3cworr;
	u32 s3carcr22;
	u32 dummy1[2];	/* 0x20 .. 0x24 */
	u32 s3cmctr;
	u32 dummy2;	/* 0x2C */
	u32 cconf0;
	u32 cconf1;
	u32 cconf2;
	u32 cconf3;
};

struct rcar_s3c_qos {
	u32 s3cqos0;
	u32 s3cqos1;
	u32 s3cqos2;
	u32 s3cqos3;
	u32 s3cqos4;
	u32 s3cqos5;
	u32 s3cqos6;
	u32 s3cqos7;
	u32 s3cqos8;
};

/* DBSC(QoS) */
struct rcar_dbsc3_qos {
	u32 dblgcnt;
	u32 dbtmval0;
	u32 dbtmval1;
	u32 dbtmval2;
	u32 dbtmval3;
	u32 dbrqctr;
	u32 dbthres0;
	u32 dbthres1;
	u32 dbthres2;
	u32 dummy0;	/* 0x24 */
	u32 dblgqon;
};

/* MXI(QoS) */
struct rcar_mxi {
	u32 mxsaar0;
	u32 mxsaar1;
	u32 dummy0[7];	/* 0x08 .. 0x20 */
	u32 mxaxiracr;	/* R8a7790 only */
	u32 mxs3cracr;
	u32 dummy1[2];	/* 0x2C .. 0x30 */
	u32 mxaxiwacr;	/* R8a7790 only */
	u32 mxs3cwacr;
	u32 dummy2;	/* 0x3C */
	u32 mxrtcr;
	u32 mxwtcr;
	u32 mxaxirtcr;	/* R8a7792 only */
	u32 mxaxiwtcr;
	u32 mxs3crtcr;
	u32 mxs3cwtcr;
};

struct rcar_mxi_qos {
	u32 vspdu0;
	u32 vspdu1;
	u32 du0;
	u32 du1;
};

/* AXI(QoS) */
struct rcar_axi_qos {
	u32 qosconf;
	u32 qosctset0;
	u32 qosctset1;
	u32 qosctset2;
	u32 qosctset3;
	u32 qosreqctr;
	u32 qosthres0;
	u32 qosthres1;
	u32 qosthres2;
	u32 qosqon;
	u32 qosin;
};

#endif

#endif /* __ASM_ARCH_RCAR_BASE_H */
